# 常见问题FAQ

## 关于openCypher兼容性

### nGQL兼容openCypher 9吗？

nGQL部分兼容openCypher 9。

在[Nebula Graph Issues](https://github.com/vesoft-inc/nebula-graph/issues)中已经列出已知的不兼容项。如果您发现这种类型的新问题，请提交问题并附带`incompatible`标签。您可以通过关键字`compatibility`搜索兼容性问题。

下面是nGQL和openCypher 9的主要差异（由于设计原因而不兼容）。

|类别| openCypher 9 | nGQL |
| :--- | :--- |:--- |
|Schema| 弱Schema | 强Schema |
|相等运算符| `=` |  `==` |
|数学求幂| `^` | 使用`pow(x, y)`替代`^` |  
|边rank| 无此概念 | 用`@rank`设置 |
|语句|-|不支持openCypher 9的所有DML语句（`CREATE`、`MERGE`等）和部分`MATCH`语句。 |

>**说明**：请注意[openCypher 9](http://www.opencypher.org/)和[Cypher](https://neo4j.com/developer/cypher/)在语法和许可上有一些不同。例如Cypher要求所有Cypher语句必须显式地在一个事务中执行，而openCypher没有这样的要求。另外，nGQL暂不支持事务。

### 哪里可以找到更多nGQL的示例？

您可以在Nebula Graph GitHub的[features](https://github.com/vesoft-inc/nebula-graph/tree/master/tests/tck/features)目录内查看超过2500条nGQL示例。

features目录内包含很多.features格式的文件，每个文件都记录了使用nGQL的场景和示例。例如：

```text
Feature: Match seek by tag

  Background: Prepare space
    Given a graph with space named "nba"

  Scenario: seek by empty tag index
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid
      """
    Then the result should be, in any order:
      | vid          |
      | 'Tim Duncan' |
    And no side effects
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid, v.age AS age
      """
    Then the result should be, in any order:
      | vid          | age |
      | 'Tim Duncan' | 42  |
    And no side effects
```

示例中的关键字说明如下。

|关键字|说明|
|:---|:---|
|`Feature`|描述当前文档的主题。|
|`Background`|描述当前文档的背景信息。|
|`Given`|描述执行示例语句的前提条件。|
|`Scenario`|描述具体场景。如果场景之前有`@skip`标识，表示这个场景下示例语句可能无法正常工作，请不要在生产环境中使用该示例语句。|
|`When`|描述要执行的nGQL示例语句。|
|`Then`|描述执行`When`内语句的预期返回结果。如果您的返回结果和文档不同，请提交[issue](https://github.com/vesoft-inc/nebula-graph/issues)通知Nebula Graph团队。|
|`And`|描述执行`When`内语句的副作用。|
| `@skip` | 跳过这个示例。通常表示测试代码还没有准备好。 |

欢迎您[增加更多实用场景示例](https://docs.nebula-graph.io/1.1/manual-EN/4.contributions/how-to-contribute/)，成为Nebula Graph贡献者。

## 关于数据模型

### Nebula Graph支持 W3C 的RDF（SPARQL 或 GraphQL）吗？

不支持。

Nebula Graph的数据模型是属性图，是一个强Schema系统，不支持RDF标准。

Nebula Graph的查询语言也不支持SPARQL和GraphQL。

## 关于执行

### 返回消息中`time spent`的含义是什么？

将命令`SHOW SPACES`返回的消息作为示例：

```nGQL
nebula> SHOW SPACES;
+------+
| Name |
+------+
| nba  |
+------+
Got 1 rows (time spent 1235/1934 us)
```

- 第一个数字`1235`表示数据库本身执行该命令花费的时间，即查询引擎从客户端接收到一个查询，然后从存储服务器获取数据并执行一系列计算所花费的时间。

- 第二个数字`1934`表示从客户端角度看所花费的时间，即从客户端发送请求、接收结果，然后在屏幕上显示结果所花费的时间。

### 可以在`CREATE SPACE`时设置`replica_factor`为偶数（例如设置为2）吗？

不要这样设置。

Storage服务使用Raft协议（多数表决），为保证可用性，要求出故障的副本数量不能达到一半。

如果`replica_factor=2`，当其中一个副本故障时，就会导致系统无法工作；如果`replica_factor=4`，只能有一个副本可以出现故障，这和`replica_factor=3`是一样。以此类推，所以`replica_factor`设置为奇数即可。

建议您在生产环境中设置`replica_factor=3`，测试环境中设置`replica_factor=1`，不要使用偶数。

### 如何处理报错`[ERROR (-7)]: SyntaxError: syntax error near`？

大部分情况下，查询语句需要有`YIELD`或`RETURN`，请检查您的查询语句是否包含。

### 如何统计每种Tag有多少个点，每个边类型有多少条边?

见[show-stats](../3.ngql-guide/7.general-query-statements/6.show/14.show-stats.md).

### 如何获取每种Tag的所有点，或者每种边类型的所有边?

1. 建立或者重建索引

```ngql
CREATE TAG INDEX i_player ON player();
REBUILD TAG INDEX i_player;
```

2. 使用 `LOOKUP` 或者 `MATCH`

```
LOOKUP ON player;
MATCH (n:player) RETURN n;
```

见 [`INDEX`](../3.ngql-guide/14.native-index-statements/1.create-native-index.md), [`LOOKUP`](../3.ngql-guide/7.general-query-statements/5.lookup.md) 和 [`MATCH`](../3.ngql-guide/7.general-query-statements/2.match.md).

## 关于运维

### 日志文件过大，怎么回收？

Nebula Graph 使用 [glog](https://github.com/google/glog) 来打印日志. `glog` 没有日志回收的功能. 所以你只能自己删除这些文件。可以参见论坛上提供的办法[`Glog should delete old log files automaticly`](https://github.com/google/glog/issues/423).

## 关于本手册

### 手册示例和系统行为不一致

Nebula Graph 2.0 一直在持续开发，它的部分行为会有变化。如果你发现不一致，请告知[我们](https://github.com/vesoft-inc/nebula-docs-cn/issues)。