# 日期和时间类型

本文介绍日期和时间的类型，包括`DATE`、`TIME`、`DATETIME`和`TIMESTAMP`。

Nebula Graph将当前时区转换为协调世界时间（UTC）并存储，查询时会再次转换回当前时区（`TIMESTAMP`例外）。

结合`RETURN`子句，函数`date()`、`time()`和`datetime()`可以用空值返回当前的日期或时间。

## OpenCypher兼容性

- 支持年、月、日、时、分、秒、毫秒，不支持纳秒和时区。

- 不支持函数`localdatetime()`和`duration()`。

- 不支持大部分字符串时间格式，仅支持`YYYY-MM-DDThh:mm:ss`。

## DATE

`DATE`包含日期，但是不包含时间。Nebula Graph检索和显示`DATE`的格式为`YYYY-MM-DD`。支持的范围是`-32768-01-01`到`32767-12-31`。

## TIME

`TIME`包含时间，但是不包含日期。Nebula Graph检索和显示`TIME`的格式为`hh:mm:ss.ususus`。支持的范围是`00:00:00.000`到`23:59:59.999`。

## DATETIME

`DATETIME`包含日期和时间。Nebula Graph检索和显示`DATETIME`的格式为`YYYY-MM-DDThh:mm:ss.ususus`。支持的范围是`-32768-01-01T00:00:00.000`到`32767-12-31T23:59:59.999`。

## TIMESTAMP

`TIMESTAMP`包含日期和时间。支持的范围是UTC时间的`1970-01-01T00:00:01`到`2262-04-11T23:47:16`。

`TIMESTAMP`还有以下特点：

- 以时间戳形式存储和显示。例如`1615974839`，表示`2021-03-17T17:53:59`。

- 查询`TIMESTAMP`的方式包括时间戳和`timestamp()`函数。

- 插入`TIMESTAMP`的方式包括时间戳、`timestamp()`函数和`now()`函数。

- 底层存储的数据格式为**64位int**。

## 示例

1. 创建标签，名称为`date1`，包含`DATE`、`TIME`和`DATETIME`三种类型。

    ```ngql
    nebula> CREATE TAG date1(p1 date, p2 time, p3 datetime);
    ```

2. 插入点，名称为`test1`。

    ```ngql
    nebula> INSERT VERTEX date1(p1, p2, p3) VALUES "test1":(date("2021-03-17"), time("17:53:59"), datetime("2021-03-17T17:53:59"));
    ```

3. 创建标签，名称为`school`，包含`TIMESTAMP`类型。

    ```ngql
    nebula> CREATE TAG school(name string , found_time timestamp);
    ```

4. 插入点，名称为`DUT`，存储时间为`"1988-03-01T08:00:00"`。

    ```ngql
    # 时间戳形式插入，1988-03-01T08:00:00对应的时间戳为573177600，转换为UTC时间为573206400。
    nebula> INSERT VERTEX school(name, found_time) VALUES "DUT":("DUT", 573206400);

    # 日期和时间格式插入。
    nebula> INSERT VERTEX school(name, found_time) VALUES "DUT":("DUT", timestamp("1988-03-01T08:00:00"));
    ```

5. 插入点，名称为`dut`，用`now()`函数存储时间。

    ```ngql
    nebula> INSERT VERTEX school(name, found_time) VALUES "dut":("dut", now());
    ```

您还可以使用`WITH`语句设置具体日期和时间，例如：

```ngql
nebula> WITH time({hour: 12, minute: 31, second: 14}) AS d RETURN d;
+--------------+
| d            |
+--------------+
| 12:31:14.000 |
+--------------+

nebula> WITH date({year: 1984, month: 10, day: 11}) AS x RETURN x + 1;
+------------+
| x          |
+------------+
| 1984-10-12 |
+------------+
```
