
<!DOCTYPE html>

<html class="no-js" lang="zh">
<head>
<meta charset="utf-8"/>
<meta content="width=device-width,initial-scale=1" name="viewport"/>
<meta content="ie=edge" http-equiv="x-ua-compatible"/>
<meta content="Documentation for Nebula Graph Database" name="description"/>
<link href="https://docs.nebula-graph.com.cn/3.ngql-guide/7.general-query-statements/2.match/" rel="canonical"/>
<meta content="Nebula Graph" name="author"/>
<meta content="复制" name="lang:clipboard.copy"/>
<meta content="已复制" name="lang:clipboard.copied"/>
<meta content="ja" name="lang:search.language"/>
<meta content="True" name="lang:search.pipeline.stopwords"/>
<meta content="True" name="lang:search.pipeline.trimmer"/>
<meta content="没有找到符合条件的结果" name="lang:search.result.none"/>
<meta content="找到 1 个符合条件的结果" name="lang:search.result.one"/>
<meta content="# 个符合条件的结果" name="lang:search.result.other"/>
<meta content="[\uff0c\u3002]+" name="lang:search.tokenizer"/>
<link href="../../../assets/images/favicon.ico" rel="shortcut icon"/>
<meta content="mkdocs-1.1.2, mkdocs-material-4.6.3" name="generator"/>
<title>Match - Nebula Graph Database 内核手册</title>
<link href="../../../assets/stylesheets/application.adb8469c.css" rel="stylesheet"/>
<link href="../../../assets/stylesheets/application-palette.a8b3c06d.css" rel="stylesheet"/>
<meta content="#3f51b5" name="theme-color"/>
<script src="../../../assets/javascripts/modernizr.86422ebf.js"></script>
<link crossorigin="" href="https://fonts.gstatic.com" rel="preconnect"/>
<link href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&amp;display=fallback" rel="stylesheet"/>
<style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
<link href="../../../assets/fonts/material-icons.css" rel="stylesheet"/>
<link href="../../../stylesheets/logo.css" rel="stylesheet"/>
<link href="../../../css/version-select.css" rel="stylesheet"/>
</head>
<body data-md-color-accent="indigo" data-md-color-primary="indigo" dir="ltr">
<svg class="md-svg">
<defs>
<svg height="448" id="__github" viewbox="0 0 416 448" width="416" xmlns="http://www.w3.org/2000/svg"><path d="M160 304q0 10-3.125 20.5t-10.75 19T128 352t-18.125-8.5-10.75-19T96 304t3.125-20.5 10.75-19T128 256t18.125 8.5 10.75 19T160 304zm160 0q0 10-3.125 20.5t-10.75 19T288 352t-18.125-8.5-10.75-19T256 304t3.125-20.5 10.75-19T288 256t18.125 8.5 10.75 19T320 304zm40 0q0-30-17.25-51T296 232q-10.25 0-48.75 5.25Q229.5 240 208 240t-39.25-2.75Q130.75 232 120 232q-29.5 0-46.75 21T56 304q0 22 8 38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0 37.25-1.75t35-7.375 30.5-15 20.25-25.75T360 304zm56-44q0 51.75-15.25 82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5T212 416q-19.5 0-35.5-.75t-36.875-3.125-38.125-7.5-34.25-12.875T37 371.5t-21.5-28.75Q0 312 0 260q0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25 30.875Q171.5 96 212 96q37 0 70 8 26.25-20.5 46.75-30.25T376 64q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34 99.5z" fill="currentColor"></path></svg>
</defs>
</svg>
<input autocomplete="off" class="md-toggle" data-md-toggle="drawer" id="__drawer" type="checkbox"/>
<input autocomplete="off" class="md-toggle" data-md-toggle="search" id="__search" type="checkbox"/>
<label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
<a class="md-skip" href="#match" tabindex="0">
        跳转至
      </a>
<header class="md-header" data-md-component="header">
<nav class="md-header-nav md-grid">
<div class="md-flex">
<div class="md-flex__cell md-flex__cell--shrink">
<a aria-label="Nebula Graph Database 内核手册" class="md-header-nav__button md-logo" href="https://docs.nebula-graph.com.cn/" title="Nebula Graph Database 内核手册">
<img alt="logo" height="24" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" width="24"/>
</a>
</div>
<div class="md-flex__cell md-flex__cell--shrink">
<label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
</div>
<div class="md-flex__cell md-flex__cell--stretch">
<div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
<span class="md-header-nav__topic">
              Nebula Graph Database 内核手册
            </span>
<span class="md-header-nav__topic">
              
                Match
              
            </span>
</div>
</div>
<div class="md-flex__cell md-flex__cell--shrink">
<label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
<div class="md-search" data-md-component="search" role="dialog">
<label class="md-search__overlay" for="__search"></label>
<div class="md-search__inner" role="search">
<form class="md-search__form" name="search">
<input aria-label="search" autocapitalize="off" autocomplete="off" autocorrect="off" class="md-search__input" data-md-component="query" data-md-state="active" name="query" placeholder="搜索" spellcheck="false" type="text"/>
<label class="md-icon md-search__icon" for="__search"></label>
<button class="md-icon md-search__icon" data-md-component="reset" tabindex="-1" type="reset">
        
      </button>
</form>
<div class="md-search__output">
<div class="md-search__scrollwrap" data-md-scrollfix="">
<div class="md-search-result" data-md-component="result">
<div class="md-search-result__meta">
            键入以开始搜索
          </div>
<ol class="md-search-result__list"></ol>
</div>
</div>
</div>
</div>
</div>
</div>
<div class="md-flex__cell md-flex__cell--shrink">
<div class="md-header-nav__source">
<a class="md-source" data-md-source="github" href="https://github.com/vesoft-inc/nebula" title="前往 Github 仓库">
<div class="md-source__icon">
<svg height="24" viewbox="0 0 24 24" width="24">
<use height="24" width="24" xlink:href="#__github"></use>
</svg>
</div>
<div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
</div>
</div>
</div>
</nav>
</header>
<div class="md-container">
<main class="md-main" role="main">
<div class="md-main__inner md-grid" data-md-component="container">
<div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
<div class="md-sidebar__scrollwrap">
<div class="md-sidebar__inner">
<nav class="md-nav md-nav--primary" data-md-level="0">
<label class="md-nav__title md-nav__title--site" for="__drawer">
<a class="md-nav__button md-logo" href="https://docs.nebula-graph.com.cn/" title="Nebula Graph Database 内核手册">
<img alt="logo" height="48" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" width="48"/>
</a>
    Nebula Graph Database 内核手册
  </label>
<div class="md-nav__source">
<a class="md-source" data-md-source="github" href="https://github.com/vesoft-inc/nebula" title="前往 Github 仓库">
<div class="md-source__icon">
<svg height="24" viewbox="0 0 24 24" width="24">
<use height="24" width="24" xlink:href="#__github"></use>
</svg>
</div>
<div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
</div>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-1" id="nav-1" type="checkbox"/>
<label class="md-nav__link" for="nav-1">
      简介
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-1">
        简介
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/1.what-is-nebula-graph/" title="什么是Nebula Graph">
      什么是Nebula Graph
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/2.data-model/" title="数据结构">
      数据结构
    </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-1-3" id="nav-1-3" type="checkbox"/>
<label class="md-nav__link" for="nav-1-3">
      Nebula Graph架构
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-1-3">
        Nebula Graph架构
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" title="架构总览">
      架构总览
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" title="Meta服务">
      Meta服务
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/" title="Graph服务">
      Graph服务
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/" title="Storage服务">
      Storage服务
    </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-2" id="nav-2" type="checkbox"/>
<label class="md-nav__link" for="nav-2">
      快速入门
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-2">
        快速入门
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/0.FAQ/" title="FAQ">
      FAQ
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/1.quick-start-workflow/" title="快速入门流程">
      快速入门流程
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/2.deploy-nebula-graph-with-docker-compose/" title="Docker Compose部署Nebula Graph">
      Docker Compose部署Nebula Graph
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/5.start-stop-service/" title="管理Nebula Graph服务">
      管理Nebula Graph服务
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/3.connect-to-nebula-graph/" title="连接Nebula Graph">
      连接Nebula Graph
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/4.nebula-graph-crud/" title="Nebula Graph常用语法（CRUD）">
      Nebula Graph常用语法（CRUD）
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/6.useful-links/" title="常用链接">
      常用链接
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--active md-nav__item--nested">
<input checked="" class="md-toggle md-nav__toggle" data-md-toggle="nav-3" id="nav-3" type="checkbox"/>
<label class="md-nav__link" for="nav-3">
      nGQL指南
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-3">
        nGQL指南
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-1" id="nav-3-1" type="checkbox"/>
<label class="md-nav__link" for="nav-3-1">
      nGQL概述
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-1">
        nGQL概述
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/1.overview/" title="Nebula Graph查询语言（nGQL）">
      Nebula Graph查询语言（nGQL）
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/2.graph-modeling/" title="图建模">
      图建模
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/3.graph-patterns/" title="模式">
      模式
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-2" id="nav-3-2" type="checkbox"/>
<label class="md-nav__link" for="nav-3-2">
      数据类型
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-2">
        数据类型
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/1.numeric/" title="数值">
      数值
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/2.boolean/" title="布尔">
      布尔
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/3.string/" title="字符串">
      字符串
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/4.date-and-time/" title="日期时间">
      日期时间
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/5.null/" title="NULL">
      NULL
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/6.list/" title="列表">
      列表
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/7.set/" title="集合">
      集合
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/8.map/" title="映射">
      映射
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/9.type-conversion/" title="类型转换">
      类型转换
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-3" id="nav-3-3" type="checkbox"/>
<label class="md-nav__link" for="nav-3-3">
      变量和复合查询
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-3">
        变量和复合查询
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/1.composite-queries/" title="复合查询">
      复合查询
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/2.user-defined-variables/" title="自定义变量">
      自定义变量
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/3.property-reference/" title="引用属性">
      引用属性
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4" id="nav-3-4" type="checkbox"/>
<label class="md-nav__link" for="nav-3-4">
      运算符
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-4">
        运算符
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/1.comparison/" title="比较符">
      比较符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/2.boolean/" title="布尔符">
      布尔符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/4.pipe/" title="管道符">
      管道符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/5.property-reference/" title="属性引用符">
      属性引用符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/6.set/" title="集合运算符">
      集合运算符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/7.string/" title="字符串运算符">
      字符串运算符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/8.list/" title="列表运算符">
      列表运算符
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/9.precedence/" title="运算符优先级">
      运算符优先级
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-5" id="nav-3-5" type="checkbox"/>
<label class="md-nav__link" for="nav-3-5">
      函数和表达式
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-5">
        函数和表达式
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/1.math/" title="数学函数">
      数学函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/2.string/" title="字符串函数">
      字符串函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/3.date-and-time/" title="日期时间函数">
      日期时间函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/4.schema/" title="Schema函数">
      Schema函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/5.case-expressions/" title="CASE表达式">
      CASE表达式
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/6.list/" title="列表函数">
      列表函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/7.count/" title="count函数">
      count函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/10.collect/" title="collect函数">
      collect函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/11.reduce/" title="reduce函数">
      reduce函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/12.hash/" title="hash函数">
      hash函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/8.predicate/" title="谓词函数">
      谓词函数
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/9.user-defined-functions/" title="自定义函数">
      自定义函数
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--active md-nav__item--nested">
<input checked="" class="md-toggle md-nav__toggle" data-md-toggle="nav-3-6" id="nav-3-6" type="checkbox"/>
<label class="md-nav__link" for="nav-3-6">
      通用查询语句
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-6">
        通用查询语句
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--active">
<input class="md-toggle md-nav__toggle" data-md-toggle="toc" id="__toc" type="checkbox"/>
<label class="md-nav__link md-nav__link--active" for="__toc">
        Match
      </label>
<a class="md-nav__link md-nav__link--active" href="./" title="Match">
      Match
    </a>
<nav class="md-nav md-nav--secondary">
<label class="md-nav__title" for="__toc">目录</label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="#_1">
    语法
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_1">
    MATCH工作流程
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#opencypher">
    openCypher兼容性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#pattern">
    使用模式（pattern）
  </a>
<nav class="md-nav">
<ul class="md-nav__list">
<li class="md-nav__item">
<a class="md-nav__link" href="#_2">
    前提条件
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_3">
    匹配点
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_4">
    匹配标签
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_5">
    匹配点的属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#id">
    匹配点ID
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_6">
    匹配连接的点
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_7">
    匹配路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_8">
    匹配边
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_9">
    匹配边类型和属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_10">
    匹配多个边类型
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_11">
    匹配多条边
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_12">
    匹配定长路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_13">
    匹配变长路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_14">
    匹配多个边类型的变长路径
  </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_15">
    常用检索操作
  </a>
<nav class="md-nav">
<ul class="md-nav__list">
<li class="md-nav__item">
<a class="md-nav__link" href="#_16">
    检索点或边的信息
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#id_1">
    检索点ID
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_17">
    检索标签
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_18">
    检索点或边的单个属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_19">
    检索点或边的所有属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_20">
    检索边类型
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_21">
    检索路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_22">
    检索路径中的点
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_23">
    检索路径中的边
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_24">
    检索路径长度
  </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../5.lookup/" title="LOOKUP">
      LOOKUP
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../3.go/" title="GO">
      GO
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../4.fetch/" title="FETCH">
      FETCH
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../7.unwind/" title="UNWIND">
      UNWIND
    </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-6-6" id="nav-3-6-6" type="checkbox"/>
<label class="md-nav__link" for="nav-3-6-6">
      SHOW
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="3">
<label class="md-nav__title" for="nav-3-6-6">
        SHOW
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/1.show-charset/" title="SHOW CHARSET">
      SHOW CHARSET
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/2.show-collation/" title="SHOW COLLATION">
      SHOW COLLATION
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/4.show-create-space/" title="SHOW CREATE SPACE">
      SHOW CREATE SPACE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/5.show-create-tags-edges/" title="SHOW CREATE TAGS/EDGES">
      SHOW CREATE TAGS/EDGES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/6.show-hosts/" title="SHOW HOSTS">
      SHOW HOSTS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/7.show-index-status/" title="SHOW INDEX STATUS">
      SHOW INDEX STATUS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/8.show-indexes/" title="SHOW INDEXES">
      SHOW INDEXES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/9.show-parts/" title="SHOW PARTS">
      SHOW PARTS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/10.show-roles/" title="SHOW ROLES">
      SHOW ROLES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/11.show-snapshots/" title="SHOW SNAPSHOTS">
      SHOW SNAPSHOTS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/12.show-spaces/" title="SHOW SPACES">
      SHOW SPACES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/14.show-stats/" title="SHOW STATS">
      SHOW STATS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/15.show-tags-edges/" title="SHOW TAGS/EDGES">
      SHOW TAGS/EDGES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/16.show-users/" title="SHOW USERS">
      SHOW USERS
    </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-7" id="nav-3-7" type="checkbox"/>
<label class="md-nav__link" for="nav-3-7">
      子句和选项
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-7">
        子句和选项
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/group-by/" title="GROUP BY">
      GROUP BY
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/limit/" title="LIMIT and SKIP">
      LIMIT and SKIP
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/order-by/" title="ORDER BY">
      ORDER BY
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/return/" title="RETURN">
      RETURN
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/ttl-options/" title="TTL">
      TTL
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/where/" title="WHERE">
      WHERE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/yield/" title="YIELD">
      YIELD
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/with/" title="WITH">
      WITH
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-8" id="nav-3-8" type="checkbox"/>
<label class="md-nav__link" for="nav-3-8">
      图空间语句
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-8">
        图空间语句
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/1.create-space/" title="CREATE SPACE">
      CREATE SPACE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/2.use-space/" title="USE SPACE">
      USE SPACE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/3.show-spaces/" title="SHOW SPACES">
      SHOW SPACES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/4.describe-space/" title="DESCRIBE SPACE">
      DESCRIBE SPACE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/5.drop-space/" title="DROP SPACE">
      DROP SPACE
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-9" id="nav-3-9" type="checkbox"/>
<label class="md-nav__link" for="nav-3-9">
      标签语句
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-9">
        标签语句
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/1.create-tag/" title="CREATE TAG">
      CREATE TAG
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/2.drop-tag/" title="DROP TAGS">
      DROP TAGS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/3.alter-tag/" title="ALTER TAG">
      ALTER TAG
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/4.show-tags/" title="SHOW TAGS">
      SHOW TAGS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/5.describe-tag/" title="DESCRIBE TAG">
      DESCRIBE TAG
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-10" id="nav-3-10" type="checkbox"/>
<label class="md-nav__link" for="nav-3-10">
      边类型语句
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-10">
        边类型语句
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/1.create-edge/" title="CREATE EDGE">
      CREATE EDGE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/2.drop-edge/" title="DROP EDGE">
      DROP EDGE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/3.alter-edge/" title="ALTER EDGE">
      ALTER EDGE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/4.show-edges/" title="SHOW EDGES">
      SHOW EDGES
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/5.describe-edge/" title="DESCRIBE EDGE">
      DESCRIBE EDGE
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-11" id="nav-3-11" type="checkbox"/>
<label class="md-nav__link" for="nav-3-11">
      点语句
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-11">
        点语句
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/1.insert-vertex/" title="INSERT VERTEX">
      INSERT VERTEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/4.delete-vertex/" title="DELETE VERTEX">
      DELETE VERTEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/2.update-vertex/" title="UPDATE VERTEX">
      UPDATE VERTEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/3.upsert-vertex/" title="UPSERT VERTEX">
      UPSERT VERTEX
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-12" id="nav-3-12" type="checkbox"/>
<label class="md-nav__link" for="nav-3-12">
      边语句
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-12">
        边语句
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/1.insert-edge/" title="INSERT EDGE">
      INSERT EDGE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/4.delete-edge/" title="DELETE EDGE">
      DELETE EDGE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/2.update-edge/" title="UPDATE EDGE">
      UPDATE EDGE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/3.upsert-edge/" title="UPSERT EDGE">
      UPSERT EDGE
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-13" id="nav-3-13" type="checkbox"/>
<label class="md-nav__link" for="nav-3-13">
      原生索引
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-13">
        原生索引
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/" title="索引介绍">
      索引介绍
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/1.create-native-index/" title="CREATE INDEX">
      CREATE INDEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/2.show-native-indexes/" title="SHOW INDEX">
      SHOW INDEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/2.1.show-create-index/" title="SHOW CREATE INDEX">
      SHOW CREATE INDEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/3.describe-native-index/" title="DESCRIBE INDEX">
      DESCRIBE INDEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/4.rebuild-native-index/" title="REBUILD INDEX">
      REBUILD INDEX
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/5.show-native-index-status/" title="SHOW INDEX STATUS">
      SHOW INDEX STATUS
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/6.drop-native-index/" title="DROP INDEX">
      DROP INDEX
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-14" id="nav-3-14" type="checkbox"/>
<label class="md-nav__link" for="nav-3-14">
      全文索引
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-14">
        全文索引
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/" title="索引介绍">
      索引介绍
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/1.text-based-index-restrictions/" title="全文索引限制">
      全文索引限制
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy-es/" title="部署全文索引">
      部署全文索引
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/3.deploy-listener/" title="部署Raft listener">
      部署Raft listener
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../15.full-text-index-statements/1.search-with-text-based-index/" title="全文搜索">
      全文搜索
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-15" id="nav-3-15" type="checkbox"/>
<label class="md-nav__link" for="nav-3-15">
      子图和路径
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-15">
        子图和路径
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../16.subgraph-and-path/1.get-subgraph/" title="GET SUBGRAPH">
      GET SUBGRAPH
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../16.subgraph-and-path/2.find-path/" title="FIND PATH">
      FIND PATH
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-16" id="nav-3-16" type="checkbox"/>
<label class="md-nav__link" for="nav-3-16">
      查询调优
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-16">
        查询调优
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../17.query-tuning-statements/1.explain-and-profile/" title="EXPLAIN和PROFILE">
      EXPLAIN和PROFILE
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-17" id="nav-3-17" type="checkbox"/>
<label class="md-nav__link" for="nav-3-17">
      运维
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-17">
        运维
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../18.operation-and-maintenance-statements/2.balance-syntax/" title="BALANCE">
      BALANCE
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../18.operation-and-maintenance-statements/4.job-statements/" title="作业管理">
      作业管理
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-18" id="nav-3-18" type="checkbox"/>
<label class="md-nav__link" for="nav-3-18">
      附录
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-3-18">
        附录
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../20.appendix/comments/" title="注释">
      注释
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../20.appendix/identifier-case-sensitivity/" title="大小写区分">
      大小写区分
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../20.appendix/keywords-and-reserved-words/" title="关键字">
      关键字
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../20.appendix/vid-partition/" title="点ID和分片ID">
      点ID和分片ID
    </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-4" id="nav-4" type="checkbox"/>
<label class="md-nav__link" for="nav-4">
      安装部署
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-4">
        安装部署
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/1.resource-preparations/" title="准备资源">
      准备资源
    </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-2" id="nav-4-2" type="checkbox"/>
<label class="md-nav__link" for="nav-4-2">
      编译安装Nebula Graph
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-4-2">
        编译安装Nebula Graph
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/1.install-nebula-graph-by-compiling-the-source-code/" title="源码编译安装">
      源码编译安装
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/2.install-nebula-graph-by-rpm-or-deb/" title="RPM/DEB包安装">
      RPM/DEB包安装
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/deploy-nebula-graph-cluster/" title="部署Nebula Graph集群">
      部署Nebula Graph集群
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/3.upgrade-nebula-graph/" title="升级Nebula Graph">
      升级Nebula Graph
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-5" id="nav-5" type="checkbox"/>
<label class="md-nav__link" for="nav-5">
      配置和日志
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-5">
        配置和日志
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-1" id="nav-5-1" type="checkbox"/>
<label class="md-nav__link" for="nav-5-1">
      配置
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-5-1">
        配置
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/1.configurations/" title="配置简介">
      配置简介
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/2.meta-config/" title="Meta服务配置">
      Meta服务配置
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/3.graph-config/" title="Graph服务配置">
      Graph服务配置
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/4.storage-config/" title="Storage服务配置">
      Storage服务配置
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/6.kernel-config/" title="内核配置">
      内核配置
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-2" id="nav-5-2" type="checkbox"/>
<label class="md-nav__link" for="nav-5-2">
      日志
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-5-2">
        日志
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/2.log-management/logs/" title="日志配置">
      日志配置
    </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-6" id="nav-6" type="checkbox"/>
<label class="md-nav__link" for="nav-6">
      监控
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-6">
        监控
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../6.monitor-and-metrics/1.query-performance-metrics/" title="查询Nebula Graph监控指标">
      查询Nebula Graph监控指标
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-7" id="nav-7" type="checkbox"/>
<label class="md-nav__link" for="nav-7">
      数据安全
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-7">
        数据安全
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-7-1" id="nav-7-1" type="checkbox"/>
<label class="md-nav__link" for="nav-7-1">
      验证和授权
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-7-1">
        验证和授权
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/1.authentication/" title="身份验证">
      身份验证
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/2.management-user/" title="用户管理">
      用户管理
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/3.role-list/" title="内置角色权限">
      内置角色权限
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-7-2" id="nav-7-2" type="checkbox"/>
<label class="md-nav__link" for="nav-7-2">
      备份恢复
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="2">
<label class="md-nav__title" for="nav-7-2">
        备份恢复
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/2.backup-restore/1.what-is-br/" title="什么是BR">
      什么是BR
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/2.backup-restore/2.compile-br/" title="编译BR">
      编译BR
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/2.backup-restore/3.br-backup-data/" title="使用BR备份数据">
      使用BR备份数据
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/2.backup-restore/4.br-restore-data/" title="使用BR恢复数据">
      使用BR恢复数据
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/3.manage-snapshot/" title="管理快照">
      管理快照
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-8" id="nav-8" type="checkbox"/>
<label class="md-nav__link" for="nav-8">
      调整服务
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-8">
        调整服务
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/compaction/" title="Compaction">
      Compaction
    </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/load-balance/" title="Storage负载均衡">
      Storage负载均衡
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-9" id="nav-9" type="checkbox"/>
<label class="md-nav__link" for="nav-9">
      社区贡献
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-9">
        社区贡献
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../15.contribution/how-to-contribute/" title="如何贡献">
      如何贡献
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-10" id="nav-10" type="checkbox"/>
<label class="md-nav__link" for="nav-10">
      English
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-10">
        English
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="https://docs.nebula-graph.io/" title="None">
      None
    </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-toggle md-nav__toggle" data-md-toggle="nav-11" id="nav-11" type="checkbox"/>
<label class="md-nav__link" for="nav-11">
      PDF
    </label>
<nav class="md-nav" data-md-component="collapsible" data-md-level="1">
<label class="md-nav__title" for="nav-11">
        PDF
      </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../pdf/NebulaGraph-zh.pdf" title="下载PDF">
      下载PDF
    </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</div>
</div>
</div>
<div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
<div class="md-sidebar__scrollwrap">
<div class="md-sidebar__inner">
<nav class="md-nav md-nav--secondary">
<label class="md-nav__title" for="__toc">目录</label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="#_1">
    语法
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#match_1">
    MATCH工作流程
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#opencypher">
    openCypher兼容性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#pattern">
    使用模式（pattern）
  </a>
<nav class="md-nav">
<ul class="md-nav__list">
<li class="md-nav__item">
<a class="md-nav__link" href="#_2">
    前提条件
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_3">
    匹配点
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_4">
    匹配标签
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_5">
    匹配点的属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#id">
    匹配点ID
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_6">
    匹配连接的点
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_7">
    匹配路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_8">
    匹配边
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_9">
    匹配边类型和属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_10">
    匹配多个边类型
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_11">
    匹配多条边
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_12">
    匹配定长路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_13">
    匹配变长路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_14">
    匹配多个边类型的变长路径
  </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_15">
    常用检索操作
  </a>
<nav class="md-nav">
<ul class="md-nav__list">
<li class="md-nav__item">
<a class="md-nav__link" href="#_16">
    检索点或边的信息
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#id_1">
    检索点ID
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_17">
    检索标签
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_18">
    检索点或边的单个属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_19">
    检索点或边的所有属性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_20">
    检索边类型
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_21">
    检索路径
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_22">
    检索路径中的点
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_23">
    检索路径中的边
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_24">
    检索路径长度
  </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</div>
</div>
</div>
<div class="md-content">
<article class="md-content__inner md-typeset">
<h1 id="match">MATCH<a class="headerlink" href="#match" title="Permanent link">¶</a></h1>
<p><code>MATCH</code>语句提供基于模式（pattern）匹配的搜索功能。</p>
<p>一个<code>MATCH</code>语句定义了一个<a href="../../1.nGQL-overview/3.graph-patterns/">搜索模式</a>，用该模式匹配存储在Nebula Graph中的数据，然后用<code>RETURN</code>子句检索数据。</p>
<p>本文示例使用测试数据库<code>nba</code>进行演示。</p>
<h2 id="_1">语法<a class="headerlink" href="#_1" title="Permanent link">¶</a></h2>
<p>与<code>GO</code>或<code>LOOKUP</code>等其他查询语句相比，<code>MATCH</code>的语法更灵活。<code>MATCH</code>语法可以概括如下：</p>
<div class="highlight"><pre><span></span><code>MATCH &lt;pattern&gt; [&lt;WHERE clause&gt;] RETURN &lt;output&gt;
</code></pre></div>
<h2 id="match_1">MATCH工作流程<a class="headerlink" href="#match_1" title="Permanent link">¶</a></h2>
<ol>
<li>
<p><code>MATCH</code>语句使用原生索引查找起始点，起始点可以在模式的任何位置。即一个有效的<code>MATCH</code>语句，<strong>必须有一个属性、标签或者点已经创建索引</strong>。如何创建索引，请参见<a href="../../14.native-index-statements/1.create-native-index/">创建原生索引</a>。</p>
</li>
<li>
<p><code>MATCH</code>语句在模式中搜索，寻找匹配的边或点。</p>
</li>
<li>
<p><code>MATCH</code>语句根据<code>RETURN</code>子句检索数据。</p>
</li>
</ol>
<h2 id="opencypher">openCypher兼容性<a class="headerlink" href="#opencypher" title="Permanent link">¶</a></h2>
<p>nGQL暂不支持遍历所有点和边，例如<code>MATCH (v) RETURN v</code>。</p>
<h2 id="pattern">使用模式（pattern）<a class="headerlink" href="#pattern" title="Permanent link">¶</a></h2>
<h3 id="_2">前提条件<a class="headerlink" href="#_2" title="Permanent link">¶</a></h3>
<p>请确保<code>MATCH</code>语句有至少一个索引可用。如果您需要创建索引，但是已经有相关的点、边或属性，您必须在创建索引后重建索引，索引才能生效。</p>
<blockquote>
<p><strong>警告</strong>：正确使用索引可以加快查询速度，但是索引会导致写性能大幅降低（降低90%甚至更多）。请<strong>不要随意</strong>在生产环境中使用索引，除非您很清楚使用索引对业务的影响。</p>
</blockquote>
<div class="highlight"><pre><span></span><code># 在属性name上创建索引。
nebula&gt; CREATE TAG INDEX name ON player(name(20)); 

# 重建索引使其生效。
nebula&gt; REBUILD TAG INDEX name; 
+------------+
| New Job Id |
+------------+
| 121        |
+------------+

# 确认重建索引成功。
nebula&gt; SHOW JOB 121; 
+----------------+---------------------+------------+------------+------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time | Stop Time  |
+----------------+---------------------+------------+------------+------------+
| 121            | "REBUILD_TAG_INDEX" | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 0              | "storaged2"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 1              | "storaged0"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 2              | "storaged1"         | "FINISHED" | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
</code></pre></div>
<h3 id="_3">匹配点<a class="headerlink" href="#_3" title="Permanent link">¶</a></h3>
<p>您可以在一对括号中使用自定义变量来表示模式中的点。例如<code>(v)</code>。</p>
<h3 id="_4">匹配标签<a class="headerlink" href="#_4" title="Permanent link">¶</a></h3>
<blockquote>
<p><strong>说明</strong>：标签的索引和属性的索引不同。如果标签的某个属性有索引，但是标签本身没有索引，您无法基于该标签执行<code>MATCH</code>语句。</p>
</blockquote>
<p>您可以在点的右侧用<code>:&lt;tag_name&gt;</code>表示模式中的标签。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) RETURN v;
+---------------------------------------------------------------+
| v                                                             |
+---------------------------------------------------------------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"})     |
+---------------------------------------------------------------+
| ("player106" :player{age: 25, name: "Kyle Anderson"})         |
+---------------------------------------------------------------+
| ("player115" :player{age: 40, name: "Kobe Bryant"})           |
+---------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_5">匹配点的属性<a class="headerlink" href="#_5" title="Permanent link">¶</a></h3>
<p>您可以在标签的右侧用<code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code>表示模式中点的属性。</p>
<div class="highlight"><pre><span></span><code># 使用属性name搜索匹配的点。
nebula&gt; MATCH (v:player{name:"Tim Duncan"}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<p>使用<code>WHERE</code>子句也可以实现相同的操作：</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) WHERE v.name == "Tim Duncan" RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>openCypher兼容性</strong>：在openCypher 9中，<code>=</code>是相等运算符，在nGQL中，<code>==</code>是相等运算符，<code>=</code>是赋值运算符。</p>
</blockquote>
<h3 id="id">匹配点ID<a class="headerlink" href="#id" title="Permanent link">¶</a></h3>
<p>您可以使用点ID去匹配点。<code>id()</code>函数可以检索点的ID。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) WHERE id(v) == 'player101' RETURN v;
+---------------------------------------------------+
| v                                                 |
+---------------------------------------------------+
| (player101) player.name:Tony Parker,player.age:36 |
+---------------------------------------------------+
</code></pre></div>
<p>要匹配多个点的ID，可以用<code>WHERE id(v) IN [vid_list]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player { name: 'Tim Duncan' })--(v2) \
        WHERE id(v2) IN ["player101", "player102"] RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player101" :player{name: "Tony Parker", age: 36})       |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="_6">匹配连接的点<a class="headerlink" href="#_6" title="Permanent link">¶</a></h3>
<p>您可以使用<code>--</code>符号表示两个方向的边，并匹配这些边连接的点。</p>
<blockquote>
<p><strong>说明</strong>：在nGQL 1.x中，<code>--</code>符号用于行内注释，在nGQL 2.x中，<code>--</code>符号表示出边或入边。</p>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--(v2) \
        RETURN v2.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
| "Marco Belinelli"   |
+---------------------+
| "Danny Green"       |
+---------------------+
| "Aron Baynes"       |
+---------------------+
...
</code></pre></div>
<p>您可以在<code>--</code>符号上增加<code>&lt;</code>或<code>&gt;</code>符号指定边的方向。</p>
<div class="highlight"><pre><span></span><code># --&gt;表示边从v开始，指向v2。对于点v来说是出边，对于点v2来说是入边。
nebula&gt; MATCH (v:player{name:"Tim Duncan"})--&gt;(v2) \
        RETURN v2.name AS Name;
+-----------------+
| Name            |
+-----------------+
| "Spurs"         |
+-----------------+
| "Tony Parker"   |
+-----------------+
| "Manu Ginobili" |
+-----------------+
</code></pre></div>
<p>如果需要扩展模式，可以增加更多点和边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--&gt;(v2)&lt;--(v3) \
        RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "Tiago Splitter"    |
+---------------------+
| "Dejounte Murray"   |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
...
</code></pre></div>
<p>如果您不需要引用点，可以省略括号中表示点的变量。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})--&gt;()&lt;--(v3) \
        RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| "Tony Parker"       |
+---------------------+
| "LaMarcus Aldridge" |
+---------------------+
| "Rudy Gay"          |
+---------------------+
| "Danny Green"       |
+---------------------+
| "Kyle Anderson"     |
+---------------------+
...
</code></pre></div>
<h3 id="_7">匹配路径<a class="headerlink" href="#_7" title="Permanent link">¶</a></h3>
<p>连接起来的点和边构成了路径。您可以使用自定义变量命名路径。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})--&gt;(v2) \
        RETURN p;
+-------------------------------------------+
| p                                         |
+-------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})&gt;   |
+-------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player125" :player{age: 41, name: "Manu Ginobili"})&gt; |
+-------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;("team204" :team{name: "Spurs"})&gt; |
+-------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>openCypher兼容性</strong>：在nGQL中，<code>@</code>符号表示边的rank，在openCypher中，没有rank概念。</p>
</blockquote>
<h3 id="_8">匹配边<a class="headerlink" href="#_8" title="Permanent link">¶</a></h3>
<p>除了用<code>--</code>、<code>--&gt;</code>、<code>&lt;--</code>表示未命名的边之外，您还可以在方括号中使用自定义变量命名边。例如<code>-[e]-</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e]-(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow "player101"-&gt;"player100" @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow "player102"-&gt;"player100" @0 {degree: 75}]                        |
+---------------------------------------------------------------------------+
| [:serve "player100"-&gt;"team204" @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_9">匹配边类型和属性<a class="headerlink" href="#_9" title="Permanent link">¶</a></h3>
<p>和点一样，您可以用<code>:&lt;edge_type&gt;</code>表示模式中的边类型。例如<code>-[e:serve]-</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e:serve]-(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:serve "player100"-&gt;"team204" @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<p>您可以用<code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code>表示模式中边类型的属性。例如<code>[e:follow{likeness:95}]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e:follow{degree:95}]-&gt;(v2) \
        RETURN e;
+--------------------------------------------------------+
| e                                                      |
+--------------------------------------------------------+
| [:follow "player100"-&gt;"player101" @0 {degree: 95}]     |
+--------------------------------------------------------+
| [:follow "player100"-&gt;"player125" @0 {degree: 95}]     |
+--------------------------------------------------------+
</code></pre></div>
<h3 id="_10">匹配多个边类型<a class="headerlink" href="#_10" title="Permanent link">¶</a></h3>
<p>使用<code>|</code>可以匹配多个边类型。例如<code>[e:follow|:serve]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e:follow|:serve]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow "player100"-&gt;"player101" @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow "player100"-&gt;"player125" @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:serve "player100"-&gt;"team204" @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_11">匹配多条边<a class="headerlink" href="#_11" title="Permanent link">¶</a></h3>
<p>您可以扩展模式，匹配路径中的多条边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[]-&gt;(v2)&lt;-[e:serve]-(v3) \
        RETURN v2, v3;
+------------------------------------+-----------------------------------------------------------+
| v2                                 | v3                                                        |
+------------------------------------+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"}) | ("player101" :player{name: "Tony Parker", age: 36})       |
+------------------------------------+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"}) | ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+------------------------------------+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"}) | ("player103" :player{age: 32, name: "Rudy Gay"})          |
+------------------------------------+-----------------------------------------------------------+
...
</code></pre></div>
<h3 id="_12">匹配定长路径<a class="headerlink" href="#_12" title="Permanent link">¶</a></h3>
<p>您可以在模式中使用<code>:&lt;edge_type&gt;*&lt;hop&gt;</code>匹配定长路径。<code>hop</code>必须是一个非负整数。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*2]-&gt;(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
</code></pre></div>
<p>如果<code>hop</code>为0，模式会匹配路径上的起始点。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) -[*0]-&gt; (v2) \
        RETURN v2;
+----------------------------------------------------+
| v2                                                 |
+----------------------------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"}) |
+----------------------------------------------------+
</code></pre></div>
<h3 id="_13">匹配变长路径<a class="headerlink" href="#_13" title="Permanent link">¶</a></h3>
<p>您可以在模式中使用<code>:&lt;edge_type&gt;*[minHop]..&lt;maxHop&gt;</code>匹配变长路径。</p>
<table>
<thead>
<tr>
<th align="left">参数</th>
<th align="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td align="left"><code>minHop</code></td>
<td align="left">可选项。表示路径的最小长度。<code>minHop</code>必须是一个非负整数，默认值为1。</td>
</tr>
<tr>
<td align="left"><code>maxHop</code></td>
<td align="left">必选项。表示路径的最大长度。<code>maxHop</code>必须是一个非负整数，没有默认值。</td>
</tr>
</tbody>
</table>
<blockquote>
<p><strong>openCypher兼容性</strong>：在openCypher中，<code>maxHop</code>是可选项，默认为无穷大。当没有设置时，<code>..</code>可以省略。在nGQL中，<code>maxHop</code>是必选项，而且<code>..</code>不可以省略。</p>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*1..3]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"})        |
+-----------------------------------------------------------+
| ("player101" :player{age: 36, name: "Tony Parker"})       |
+-----------------------------------------------------------+
| ("player125" :player{age: 41, name: "Manu Ginobili"})     |
+-----------------------------------------------------------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) |
+-----------------------------------------------------------+
</code></pre></div>
<p>您可以使用<code>DISTINCT</code>关键字聚合重复结果。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*1..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | COUNT(v2) |
+-----------------------------------------------------------+-----------+
| ("player125" :player{age: 41, name: "Manu Ginobili"})     | 3         |
+-----------------------------------------------------------+-----------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) | 1         |
+-----------------------------------------------------------+-----------+
| ("player100" :player{age: 42, name: "Tim Duncan"})        | 4         |
+-----------------------------------------------------------+-----------+
| ("player101" :player{age: 36, name: "Tony Parker"})       | 3         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<p>如果<code>minHop</code>为<code>0</code>，模式会匹配路径上的起始点。与上个示例相比，下面的示例设置<code>minHop</code>为<code>0</code>，因为它是起始点，所以结果集中<code>"Tim Duncan"</code>比上个示例多计算一次。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*0..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | COUNT(v2) |
+-----------------------------------------------------------+-----------+
| ("player125" :player{age: 41, name: "Manu Ginobili"})     | 3         |
+-----------------------------------------------------------+-----------+
| ("player101" :player{age: 36, name: "Tony Parker"})       | 3         |
+-----------------------------------------------------------+-----------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) | 1         |
+-----------------------------------------------------------+-----------+
| ("player100" :player{age: 42, name: "Tim Duncan"})        | 5         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<h3 id="_14">匹配多个边类型的变长路径<a class="headerlink" href="#_14" title="Permanent link">¶</a></h3>
<p>您可以在变长或定长模式中指定多个边类型。<code>hop</code>、<code>minHop</code>和<code>maxHop</code>对所有边类型都生效。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow|serve*2]-&gt;(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42})        |
+-----------------------------------------------------------+
| ("player102" :player{name: "LaMarcus Aldridge", age: 33}) |
+-----------------------------------------------------------+
| ("player125" :player{name: "Manu Ginobili", age: 41})     |
+-----------------------------------------------------------+
| ("player204" :team{name: "Spurs"})                        |
+-----------------------------------------------------------+
| ("player215" :team{name: "Hornets"})                      |
+-----------------------------------------------------------+
</code></pre></div>
<h2 id="_15">常用检索操作<a class="headerlink" href="#_15" title="Permanent link">¶</a></h2>
<h3 id="_16">检索点或边的信息<a class="headerlink" href="#_16" title="Permanent link">¶</a></h3>
<p>使用<code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}</code>检索点或边的所有信息。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| ("player100" :player{name: "Tim Duncan", age: 42}) |
+----------------------------------------------------+

nebula&gt; MATCH (v:player{name:"Tim Duncan"})-[e]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow "player100"-&gt;"player101" @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow "player100"-&gt;"player125" @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:serve "player100"-&gt;"team204" @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="id_1">检索点ID<a class="headerlink" href="#id_1" title="Permanent link">¶</a></h3>
<p>使用<code>id()</code>函数检索点ID。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN id(v);
+-------------+
| id(v)       |
+-------------+
| "player100" |
+-------------+
</code></pre></div>
<h3 id="_17">检索标签<a class="headerlink" href="#_17" title="Permanent link">¶</a></h3>
<p>使用<code>labels()</code>函数检索点上的标签列表。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN labels(v);
+------------+
| labels(v)  |
+------------+
| ["player"] |
+------------+
</code></pre></div>
<p>检索列表<code>labels(v)</code>中的第N个元素，可以使用<code>labels(v)[n-1]</code>。例如下面示例使用<code>labels(v)[0]</code>检索第一个元素。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN labels(v)[0];
+--------------+
| labels(v)[0] |
+--------------+
| "player"     |
+--------------+
</code></pre></div>
<h3 id="_18">检索点或边的单个属性<a class="headerlink" href="#_18" title="Permanent link">¶</a></h3>
<p>使用<code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}.&lt;property&gt;</code>检索单个属性。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN v.age;
+-------+
| v.age |
+-------+
| 42    |
+-------+
</code></pre></div>
<p>使用<code>AS</code>设置属性的别名。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:"Tim Duncan"}) \
        RETURN v.age AS Age;
+-----+
| Age |
+-----+
| 42  |
+-----+
</code></pre></div>
<h3 id="_19">检索点或边的所有属性<a class="headerlink" href="#_19" title="Permanent link">¶</a></h3>
<p>使用<code>properties()</code>函数检索点或边的所有属性。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[]-&gt;(v2) \
        RETURN properties(v2);
+------------------------------------+
| properties(v2)                     |
+------------------------------------+
| {"name":"Spurs"}                   |
+------------------------------------+
| {"name":"Tony Parker", "age":36}   |
+------------------------------------+
| {"age":41, "name":"Manu Ginobili"} |
+------------------------------------+
</code></pre></div>
<h3 id="_20">检索边类型<a class="headerlink" href="#_20" title="Permanent link">¶</a></h3>
<p>使用<code>type()</code>函数检索匹配的边类型。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e]-&gt;() \
        RETURN DISTINCT type(e);
+----------+
| type(e)  |
+----------+
| "follow" |
+----------+
| "serve"  |
+----------+
</code></pre></div>
<h3 id="_21">检索路径<a class="headerlink" href="#_21" title="Permanent link">¶</a></h3>
<p>使用<code>RETURN &lt;path_name&gt;</code>检索匹配路径的所有信息。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[*3]-&gt;() \
        RETURN p;
+-------------------------------------------------------------------------------------------------+
| p                                                                                               |
+-------------------------------------------------------------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:follow@0 {degree: 90}]-&gt;("player102" :player{age: 33, name: "LaMarcus Aldridge"})-[:serve@0 {end_year: 2019, start_year: 2015}]-&gt;("team204" :team{name: "Spurs"})&gt;           |
+-------------------------------------------------------------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:follow@0 {degree: 90}]-&gt;("player102" :player{age: 33, name: "LaMarcus Aldridge"})-[:serve@0 {end_year: 2015, start_year: 2006}]-&gt;("team203" :team{name: "Trail Blazers"})&gt;   |
+-------------------------------------------------------------------------------------------------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:follow@0 {degree: 90}]-&gt;("player102" :player{age: 33, name: "LaMarcus Aldridge"})-[:follow@0 {degree: 75}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})&gt;             |
+-------------------------------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_22">检索路径中的点<a class="headerlink" href="#_22" title="Permanent link">¶</a></h3>
<p>使用<code>nodes()</code>函数检索路径中的所有点。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[]-&gt;(v2) \
        RETURN nodes(p);
+---------------------------------------------------------------------------------------------------------------------+
| nodes(p)                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------+
| [("player100" :star{} :player{age: 42, name: "Tim Duncan"}), ("player204" :team{name: "Spurs"})]                    |
+---------------------------------------------------------------------------------------------------------------------+
| [("player100" :star{} :player{age: 42, name: "Tim Duncan"}), ("player101" :player{name: "Tony Parker", age: 36})]   |
+---------------------------------------------------------------------------------------------------------------------+
| [("player100" :star{} :player{age: 42, name: "Tim Duncan"}), ("player125" :player{name: "Manu Ginobili", age: 41})] |
+---------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_23">检索路径中的边<a class="headerlink" href="#_23" title="Permanent link">¶</a></h3>
<p>使用<code>relationships()</code>函数检索路径中的所有边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[]-&gt;(v2) \
        RETURN relationships(p);
+-----------------------------------------------------------------------------+
| relationships(p)                                                            |
+-----------------------------------------------------------------------------+
| [[:follow "player100"-&gt;"player101" @0 {degree: 95}]]                        |
+-----------------------------------------------------------------------------+
| [[:follow "player100"-&gt;"player125" @0 {degree: 95}]]                        |
+-----------------------------------------------------------------------------+
| [[:serve "player100"-&gt;"team204" @0 {end_year: 2016, start_year: 1997}]]     |
+-----------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_24">检索路径长度<a class="headerlink" href="#_24" title="Permanent link">¶</a></h3>
<p>使用<code>length()</code>函数检索路径的长度。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[*..2]-&gt;(v2) \
        RETURN p AS Paths, length(p) AS Length;
+----------------------------------------------------------------------+--------+
| Paths                                                                | Length |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player125" :player{age: 41, name: "Manu Ginobili"})-[:serve@0 {end_year: 2018, start_year: 2002}]-&gt;("team204" :team{name: "Spurs"})&gt;   | 2      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player125" :player{age: 41, name: "Manu Ginobili"})-[:follow@0 {degree: 90}]-&gt;("player100" :player{age: 42, name: "Tim Duncan"})&gt;      | 2      |
+----------------------------------------------------------------------+--------+
|  &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:serve@0 {end_year: 2019, start_year: 2018}]-&gt;("team215" :team{name: "Hornets"})&gt;  | 2      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:serve@0 {end_year: 2018, start_year: 1999}]-&gt;("team204" :team{name: "Spurs"})&gt;     | 2      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:follow@0 {degree: 95}]-&gt;("player125" :player{age: 41, name: "Manu Ginobili"})&gt;     | 2      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:follow@0 {degree: 90}]-&gt;("player102" :player{age: 33, name: "LaMarcus Aldridge"})&gt; | 2      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player101" :player{age: 36, name: "Tony Parker"})-[:follow@0 {degree: 95}]-&gt;("player100" :player{age: 42, name: "Tim Duncan"})&gt;        | 2      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;("team204" :team{name: "Spurs"})&gt;                                                                                   | 1      |
+----------------------------------------------------------------------+--------+
| &lt;("player100" :player{age: 42, name: "Tim Duncan"})-[:follow@0 {degree: 95}]-&gt;("player125" :player{age: 41, name: "Manu Ginobili"})&gt;                                                                                   | 1      |
+----------------------------------------------------------------------+--------+
</code></pre></div>
</article>
</div>
</div>
</main>
<footer class="md-footer">
<div class="md-footer-nav">
<nav class="md-footer-nav__inner md-grid">
<a class="md-flex md-footer-nav__link md-footer-nav__link--prev" href="../../6.functions-and-expressions/9.user-defined-functions/" rel="prev" title="自定义函数">
<div class="md-flex__cell md-flex__cell--shrink">
<i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
</div>
<div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
<span class="md-flex__ellipsis">
<span class="md-footer-nav__direction">
                  上一页
                </span>
                自定义函数
              </span>
</div>
</a>
<a class="md-flex md-footer-nav__link md-footer-nav__link--next" href="../5.lookup/" rel="next" title="LOOKUP">
<div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
<span class="md-flex__ellipsis">
<span class="md-footer-nav__direction">
                  下一页
                </span>
                LOOKUP
              </span>
</div>
<div class="md-flex__cell md-flex__cell--shrink">
<i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
</div>
</a>
</nav>
</div>
<div class="md-footer-meta md-typeset">
<div class="md-footer-meta__inner md-grid">
<div class="md-footer-copyright">
<div class="md-footer-copyright__highlight">
            Copyright © 2020 Nebula Graph - 浙ICP备20010487号
          </div>
        
        powered by
        <a href="https://www.mkdocs.org" rel="noopener" target="_blank">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/" rel="noopener" target="_blank">
          Material for MkDocs</a>
 ... <a class="link--pdf-download" download href="../../../pdf/NebulaGraph-zh.pdf" title="PDF">download PDF</a></div>
<div class="md-footer-social">
<link href="../../../assets/fonts/font-awesome.css" rel="stylesheet"/>
<a class="md-footer-social__link fa fa-github" href="https://github.com/vesoft-inc/nebula" rel="noopener" target="_blank" title="github"></a>
<a class="md-footer-social__link fa fa-weibo" href="https://www.weibo.com/u/7122684542?is_hot=1" rel="noopener" target="_blank" title="weibo"></a>
<a class="md-footer-social__link fa fa-twitter" href="https://twitter.com/NebulaGraph" rel="noopener" target="_blank" title="twitter"></a>
<a class="md-footer-social__link fa fa-linkedin" href="https://www.linkedin.com/company/vesoft-nebula-graph/" rel="noopener" target="_blank" title="linkedin"></a>
<a class="md-footer-social__link fa fa-facebook" href="https://www.facebook.com/NebulaGraph/" rel="noopener" target="_blank" title="facebook"></a>
<a class="md-footer-social__link fa fa-slack" href="https://app.slack.com/client/TJB3N2BPD/CJNFUM7AR" rel="noopener" target="_blank" title="slack"></a>
</div>
</div>
</div>
</footer>
</div>
<script src="../../../assets/javascripts/application.c33a9706.js"></script>
<script src="../../../assets/javascripts/lunr/lunr.stemmer.support.js"></script>
<script src="../../../assets/javascripts/lunr/tinyseg.js"></script>
<script src="../../../assets/javascripts/lunr/lunr.ja.js"></script>
<script>app.initialize({version:"1.1.2",url:{base:"../../.."}})</script>
<script src="../../../js/version-select.js"></script>
</body>
</html>