
<!doctype html>
<html lang="zh" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
        <meta name="description" content="Documentation for Nebula Graph Database">
      
      
      
        <meta name="author" content="Nebula Graph">
      
      
        <link rel="canonical" href="https://docs.nebula-graph.com.cn/2.0/3.ngql-guide/7.general-query-statements/2.match/">
      
      <link rel="icon" href="../../../assets/images/favicon.ico">
      <meta name="generator" content="mkdocs-1.1.2, mkdocs-material-7.1.6">
    
    
      
        <title>Match - Nebula Graph Database 内核手册</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/main.875de78c.min.css">
      
        
        <link rel="stylesheet" href="../../../assets/stylesheets/palette.f1a3b89f.min.css">
        
          
          
          <meta name="theme-color" content="#4051b5">
        
      
    
    
    
      
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&display=fallback">
        <style>:root{--md-text-font-family:"Roboto";--md-code-font-family:"Roboto Mono"}</style>
      
    
    
    
      <link rel="stylesheet" href="../../../stylesheets/logo.css">
    
      <link rel="stylesheet" href="../../../css/version-select.css">
    
    
      
        
<script>window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)},ga.l=+new Date,ga("create","UA-60523578-15","auto"),ga("set","anonymizeIp",!0),ga("send","pageview"),document.addEventListener("DOMContentLoaded",function(){document.forms.search&&document.forms.search.query.addEventListener("blur",function(){var e;this.value&&(e=document.location.pathname,ga("send","pageview",e+"?q="+this.value))}),"undefined"!=typeof location$&&location$.subscribe(function(e){ga("send","pageview",e.pathname)})})</script>
<script async src="https://www.google-analytics.com/analytics.js"></script>
      
    
    
  </head>
  
  
    
    
    
    
    
    <body dir="ltr" data-md-color-scheme="" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    
    <script>function __prefix(e){return new URL("../../..",location).pathname+"."+e}function __get(e,t=localStorage){return JSON.parse(t.getItem(__prefix(e)))}</script>
    
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" for="__drawer"></label>
    <div data-md-component="skip">
      
        
        <a href="#match" class="md-skip">
          跳转至
        </a>
      
    </div>
    <div data-md-component="announce">
      
    </div>
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header__inner md-grid" aria-label="Header">
    <a href="../../.." title="Nebula Graph Database 内核手册" class="md-header__button md-logo" aria-label="Nebula Graph Database 内核手册" data-md-component="logo">
      
  <img src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" alt="logo">

    </a>
    <label class="md-header__button md-icon" for="__drawer">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M3 6h18v2H3V6m0 5h18v2H3v-2m0 5h18v2H3v-2z"/></svg>
    </label>
    <div class="md-header__title" data-md-component="header-title">
      <div class="md-header__ellipsis">
        <div class="md-header__topic">
          <span class="md-ellipsis">
            Nebula Graph Database 内核手册
          </span>
        </div>
        <div class="md-header__topic" data-md-component="header-topic">
          <span class="md-ellipsis">
            
              Match
            
          </span>
        </div>
      </div>
    </div>
    
    
    
      <label class="md-header__button md-icon" for="__search">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5z"/></svg>
      </label>
      
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" name="query" aria-label="搜索" placeholder="搜索" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="search-query" data-md-state="active" required>
      <label class="md-search__icon md-icon" for="__search">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M9.5 3A6.5 6.5 0 0 1 16 9.5c0 1.61-.59 3.09-1.56 4.23l.27.27h.79l5 5-1.5 1.5-5-5v-.79l-.27-.27A6.516 6.516 0 0 1 9.5 16 6.5 6.5 0 0 1 3 9.5 6.5 6.5 0 0 1 9.5 3m0 2C7 5 5 7 5 9.5S7 14 9.5 14 14 12 14 9.5 12 5 9.5 5z"/></svg>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12z"/></svg>
      </label>
      <button type="reset" class="md-search__icon md-icon" aria-label="Clear" tabindex="-1">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M19 6.41 17.59 5 12 10.59 6.41 5 5 6.41 10.59 12 5 17.59 6.41 19 12 13.41 17.59 19 19 17.59 13.41 12 19 6.41z"/></svg>
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="search-result">
          <div class="md-search-result__meta">
            正在初始化搜索引擎
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
    
    
      <div class="md-header__source">
        
<a href="https://github.com/vesoft-inc/nebula-docs-cn/" title="前往 GitHub 仓库" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512"><path d="M439.55 236.05 244 40.45a28.87 28.87 0 0 0-40.81 0l-40.66 40.63 51.52 51.52c27.06-9.14 52.68 16.77 43.39 43.68l49.66 49.66c34.23-11.8 61.18 31 35.47 56.69-26.49 26.49-70.21-2.87-56-37.34L240.22 199v121.85c25.3 12.54 22.26 41.85 9.08 55a34.34 34.34 0 0 1-48.55 0c-17.57-17.6-11.07-46.91 11.25-56v-123c-20.8-8.51-24.6-30.74-18.64-45L142.57 101 8.45 235.14a28.86 28.86 0 0 0 0 40.81l195.61 195.6a28.86 28.86 0 0 0 40.8 0l194.69-194.69a28.86 28.86 0 0 0 0-40.81z"/></svg>
  </div>
  <div class="md-source__repository">
    vesoft-inc/nebula-docs-cn
  </div>
</a>
      </div>
    
  </nav>
</header>
    
    <div class="md-container" data-md-component="container">
      
      
        
      
      <main class="md-main" data-md-component="main">
        <div class="md-main__inner md-grid">
          
            
              
              <div class="md-sidebar md-sidebar--primary" data-md-component="sidebar" data-md-type="navigation" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    


<nav class="md-nav md-nav--primary" aria-label="Navigation" data-md-level="0">
  <label class="md-nav__title" for="__drawer">
    <a href="../../.." title="Nebula Graph Database 内核手册" class="md-nav__button md-logo" aria-label="Nebula Graph Database 内核手册" data-md-component="logo">
      
  <img src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" alt="logo">

    </a>
    Nebula Graph Database 内核手册
  </label>
  
    <div class="md-nav__source">
      
<a href="https://github.com/vesoft-inc/nebula-docs-cn/" title="前往 GitHub 仓库" class="md-source" data-md-component="source">
  <div class="md-source__icon md-icon">
    
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 448 512"><path d="M439.55 236.05 244 40.45a28.87 28.87 0 0 0-40.81 0l-40.66 40.63 51.52 51.52c27.06-9.14 52.68 16.77 43.39 43.68l49.66 49.66c34.23-11.8 61.18 31 35.47 56.69-26.49 26.49-70.21-2.87-56-37.34L240.22 199v121.85c25.3 12.54 22.26 41.85 9.08 55a34.34 34.34 0 0 1-48.55 0c-17.57-17.6-11.07-46.91 11.25-56v-123c-20.8-8.51-24.6-30.74-18.64-45L142.57 101 8.45 235.14a28.86 28.86 0 0 0 0 40.81l195.61 195.6a28.86 28.86 0 0 0 40.8 0l194.69-194.69a28.86 28.86 0 0 0 0-40.81z"/></svg>
  </div>
  <div class="md-source__repository">
    vesoft-inc/nebula-docs-cn
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      

  
  
  
    <li class="md-nav__item">
      <a href="../../.." class="md-nav__link">
        前言
      </a>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_2" type="checkbox" id="__nav_2" >
      
      <label class="md-nav__link" for="__nav_2">
        简介
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="简介" data-md-level="1">
        <label class="md-nav__title" for="__nav_2">
          <span class="md-nav__icon md-icon"></span>
          简介
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/1.what-is-nebula-graph/" class="md-nav__link">
        什么是Nebula Graph
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/2.data-model/" class="md-nav__link">
        数据结构
      </a>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_2_3" type="checkbox" id="__nav_2_3" >
      
      <label class="md-nav__link" for="__nav_2_3">
        Nebula Graph架构
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="Nebula Graph架构" data-md-level="2">
        <label class="md-nav__title" for="__nav_2_3">
          <span class="md-nav__icon md-icon"></span>
          Nebula Graph架构
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" class="md-nav__link">
        架构总览
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" class="md-nav__link">
        Meta服务
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/" class="md-nav__link">
        Graph服务
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/" class="md-nav__link">
        Storage服务
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_3" type="checkbox" id="__nav_3" >
      
      <label class="md-nav__link" for="__nav_3">
        快速入门
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="快速入门" data-md-level="1">
        <label class="md-nav__title" for="__nav_3">
          <span class="md-nav__icon md-icon"></span>
          快速入门
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/0.FAQ/" class="md-nav__link">
        FAQ
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/1.quick-start-workflow/" class="md-nav__link">
        快速入门流程
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/2.deploy-nebula-graph-with-docker-compose/" class="md-nav__link">
        Docker Compose部署Nebula Graph
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/5.start-stop-service/" class="md-nav__link">
        管理Nebula Graph服务
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/3.connect-to-nebula-graph/" class="md-nav__link">
        连接Nebula Graph
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/4.nebula-graph-crud/" class="md-nav__link">
        Nebula Graph常用语法（CRUD）
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../2.quick-start/6.eco-tool-version/" class="md-nav__link">
        生态工具概览
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
    
  
  
    
    <li class="md-nav__item md-nav__item--active md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4" type="checkbox" id="__nav_4" checked>
      
      <label class="md-nav__link" for="__nav_4">
        nGQL指南
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="nGQL指南" data-md-level="1">
        <label class="md-nav__title" for="__nav_4">
          <span class="md-nav__icon md-icon"></span>
          nGQL指南
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_1" type="checkbox" id="__nav_4_1" >
      
      <label class="md-nav__link" for="__nav_4_1">
        nGQL概述
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="nGQL概述" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_1">
          <span class="md-nav__icon md-icon"></span>
          nGQL概述
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/1.overview/" class="md-nav__link">
        Nebula Graph查询语言（nGQL）
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/2.graph-modeling/" class="md-nav__link">
        图建模
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../1.nGQL-overview/3.graph-patterns/" class="md-nav__link">
        模式
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_2" type="checkbox" id="__nav_4_2" >
      
      <label class="md-nav__link" for="__nav_4_2">
        数据类型
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="数据类型" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_2">
          <span class="md-nav__icon md-icon"></span>
          数据类型
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/1.numeric/" class="md-nav__link">
        数值
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/2.boolean/" class="md-nav__link">
        布尔
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/3.string/" class="md-nav__link">
        字符串
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/4.date-and-time/" class="md-nav__link">
        日期时间
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/5.null/" class="md-nav__link">
        NULL
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/6.list/" class="md-nav__link">
        列表
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/7.set/" class="md-nav__link">
        集合
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/8.map/" class="md-nav__link">
        映射
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../3.data-types/9.type-conversion/" class="md-nav__link">
        类型转换
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_3" type="checkbox" id="__nav_4_3" >
      
      <label class="md-nav__link" for="__nav_4_3">
        变量和复合查询
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="变量和复合查询" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_3">
          <span class="md-nav__icon md-icon"></span>
          变量和复合查询
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../4.variable-and-composite-queries/1.composite-queries/" class="md-nav__link">
        复合查询
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../4.variable-and-composite-queries/2.user-defined-variables/" class="md-nav__link">
        自定义变量
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../4.variable-and-composite-queries/3.property-reference/" class="md-nav__link">
        引用属性
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_4" type="checkbox" id="__nav_4_4" >
      
      <label class="md-nav__link" for="__nav_4_4">
        运算符
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="运算符" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_4">
          <span class="md-nav__icon md-icon"></span>
          运算符
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/1.comparison/" class="md-nav__link">
        比较符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/2.boolean/" class="md-nav__link">
        布尔符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/4.pipe/" class="md-nav__link">
        管道符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/5.property-reference/" class="md-nav__link">
        属性引用符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/6.set/" class="md-nav__link">
        集合运算符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/7.string/" class="md-nav__link">
        字符串运算符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/8.list/" class="md-nav__link">
        列表运算符
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../5.operators/9.precedence/" class="md-nav__link">
        运算符优先级
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_5" type="checkbox" id="__nav_4_5" >
      
      <label class="md-nav__link" for="__nav_4_5">
        函数和表达式
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="函数和表达式" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_5">
          <span class="md-nav__icon md-icon"></span>
          函数和表达式
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/1.math/" class="md-nav__link">
        数学函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/2.string/" class="md-nav__link">
        字符串函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/3.date-and-time/" class="md-nav__link">
        日期时间函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/4.schema/" class="md-nav__link">
        Schema函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/5.case-expressions/" class="md-nav__link">
        CASE表达式
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/6.list/" class="md-nav__link">
        列表函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/7.count/" class="md-nav__link">
        count函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/10.collect/" class="md-nav__link">
        collect函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/11.reduce/" class="md-nav__link">
        reduce函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/12.hash/" class="md-nav__link">
        hash函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/8.predicate/" class="md-nav__link">
        谓词函数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../6.functions-and-expressions/9.user-defined-functions/" class="md-nav__link">
        自定义函数
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
    
  
  
    
    <li class="md-nav__item md-nav__item--active md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_6" type="checkbox" id="__nav_4_6" checked>
      
      <label class="md-nav__link" for="__nav_4_6">
        通用查询语句
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="通用查询语句" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_6">
          <span class="md-nav__icon md-icon"></span>
          通用查询语句
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
    
  
  
    <li class="md-nav__item md-nav__item--active">
      
      <input class="md-nav__toggle md-toggle" data-md-toggle="toc" type="checkbox" id="__toc">
      
      
        
      
      
        <label class="md-nav__link md-nav__link--active" for="__toc">
          Match
          <span class="md-nav__icon md-icon"></span>
        </label>
      
      <a href="./" class="md-nav__link md-nav__link--active">
        Match
      </a>
      
        
<nav class="md-nav md-nav--secondary" aria-label="目录">
  
  
  
    
  
  
    <label class="md-nav__title" for="__toc">
      <span class="md-nav__icon md-icon"></span>
      目录
    </label>
    <ul class="md-nav__list" data-md-component="toc" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#_1" class="md-nav__link">
    语法
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#match_1" class="md-nav__link">
    MATCH工作流程
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#opencypher" class="md-nav__link">
    openCypher兼容性
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#pattern" class="md-nav__link">
    使用模式（pattern）
  </a>
  
    <nav class="md-nav" aria-label="使用模式（pattern）">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" class="md-nav__link">
    前提条件
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_3" class="md-nav__link">
    匹配点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_4" class="md-nav__link">
    匹配标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_5" class="md-nav__link">
    匹配点的属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id" class="md-nav__link">
    匹配点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_6" class="md-nav__link">
    匹配连接的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_7" class="md-nav__link">
    匹配路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_8" class="md-nav__link">
    匹配边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_9" class="md-nav__link">
    匹配边类型和属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_10" class="md-nav__link">
    匹配多个边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_11" class="md-nav__link">
    匹配多条边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_12" class="md-nav__link">
    匹配定长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_13" class="md-nav__link">
    匹配变长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_14" class="md-nav__link">
    匹配多个边类型的变长路径
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_15" class="md-nav__link">
    常用检索操作
  </a>
  
    <nav class="md-nav" aria-label="常用检索操作">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_16" class="md-nav__link">
    检索点或边的信息
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id_1" class="md-nav__link">
    检索点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_17" class="md-nav__link">
    检索标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_18" class="md-nav__link">
    检索点或边的单个属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_19" class="md-nav__link">
    检索点或边的所有属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_20" class="md-nav__link">
    检索边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_21" class="md-nav__link">
    检索路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_22" class="md-nav__link">
    检索路径中的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_23" class="md-nav__link">
    检索路径中的边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_24" class="md-nav__link">
    检索路径长度
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
    </ul>
  
</nav>
      
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../5.lookup/" class="md-nav__link">
        LOOKUP
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../3.go/" class="md-nav__link">
        GO
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../4.fetch/" class="md-nav__link">
        FETCH
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../7.unwind/" class="md-nav__link">
        UNWIND
      </a>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_6_6" type="checkbox" id="__nav_4_6_6" >
      
      <label class="md-nav__link" for="__nav_4_6_6">
        SHOW
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="SHOW" data-md-level="3">
        <label class="md-nav__title" for="__nav_4_6_6">
          <span class="md-nav__icon md-icon"></span>
          SHOW
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/1.show-charset/" class="md-nav__link">
        SHOW CHARSET
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/2.show-collation/" class="md-nav__link">
        SHOW COLLATION
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/4.show-create-space/" class="md-nav__link">
        SHOW CREATE SPACE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/5.show-create-tags-edges/" class="md-nav__link">
        SHOW CREATE TAGS/EDGES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/6.show-hosts/" class="md-nav__link">
        SHOW HOSTS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/7.show-index-status/" class="md-nav__link">
        SHOW INDEX STATUS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/8.show-indexes/" class="md-nav__link">
        SHOW INDEXES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/9.show-parts/" class="md-nav__link">
        SHOW PARTS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/10.show-roles/" class="md-nav__link">
        SHOW ROLES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/11.show-snapshots/" class="md-nav__link">
        SHOW SNAPSHOTS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/12.show-spaces/" class="md-nav__link">
        SHOW SPACES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/14.show-stats/" class="md-nav__link">
        SHOW STATS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/15.show-tags-edges/" class="md-nav__link">
        SHOW TAGS/EDGES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../6.show/16.show-users/" class="md-nav__link">
        SHOW USERS
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_7" type="checkbox" id="__nav_4_7" >
      
      <label class="md-nav__link" for="__nav_4_7">
        子句和选项
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="子句和选项" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_7">
          <span class="md-nav__icon md-icon"></span>
          子句和选项
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/group-by/" class="md-nav__link">
        GROUP BY
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/limit/" class="md-nav__link">
        LIMIT and SKIP
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/order-by/" class="md-nav__link">
        ORDER BY
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/return/" class="md-nav__link">
        RETURN
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/ttl-options/" class="md-nav__link">
        TTL
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/where/" class="md-nav__link">
        WHERE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/yield/" class="md-nav__link">
        YIELD
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../8.clauses-and-options/with/" class="md-nav__link">
        WITH
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_8" type="checkbox" id="__nav_4_8" >
      
      <label class="md-nav__link" for="__nav_4_8">
        图空间语句
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="图空间语句" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_8">
          <span class="md-nav__icon md-icon"></span>
          图空间语句
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../9.space-statements/1.create-space/" class="md-nav__link">
        CREATE SPACE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../9.space-statements/2.use-space/" class="md-nav__link">
        USE SPACE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../9.space-statements/3.show-spaces/" class="md-nav__link">
        SHOW SPACES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../9.space-statements/4.describe-space/" class="md-nav__link">
        DESCRIBE SPACE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../9.space-statements/5.drop-space/" class="md-nav__link">
        DROP SPACE
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_9" type="checkbox" id="__nav_4_9" >
      
      <label class="md-nav__link" for="__nav_4_9">
        标签语句
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="标签语句" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_9">
          <span class="md-nav__icon md-icon"></span>
          标签语句
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../10.tag-statements/1.create-tag/" class="md-nav__link">
        CREATE TAG
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../10.tag-statements/2.drop-tag/" class="md-nav__link">
        DROP TAGS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../10.tag-statements/3.alter-tag/" class="md-nav__link">
        ALTER TAG
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../10.tag-statements/4.show-tags/" class="md-nav__link">
        SHOW TAGS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../10.tag-statements/5.describe-tag/" class="md-nav__link">
        DESCRIBE TAG
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_10" type="checkbox" id="__nav_4_10" >
      
      <label class="md-nav__link" for="__nav_4_10">
        边类型语句
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="边类型语句" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_10">
          <span class="md-nav__icon md-icon"></span>
          边类型语句
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../11.edge-type-statements/1.create-edge/" class="md-nav__link">
        CREATE EDGE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../11.edge-type-statements/2.drop-edge/" class="md-nav__link">
        DROP EDGE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../11.edge-type-statements/3.alter-edge/" class="md-nav__link">
        ALTER EDGE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../11.edge-type-statements/4.show-edges/" class="md-nav__link">
        SHOW EDGES
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../11.edge-type-statements/5.describe-edge/" class="md-nav__link">
        DESCRIBE EDGE
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_11" type="checkbox" id="__nav_4_11" >
      
      <label class="md-nav__link" for="__nav_4_11">
        点语句
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="点语句" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_11">
          <span class="md-nav__icon md-icon"></span>
          点语句
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../12.vertex-statements/1.insert-vertex/" class="md-nav__link">
        INSERT VERTEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../12.vertex-statements/4.delete-vertex/" class="md-nav__link">
        DELETE VERTEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../12.vertex-statements/2.update-vertex/" class="md-nav__link">
        UPDATE VERTEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../12.vertex-statements/3.upsert-vertex/" class="md-nav__link">
        UPSERT VERTEX
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_12" type="checkbox" id="__nav_4_12" >
      
      <label class="md-nav__link" for="__nav_4_12">
        边语句
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="边语句" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_12">
          <span class="md-nav__icon md-icon"></span>
          边语句
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../13.edge-statements/1.insert-edge/" class="md-nav__link">
        INSERT EDGE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../13.edge-statements/4.delete-edge/" class="md-nav__link">
        DELETE EDGE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../13.edge-statements/2.update-edge/" class="md-nav__link">
        UPDATE EDGE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../13.edge-statements/3.upsert-edge/" class="md-nav__link">
        UPSERT EDGE
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_13" type="checkbox" id="__nav_4_13" >
      
      <label class="md-nav__link" for="__nav_4_13">
        原生索引
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="原生索引" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_13">
          <span class="md-nav__icon md-icon"></span>
          原生索引
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/" class="md-nav__link">
        索引介绍
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/1.create-native-index/" class="md-nav__link">
        CREATE INDEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/2.show-native-indexes/" class="md-nav__link">
        SHOW INDEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/2.1.show-create-index/" class="md-nav__link">
        SHOW CREATE INDEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/3.describe-native-index/" class="md-nav__link">
        DESCRIBE INDEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/4.rebuild-native-index/" class="md-nav__link">
        REBUILD INDEX
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/5.show-native-index-status/" class="md-nav__link">
        SHOW INDEX STATUS
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/6.drop-native-index/" class="md-nav__link">
        DROP INDEX
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_14" type="checkbox" id="__nav_4_14" >
      
      <label class="md-nav__link" for="__nav_4_14">
        全文索引
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="全文索引" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_14">
          <span class="md-nav__icon md-icon"></span>
          全文索引
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../14.native-index-statements/" class="md-nav__link">
        索引介绍
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/1.text-based-index-restrictions/" class="md-nav__link">
        全文索引限制
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy-es/" class="md-nav__link">
        部署全文索引
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/3.deploy-listener/" class="md-nav__link">
        部署Raft listener
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../15.full-text-index-statements/1.search-with-text-based-index/" class="md-nav__link">
        全文搜索
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_15" type="checkbox" id="__nav_4_15" >
      
      <label class="md-nav__link" for="__nav_4_15">
        子图和路径
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="子图和路径" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_15">
          <span class="md-nav__icon md-icon"></span>
          子图和路径
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../16.subgraph-and-path/1.get-subgraph/" class="md-nav__link">
        GET SUBGRAPH
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../16.subgraph-and-path/2.find-path/" class="md-nav__link">
        FIND PATH
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_16" type="checkbox" id="__nav_4_16" >
      
      <label class="md-nav__link" for="__nav_4_16">
        查询调优
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="查询调优" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_16">
          <span class="md-nav__icon md-icon"></span>
          查询调优
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../17.query-tuning-statements/1.explain-and-profile/" class="md-nav__link">
        EXPLAIN和PROFILE
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_17" type="checkbox" id="__nav_4_17" >
      
      <label class="md-nav__link" for="__nav_4_17">
        运维
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="运维" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_17">
          <span class="md-nav__icon md-icon"></span>
          运维
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../18.operation-and-maintenance-statements/2.balance-syntax/" class="md-nav__link">
        BALANCE
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../18.operation-and-maintenance-statements/4.job-statements/" class="md-nav__link">
        作业管理
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4_18" type="checkbox" id="__nav_4_18" >
      
      <label class="md-nav__link" for="__nav_4_18">
        附录
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="附录" data-md-level="2">
        <label class="md-nav__title" for="__nav_4_18">
          <span class="md-nav__icon md-icon"></span>
          附录
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../20.appendix/comments/" class="md-nav__link">
        注释
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../20.appendix/identifier-case-sensitivity/" class="md-nav__link">
        大小写区分
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../20.appendix/keywords-and-reserved-words/" class="md-nav__link">
        关键字
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../20.appendix/vid-partition/" class="md-nav__link">
        点ID和分片ID
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5" type="checkbox" id="__nav_5" >
      
      <label class="md-nav__link" for="__nav_5">
        安装部署
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="安装部署" data-md-level="1">
        <label class="md-nav__title" for="__nav_5">
          <span class="md-nav__icon md-icon"></span>
          安装部署
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/1.resource-preparations/" class="md-nav__link">
        准备资源
      </a>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_2" type="checkbox" id="__nav_5_2" >
      
      <label class="md-nav__link" for="__nav_5_2">
        编译安装Nebula Graph
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="编译安装Nebula Graph" data-md-level="2">
        <label class="md-nav__title" for="__nav_5_2">
          <span class="md-nav__icon md-icon"></span>
          编译安装Nebula Graph
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/1.install-nebula-graph-by-compiling-the-source-code/" class="md-nav__link">
        源码编译安装
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/2.install-nebula-graph-by-rpm-or-deb/" class="md-nav__link">
        RPM/DEB包安装
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/deploy-nebula-graph-cluster/" class="md-nav__link">
        部署Nebula Graph集群
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/3.upgrade-nebula-graph/" class="md-nav__link">
        升级Nebula Graph
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../4.deployment-and-installation/4.uninstall-nebula-graph/" class="md-nav__link">
        卸载Nebula Graph
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6" type="checkbox" id="__nav_6" >
      
      <label class="md-nav__link" for="__nav_6">
        配置和日志
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="配置和日志" data-md-level="1">
        <label class="md-nav__title" for="__nav_6">
          <span class="md-nav__icon md-icon"></span>
          配置和日志
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6_1" type="checkbox" id="__nav_6_1" >
      
      <label class="md-nav__link" for="__nav_6_1">
        配置
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="配置" data-md-level="2">
        <label class="md-nav__title" for="__nav_6_1">
          <span class="md-nav__icon md-icon"></span>
          配置
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../5.configurations-and-logs/1.configurations/1.configurations/" class="md-nav__link">
        配置简介
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../5.configurations-and-logs/1.configurations/2.meta-config/" class="md-nav__link">
        Meta服务配置
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../5.configurations-and-logs/1.configurations/3.graph-config/" class="md-nav__link">
        Graph服务配置
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../5.configurations-and-logs/1.configurations/4.storage-config/" class="md-nav__link">
        Storage服务配置
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../5.configurations-and-logs/1.configurations/6.kernel-config/" class="md-nav__link">
        操作系统内核配置
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6_2" type="checkbox" id="__nav_6_2" >
      
      <label class="md-nav__link" for="__nav_6_2">
        日志
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="日志" data-md-level="2">
        <label class="md-nav__title" for="__nav_6_2">
          <span class="md-nav__icon md-icon"></span>
          日志
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../5.configurations-and-logs/2.log-management/logs/" class="md-nav__link">
        日志配置
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_7" type="checkbox" id="__nav_7" >
      
      <label class="md-nav__link" for="__nav_7">
        监控
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="监控" data-md-level="1">
        <label class="md-nav__title" for="__nav_7">
          <span class="md-nav__icon md-icon"></span>
          监控
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../6.monitor-and-metrics/1.query-performance-metrics/" class="md-nav__link">
        查询Nebula Graph监控指标
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_8" type="checkbox" id="__nav_8" >
      
      <label class="md-nav__link" for="__nav_8">
        数据安全
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="数据安全" data-md-level="1">
        <label class="md-nav__title" for="__nav_8">
          <span class="md-nav__icon md-icon"></span>
          数据安全
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_8_1" type="checkbox" id="__nav_8_1" >
      
      <label class="md-nav__link" for="__nav_8_1">
        验证和授权
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="验证和授权" data-md-level="2">
        <label class="md-nav__title" for="__nav_8_1">
          <span class="md-nav__icon md-icon"></span>
          验证和授权
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../7.data-security/1.authentication/1.authentication/" class="md-nav__link">
        身份验证
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../7.data-security/1.authentication/2.management-user/" class="md-nav__link">
        用户管理
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../7.data-security/1.authentication/3.role-list/" class="md-nav__link">
        内置角色权限
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../7.data-security/3.manage-snapshot/" class="md-nav__link">
        管理快照
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_9" type="checkbox" id="__nav_9" >
      
      <label class="md-nav__link" for="__nav_9">
        调整服务
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="调整服务" data-md-level="1">
        <label class="md-nav__title" for="__nav_9">
          <span class="md-nav__icon md-icon"></span>
          调整服务
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../8.service-tuning/compaction/" class="md-nav__link">
        Compaction
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../8.service-tuning/load-balance/" class="md-nav__link">
        Storage负载均衡
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10" type="checkbox" id="__nav_10" >
      
      <label class="md-nav__link" for="__nav_10">
        Nebula Graph Studio
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="Nebula Graph Studio" data-md-level="1">
        <label class="md-nav__title" for="__nav_10">
          <span class="md-nav__icon md-icon"></span>
          Nebula Graph Studio
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_1" type="checkbox" id="__nav_10_1" >
      
      <label class="md-nav__link" for="__nav_10_1">
        认识 Nebula Graph Studio
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="认识 Nebula Graph Studio" data-md-level="2">
        <label class="md-nav__title" for="__nav_10_1">
          <span class="md-nav__icon md-icon"></span>
          认识 Nebula Graph Studio
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/about-studio/st-ug-what-is-graph-studio/" class="md-nav__link">
        什么是 Nebula Graph Studio
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/about-studio/st-ug-terms/" class="md-nav__link">
        名词解释
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/about-studio/st-ug-limitations/" class="md-nav__link">
        使用限制
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/about-studio/st-ug-check-updates/" class="md-nav__link">
        版本更新
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/about-studio/st-ug-shortcuts/" class="md-nav__link">
        快捷键
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_2" type="checkbox" id="__nav_10_2" >
      
      <label class="md-nav__link" for="__nav_10_2">
        安装与登录
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="安装与登录" data-md-level="2">
        <label class="md-nav__title" for="__nav_10_2">
          <span class="md-nav__icon md-icon"></span>
          安装与登录
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/deploy-connect/st-ug-deploy/" class="md-nav__link">
        部署 Studio
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/deploy-connect/st-ug-connect/" class="md-nav__link">
        连接数据库
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/deploy-connect/st-ug-reset-connection/" class="md-nav__link">
        清除连接
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_3" type="checkbox" id="__nav_10_3" >
      
      <label class="md-nav__link" for="__nav_10_3">
        快速开始
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="快速开始" data-md-level="2">
        <label class="md-nav__title" for="__nav_10_3">
          <span class="md-nav__icon md-icon"></span>
          快速开始
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/quick-start/st-ug-plan-schema/" class="md-nav__link">
        规划 Schema
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/quick-start/st-ug-prepare-csv.md" class="md-nav__link">
        准备 CSV 文件
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/quick-start/st-ug-create-schema/" class="md-nav__link">
        创建 Schema
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/quick-start/st-ug-import-data/" class="md-nav__link">
        导入数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/quick-start/st-ug-explore/" class="md-nav__link">
        查询图数据
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_4" type="checkbox" id="__nav_10_4" >
      
      <label class="md-nav__link" for="__nav_10_4">
        操作指南
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="操作指南" data-md-level="2">
        <label class="md-nav__title" for="__nav_10_4">
          <span class="md-nav__icon md-icon"></span>
          操作指南
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_4_1" type="checkbox" id="__nav_10_4_1" >
      
      <label class="md-nav__link" for="__nav_10_4_1">
        管理 Schema
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="管理 Schema" data-md-level="3">
        <label class="md-nav__title" for="__nav_10_4_1">
          <span class="md-nav__icon md-icon"></span>
          管理 Schema
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/manage-schema/st-ug-crud-space/" class="md-nav__link">
        操作图空间
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/manage-schema/st-ug-crud-tag/" class="md-nav__link">
        操作标签
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/manage-schema/st-ug-crud-edge-type/" class="md-nav__link">
        操作边类型
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/manage-schema/st-ug-crud-index/" class="md-nav__link">
        操作索引
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_4_2" type="checkbox" id="__nav_10_4_2" >
      
      <label class="md-nav__link" for="__nav_10_4_2">
        使用控制台
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="使用控制台" data-md-level="3">
        <label class="md-nav__title" for="__nav_10_4_2">
          <span class="md-nav__icon md-icon"></span>
          使用控制台
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/use-console/st-ug-console/" class="md-nav__link">
        控制台界面
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/use-console/st-ug-open-in-explorer/" class="md-nav__link">
        导入图探索
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/use-console/st-ug-visualize-findpath/" class="md-nav__link">
        查看子图
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10_5" type="checkbox" id="__nav_10_5" >
      
      <label class="md-nav__link" for="__nav_10_5">
        故障排查
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="故障排查" data-md-level="2">
        <label class="md-nav__title" for="__nav_10_5">
          <span class="md-nav__icon md-icon"></span>
          故障排查
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/troubleshooting/st-ug-config-server-errors/" class="md-nav__link">
        连接数据库错误
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/troubleshooting/st-ug-connection-errors/" class="md-nav__link">
        无法访问 Studio
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-studio/troubleshooting/st-ug-faq/" class="md-nav__link">
        常见问题
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11" type="checkbox" id="__nav_11" >
      
      <label class="md-nav__link" for="__nav_11">
        Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="Nebula Exchange" data-md-level="1">
        <label class="md-nav__title" for="__nav_11">
          <span class="md-nav__icon md-icon"></span>
          Nebula Exchange
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_1" type="checkbox" id="__nav_11_1" >
      
      <label class="md-nav__link" for="__nav_11_1">
        认识Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="认识Nebula Exchange" data-md-level="2">
        <label class="md-nav__title" for="__nav_11_1">
          <span class="md-nav__icon md-icon"></span>
          认识Nebula Exchange
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/about-exchange/ex-ug-what-is-exchange/" class="md-nav__link">
        什么是Nebula Exchange
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/about-exchange/ex-ug-limitations/" class="md-nav__link">
        使用限制
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/ex-ug-compile/" class="md-nav__link">
        编译Exchange
      </a>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_3" type="checkbox" id="__nav_11_3" >
      
      <label class="md-nav__link" for="__nav_11_3">
        参数说明
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="参数说明" data-md-level="2">
        <label class="md-nav__title" for="__nav_11_3">
          <span class="md-nav__icon md-icon"></span>
          参数说明
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/parameter-reference/ex-ug-para-import-command/" class="md-nav__link">
        导入命令参数
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/parameter-reference/ex-ug-parameter/" class="md-nav__link">
        配置参数
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_4" type="checkbox" id="__nav_11_4" >
      
      <label class="md-nav__link" for="__nav_11_4">
        使用Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="使用Nebula Exchange" data-md-level="2">
        <label class="md-nav__title" for="__nav_11_4">
          <span class="md-nav__icon md-icon"></span>
          使用Nebula Exchange
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-csv/" class="md-nav__link">
        导入CSV文件数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-json/" class="md-nav__link">
        导入JSON文件数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-orc/" class="md-nav__link">
        导入ORC文件数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-parquet/" class="md-nav__link">
        导入Parquet文件数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-hbase/" class="md-nav__link">
        导入HBase数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-mysql/" class="md-nav__link">
        导入MySQL数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-neo4j/" class="md-nav__link">
        导入Neo4j数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-hive/" class="md-nav__link">
        导入Hive数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-pulsar/" class="md-nav__link">
        导入Pulsar数据
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-kafka/" class="md-nav__link">
        导入Kafka数据
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-exchange/ex-ug-FAQ/" class="md-nav__link">
        常见问题FAQ
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_12" type="checkbox" id="__nav_12" >
      
      <label class="md-nav__link" for="__nav_12">
        Nebula Importer
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="Nebula Importer" data-md-level="1">
        <label class="md-nav__title" for="__nav_12">
          <span class="md-nav__icon md-icon"></span>
          Nebula Importer
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-importer/use-importer/" class="md-nav__link">
        使用Nebula Importer
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-importer/config-with-header/" class="md-nav__link">
        有表头配置说明
      </a>
    </li>
  

          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-importer/config-without-header/" class="md-nav__link">
        无表头配置说明
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-spark-connector/" class="md-nav__link">
        Nebula Spark Connector
      </a>
    </li>
  

    
      
      
      

  
  
  
    <li class="md-nav__item">
      <a href="../../../nebula-flink-connector/" class="md-nav__link">
        Nebula Flink Connector
      </a>
    </li>
  

    
      
      
      

  
  
  
    
    <li class="md-nav__item md-nav__item--nested">
      
      
        <input class="md-nav__toggle md-toggle" data-md-toggle="__nav_15" type="checkbox" id="__nav_15" >
      
      <label class="md-nav__link" for="__nav_15">
        社区贡献
        <span class="md-nav__icon md-icon"></span>
      </label>
      <nav class="md-nav" aria-label="社区贡献" data-md-level="1">
        <label class="md-nav__title" for="__nav_15">
          <span class="md-nav__icon md-icon"></span>
          社区贡献
        </label>
        <ul class="md-nav__list" data-md-scrollfix>
          
            
  
  
  
    <li class="md-nav__item">
      <a href="../../../15.contribution/how-to-contribute/" class="md-nav__link">
        如何贡献
      </a>
    </li>
  

          
        </ul>
      </nav>
    </li>
  

    
      
      
      

  
  
  
    <li class="md-nav__item">
      <a href="https://docs.nebula-graph.io/" class="md-nav__link">
        English
      </a>
    </li>
  

    
      
      
      

  
  
  
    <li class="md-nav__item">
      <a href="../../../pdf/NebulaGraph-CN.pdf" class="md-nav__link">
        PDF
      </a>
    </li>
  

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              
              <div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary" aria-label="目录">
  
  
  
    
  
  
    <label class="md-nav__title" for="__toc">
      <span class="md-nav__icon md-icon"></span>
      目录
    </label>
    <ul class="md-nav__list" data-md-component="toc" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#_1" class="md-nav__link">
    语法
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#match_1" class="md-nav__link">
    MATCH工作流程
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#opencypher" class="md-nav__link">
    openCypher兼容性
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#pattern" class="md-nav__link">
    使用模式（pattern）
  </a>
  
    <nav class="md-nav" aria-label="使用模式（pattern）">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" class="md-nav__link">
    前提条件
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_3" class="md-nav__link">
    匹配点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_4" class="md-nav__link">
    匹配标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_5" class="md-nav__link">
    匹配点的属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id" class="md-nav__link">
    匹配点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_6" class="md-nav__link">
    匹配连接的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_7" class="md-nav__link">
    匹配路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_8" class="md-nav__link">
    匹配边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_9" class="md-nav__link">
    匹配边类型和属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_10" class="md-nav__link">
    匹配多个边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_11" class="md-nav__link">
    匹配多条边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_12" class="md-nav__link">
    匹配定长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_13" class="md-nav__link">
    匹配变长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_14" class="md-nav__link">
    匹配多个边类型的变长路径
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_15" class="md-nav__link">
    常用检索操作
  </a>
  
    <nav class="md-nav" aria-label="常用检索操作">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_16" class="md-nav__link">
    检索点或边的信息
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id_1" class="md-nav__link">
    检索点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_17" class="md-nav__link">
    检索标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_18" class="md-nav__link">
    检索点或边的单个属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_19" class="md-nav__link">
    检索点或边的所有属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_20" class="md-nav__link">
    检索边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_21" class="md-nav__link">
    检索路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_22" class="md-nav__link">
    检索路径中的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_23" class="md-nav__link">
    检索路径中的边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_24" class="md-nav__link">
    检索路径长度
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content" data-md-component="content">
            <article class="md-content__inner md-typeset">
              
                
                  <a href="https://github.com/vesoft-inc/nebula-docs-cn/edit/v2.0.0/docs-2.0/3.ngql-guide/7.general-query-statements/2.match.md" title="编辑此页" class="md-content__button md-icon">
                    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M20.71 7.04c.39-.39.39-1.04 0-1.41l-2.34-2.34c-.37-.39-1.02-.39-1.41 0l-1.84 1.83 3.75 3.75M3 17.25V21h3.75L17.81 9.93l-3.75-3.75L3 17.25z"/></svg>
                  </a>
                
                
                <h1 id="match">MATCH<a class="headerlink" href="#match" title="Permanent link">&para;</a></h1>
<p><code>MATCH</code>语句提供基于模式（pattern）匹配的搜索功能。</p>
<p>一个<code>MATCH</code>语句定义了一个<a href="../../1.nGQL-overview/3.graph-patterns/">搜索模式</a>，用该模式匹配存储在Nebula Graph中的数据，然后用<code>RETURN</code>子句检索数据。</p>
<p>本文示例使用测试数据库<code>basketballplayer</code>进行演示。</p>
<h2 id="_1">语法<a class="headerlink" href="#_1" title="Permanent link">&para;</a></h2>
<p>与<code>GO</code>或<code>LOOKUP</code>等其他查询语句相比，<code>MATCH</code>的语法更灵活。<code>MATCH</code>语法可以概括如下：</p>
<div class="highlight"><pre><span></span><code>MATCH &lt;pattern&gt; [&lt;WHERE clause&gt;] RETURN &lt;output&gt;
</code></pre></div>
<h2 id="match_1">MATCH工作流程<a class="headerlink" href="#match_1" title="Permanent link">&para;</a></h2>
<ol>
<li>
<p><code>MATCH</code>语句使用原生索引查找起始点，起始点可以在模式的任何位置。即一个有效的<code>MATCH</code>语句，<strong>必须有一个属性、标签或者点已经创建索引</strong>。如何创建索引，请参见<a href="../../14.native-index-statements/1.create-native-index/">创建原生索引</a>。</p>
</li>
<li>
<p><code>MATCH</code>语句在模式中搜索，寻找匹配的边或点。</p>
</li>
<li>
<p><code>MATCH</code>语句根据<code>RETURN</code>子句检索数据。</p>
</li>
</ol>
<h2 id="opencypher">openCypher兼容性<a class="headerlink" href="#opencypher" title="Permanent link">&para;</a></h2>
<p>nGQL暂不支持遍历所有点和边，例如<code>MATCH (v) RETURN v</code>。</p>
<h2 id="pattern">使用模式（pattern）<a class="headerlink" href="#pattern" title="Permanent link">&para;</a></h2>
<h3 id="_2">前提条件<a class="headerlink" href="#_2" title="Permanent link">&para;</a></h3>
<p>请确保<code>MATCH</code>语句有至少一个索引可用。如果您需要创建索引，但是已经有相关的点、边或属性，您必须在创建索引后重建索引，索引才能生效。</p>
<blockquote>
<p><strong>警告</strong>：正确使用索引可以加快查询速度，但是索引会导致写性能大幅降低（降低90%甚至更多）。请<strong>不要随意</strong>在生产环境中使用索引，除非您很清楚使用索引对业务的影响。</p>
</blockquote>
<div class="highlight"><pre><span></span><code># 在属性name上创建索引。
nebula&gt; CREATE TAG INDEX name ON player(name(20)); 

# 重建索引使其生效。
nebula&gt; REBUILD TAG INDEX name; 
+------------+
| New Job Id |
+------------+
| 121        |
+------------+

# 确认重建索引成功。
nebula&gt; SHOW JOB 121; 
+----------------+---------------------+------------+------------+------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time | Stop Time  |
+----------------+---------------------+------------+------------+------------+
| 121            | &quot;REBUILD_TAG_INDEX&quot; | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 0              | &quot;storaged2&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 1              | &quot;storaged0&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 2              | &quot;storaged1&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
</code></pre></div>
<h3 id="_3">匹配点<a class="headerlink" href="#_3" title="Permanent link">&para;</a></h3>
<p>您可以在一对括号中使用自定义变量来表示模式中的点。例如<code>(v)</code>。</p>
<h3 id="_4">匹配标签<a class="headerlink" href="#_4" title="Permanent link">&para;</a></h3>
<blockquote>
<p><strong>说明</strong>：标签的索引和属性的索引不同。如果标签的某个属性有索引，但是标签本身没有索引，您无法基于该标签执行<code>MATCH</code>语句。</p>
</blockquote>
<p>您可以在点的右侧用<code>:&lt;tag_name&gt;</code>表示模式中的标签。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) RETURN v;
+---------------------------------------------------------------+
| v                                                             |
+---------------------------------------------------------------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})     |
+---------------------------------------------------------------+
| (&quot;player106&quot; :player{age: 25, name: &quot;Kyle Anderson&quot;})         |
+---------------------------------------------------------------+
| (&quot;player115&quot; :player{age: 40, name: &quot;Kobe Bryant&quot;})           |
+---------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_5">匹配点的属性<a class="headerlink" href="#_5" title="Permanent link">&para;</a></h3>
<p>您可以在标签的右侧用<code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code>表示模式中点的属性。</p>
<div class="highlight"><pre><span></span><code># 使用属性name搜索匹配的点。
nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<p>使用<code>WHERE</code>子句也可以实现相同的操作：</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) WHERE v.name == &quot;Tim Duncan&quot; RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>openCypher兼容性</strong>：在openCypher 9中，<code>=</code>是相等运算符，在nGQL中，<code>==</code>是相等运算符，<code>=</code>是赋值运算符。</p>
</blockquote>
<h3 id="id">匹配点ID<a class="headerlink" href="#id" title="Permanent link">&para;</a></h3>
<p>您可以使用点ID去匹配点。<code>id()</code>函数可以检索点的ID。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) WHERE id(v) == &#39;player101&#39; RETURN v;
+---------------------------------------------------+
| v                                                 |
+---------------------------------------------------+
| (player101) player.name:Tony Parker,player.age:36 |
+---------------------------------------------------+
</code></pre></div>
<p>要匹配多个点的ID，可以用<code>WHERE id(v) IN [vid_list]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player { name: &#39;Tim Duncan&#39; })--(v2) \
        WHERE id(v2) IN [&quot;player101&quot;, &quot;player102&quot;] RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="_6">匹配连接的点<a class="headerlink" href="#_6" title="Permanent link">&para;</a></h3>
<p>您可以使用<code>--</code>符号表示两个方向的边，并匹配这些边连接的点。</p>
<blockquote>
<p><strong>说明</strong>：在nGQL 1.x中，<code>--</code>符号用于行内注释，在nGQL 2.x中，<code>--</code>符号表示出边或入边。</p>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--(v2) \
        RETURN v2.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
| &quot;Marco Belinelli&quot;   |
+---------------------+
| &quot;Danny Green&quot;       |
+---------------------+
| &quot;Aron Baynes&quot;       |
+---------------------+
...
</code></pre></div>
<p>您可以在<code>--</code>符号上增加<code>&lt;</code>或<code>&gt;</code>符号指定边的方向。</p>
<div class="highlight"><pre><span></span><code># --&gt;表示边从v开始，指向v2。对于点v来说是出边，对于点v2来说是入边。
nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2) \
        RETURN v2.name AS Name;
+-----------------+
| Name            |
+-----------------+
| &quot;Spurs&quot;         |
+-----------------+
| &quot;Tony Parker&quot;   |
+-----------------+
| &quot;Manu Ginobili&quot; |
+-----------------+
</code></pre></div>
<p>如果需要扩展模式，可以增加更多点和边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2)&lt;--(v3) \
        RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;Tiago Splitter&quot;    |
+---------------------+
| &quot;Dejounte Murray&quot;   |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
...
</code></pre></div>
<p>如果您不需要引用点，可以省略括号中表示点的变量。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;()&lt;--(v3) \
        RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
| &quot;Rudy Gay&quot;          |
+---------------------+
| &quot;Danny Green&quot;       |
+---------------------+
| &quot;Kyle Anderson&quot;     |
+---------------------+
...
</code></pre></div>
<h3 id="_7">匹配路径<a class="headerlink" href="#_7" title="Permanent link">&para;</a></h3>
<p>连接起来的点和边构成了路径。您可以使用自定义变量命名路径。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2) \
        RETURN p;
+-------------------------------------------+
| p                                         |
+-------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt;   |
+-------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt; |
+-------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt; |
+-------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>openCypher兼容性</strong>：在nGQL中，<code>@</code>符号表示边的rank，在openCypher中，没有rank概念。</p>
</blockquote>
<h3 id="_8">匹配边<a class="headerlink" href="#_8" title="Permanent link">&para;</a></h3>
<p>除了用<code>--</code>、<code>--&gt;</code>、<code>&lt;--</code>表示未命名的边之外，您还可以在方括号中使用自定义变量命名边。例如<code>-[e]-</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player101&quot;-&gt;&quot;player100&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow &quot;player102&quot;-&gt;&quot;player100&quot; @0 {degree: 75}]                        |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_9">匹配边类型和属性<a class="headerlink" href="#_9" title="Permanent link">&para;</a></h3>
<p>和点一样，您可以用<code>:&lt;edge_type&gt;</code>表示模式中的边类型。例如<code>-[e:serve]-</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:serve]-(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<p>您可以用<code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code>表示模式中边类型的属性。例如<code>[e:follow{likeness:95}]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:follow{degree:95}]-&gt;(v2) \
        RETURN e;
+--------------------------------------------------------+
| e                                                      |
+--------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]     |
+--------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]     |
+--------------------------------------------------------+
</code></pre></div>
<h3 id="_10">匹配多个边类型<a class="headerlink" href="#_10" title="Permanent link">&para;</a></h3>
<p>使用<code>|</code>可以匹配多个边类型。例如<code>[e:follow|:serve]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:follow|:serve]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_11">匹配多条边<a class="headerlink" href="#_11" title="Permanent link">&para;</a></h3>
<p>您可以扩展模式，匹配路径中的多条边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2)&lt;-[e:serve]-(v3) \
        RETURN v2, v3;
+------------------------------------+-----------------------------------------------------------+
| v2                                 | v3                                                        |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player103&quot; :player{age: 32, name: &quot;Rudy Gay&quot;})          |
+------------------------------------+-----------------------------------------------------------+
...
</code></pre></div>
<h3 id="_12">匹配定长路径<a class="headerlink" href="#_12" title="Permanent link">&para;</a></h3>
<p>您可以在模式中使用<code>:&lt;edge_type&gt;*&lt;hop&gt;</code>匹配定长路径。<code>hop</code>必须是一个非负整数。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*2]-&gt;(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
</code></pre></div>
<p>如果<code>hop</code>为0，模式会匹配路径上的起始点。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) -[*0]-&gt; (v2) \
        RETURN v2;
+----------------------------------------------------+
| v2                                                 |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+
</code></pre></div>
<h3 id="_13">匹配变长路径<a class="headerlink" href="#_13" title="Permanent link">&para;</a></h3>
<p>您可以在模式中使用<code>:&lt;edge_type&gt;*[minHop]..&lt;maxHop&gt;</code>匹配变长路径。</p>
<table>
<thead>
<tr>
<th align="left">参数</th>
<th align="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td align="left"><code>minHop</code></td>
<td align="left">可选项。表示路径的最小长度。<code>minHop</code>必须是一个非负整数，默认值为1。</td>
</tr>
<tr>
<td align="left"><code>maxHop</code></td>
<td align="left">必选项。表示路径的最大长度。<code>maxHop</code>必须是一个非负整数，没有默认值。</td>
</tr>
</tbody>
</table>
<blockquote>
<p><strong>openCypher兼容性</strong>：在openCypher中，<code>maxHop</code>是可选项，默认为无穷大。当没有设置时，<code>..</code>可以省略。在nGQL中，<code>maxHop</code>是必选项，而且<code>..</code>不可以省略。</p>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*1..3]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
+-----------------------------------------------------------+
</code></pre></div>
<p>您可以使用<code>DISTINCT</code>关键字聚合重复结果。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*1..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | COUNT(v2) |
+-----------------------------------------------------------+-----------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     | 3         |
+-----------------------------------------------------------+-----------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) | 1         |
+-----------------------------------------------------------+-----------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        | 4         |
+-----------------------------------------------------------+-----------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       | 3         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<p>如果<code>minHop</code>为<code>0</code>，模式会匹配路径上的起始点。与上个示例相比，下面的示例设置<code>minHop</code>为<code>0</code>，因为它是起始点，所以结果集中<code>"Tim Duncan"</code>比上个示例多计算一次。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*0..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | COUNT(v2) |
+-----------------------------------------------------------+-----------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     | 3         |
+-----------------------------------------------------------+-----------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       | 3         |
+-----------------------------------------------------------+-----------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) | 1         |
+-----------------------------------------------------------+-----------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        | 5         |
+-----------------------------------------------------------+-----------+
</code></pre></div>
<h3 id="_14">匹配多个边类型的变长路径<a class="headerlink" href="#_14" title="Permanent link">&para;</a></h3>
<p>您可以在变长或定长模式中指定多个边类型。<code>hop</code>、<code>minHop</code>和<code>maxHop</code>对所有边类型都生效。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow|serve*2]-&gt;(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;})                        |
+-----------------------------------------------------------+
| (&quot;player215&quot; :team{name: &quot;Hornets&quot;})                      |
+-----------------------------------------------------------+
</code></pre></div>
<h2 id="_15">常用检索操作<a class="headerlink" href="#_15" title="Permanent link">&para;</a></h2>
<h3 id="_16">检索点或边的信息<a class="headerlink" href="#_16" title="Permanent link">&para;</a></h3>
<p>使用<code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}</code>检索点或边的所有信息。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+

nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="id_1">检索点ID<a class="headerlink" href="#id_1" title="Permanent link">&para;</a></h3>
<p>使用<code>id()</code>函数检索点ID。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN id(v);
+-------------+
| id(v)       |
+-------------+
| &quot;player100&quot; |
+-------------+
</code></pre></div>
<h3 id="_17">检索标签<a class="headerlink" href="#_17" title="Permanent link">&para;</a></h3>
<p>使用<code>labels()</code>函数检索点上的标签列表。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN labels(v);
+------------+
| labels(v)  |
+------------+
| [&quot;player&quot;] |
+------------+
</code></pre></div>
<p>检索列表<code>labels(v)</code>中的第N个元素，可以使用<code>labels(v)[n-1]</code>。例如下面示例使用<code>labels(v)[0]</code>检索第一个元素。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN labels(v)[0];
+--------------+
| labels(v)[0] |
+--------------+
| &quot;player&quot;     |
+--------------+
</code></pre></div>
<h3 id="_18">检索点或边的单个属性<a class="headerlink" href="#_18" title="Permanent link">&para;</a></h3>
<p>使用<code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}.&lt;property&gt;</code>检索单个属性。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v.age;
+-------+
| v.age |
+-------+
| 42    |
+-------+
</code></pre></div>
<p>使用<code>AS</code>设置属性的别名。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v.age AS Age;
+-----+
| Age |
+-----+
| 42  |
+-----+
</code></pre></div>
<h3 id="_19">检索点或边的所有属性<a class="headerlink" href="#_19" title="Permanent link">&para;</a></h3>
<p>使用<code>properties()</code>函数检索点或边的所有属性。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) \
        RETURN properties(v2);
+------------------------------------+
| properties(v2)                     |
+------------------------------------+
| {&quot;name&quot;:&quot;Spurs&quot;}                   |
+------------------------------------+
| {&quot;name&quot;:&quot;Tony Parker&quot;, &quot;age&quot;:36}   |
+------------------------------------+
| {&quot;age&quot;:41, &quot;name&quot;:&quot;Manu Ginobili&quot;} |
+------------------------------------+
</code></pre></div>
<h3 id="_20">检索边类型<a class="headerlink" href="#_20" title="Permanent link">&para;</a></h3>
<p>使用<code>type()</code>函数检索匹配的边类型。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;() \
        RETURN DISTINCT type(e);
+----------+
| type(e)  |
+----------+
| &quot;follow&quot; |
+----------+
| &quot;serve&quot;  |
+----------+
</code></pre></div>
<h3 id="_21">检索路径<a class="headerlink" href="#_21" title="Permanent link">&para;</a></h3>
<p>使用<code>RETURN &lt;path_name&gt;</code>检索匹配路径的所有信息。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[*3]-&gt;() \
        RETURN p;
+-------------------------------------------------------------------------------------------------+
| p                                                                                               |
+-------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})-[:serve@0 {end_year: 2019, start_year: 2015}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;           |
+-------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})-[:serve@0 {end_year: 2015, start_year: 2006}]-&gt;(&quot;team203&quot; :team{name: &quot;Trail Blazers&quot;})&gt;   |
+-------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})-[:follow@0 {degree: 75}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt;             |
+-------------------------------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_22">检索路径中的点<a class="headerlink" href="#_22" title="Permanent link">&para;</a></h3>
<p>使用<code>nodes()</code>函数检索路径中的所有点。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) \
        RETURN nodes(p);
+---------------------------------------------------------------------------------------------------------------------+
| nodes(p)                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player204&quot; :team{name: &quot;Spurs&quot;})]                    |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})]   |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})] |
+---------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_23">检索路径中的边<a class="headerlink" href="#_23" title="Permanent link">&para;</a></h3>
<p>使用<code>relationships()</code>函数检索路径中的所有边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) \
        RETURN relationships(p);
+-----------------------------------------------------------------------------+
| relationships(p)                                                            |
+-----------------------------------------------------------------------------+
| [[:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]]                        |
+-----------------------------------------------------------------------------+
| [[:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]]                        |
+-----------------------------------------------------------------------------+
| [[:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]]     |
+-----------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_24">检索路径长度<a class="headerlink" href="#_24" title="Permanent link">&para;</a></h3>
<p>使用<code>length()</code>函数检索路径的长度。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[*..2]-&gt;(v2) \
        RETURN p AS Paths, length(p) AS Length;
+----------------------------------------------------------------------+--------+
| Paths                                                                | Length |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})-[:serve@0 {end_year: 2018, start_year: 2002}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;   | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})&gt;      | 2      |
+----------------------------------------------------------------------+--------+
|  &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:serve@0 {end_year: 2019, start_year: 2018}]-&gt;(&quot;team215&quot; :team{name: &quot;Hornets&quot;})&gt;  | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:serve@0 {end_year: 2018, start_year: 1999}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;     | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt;     | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})&gt; | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})&gt;        | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;                                                                                   | 1      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt;                                                                                   | 1      |
+----------------------------------------------------------------------+--------+
</code></pre></div>
                
                  
                    

<hr>
<div class="md-source-date">
  <small>
    
      最后更新: <span class="git-revision-date-localized-plugin git-revision-date-localized-plugin-date">2021年4月13日</span>
      
    
  </small>
</div>
                  
                
              
              
                


              
            </article>
          </div>
        </div>
        
          <a href="#" class="md-top md-icon" title="Back to top" data-md-component="top" data-md-state="hidden">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M13 20h-2V8l-5.5 5.5-1.42-1.42L12 4.16l7.92 7.92-1.42 1.42L13 8v12z"/></svg>
          </a>
        
      </main>
      
        
<footer class="md-footer">
  
    <nav class="md-footer__inner md-grid" aria-label="Footer">
      
        <a href="../../6.functions-and-expressions/9.user-defined-functions/" class="md-footer__link md-footer__link--prev" rel="prev">
          <div class="md-footer__button md-icon">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12z"/></svg>
          </div>
          <div class="md-footer__title">
            <div class="md-ellipsis">
              <span class="md-footer__direction">
                上一页
              </span>
              自定义函数
            </div>
          </div>
        </a>
      
      
        <a href="../5.lookup/" class="md-footer__link md-footer__link--next" rel="next">
          <div class="md-footer__title">
            <div class="md-ellipsis">
              <span class="md-footer__direction">
                下一页
              </span>
              LOOKUP
            </div>
          </div>
          <div class="md-footer__button md-icon">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 24"><path d="M4 11v2h12l-5.5 5.5 1.42 1.42L19.84 12l-7.92-7.92L10.5 5.5 16 11H4z"/></svg>
          </div>
        </a>
      
    </nav>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2021 Nebula Graph - 浙ICP备20010487号
          </div>
        
        Made with
        <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
          Material for MkDocs
        </a>
        
      </div>
      
  <div class="md-footer-social">
    
      
      
        
        
      
      <a href="https://github.com/vesoft-inc/nebula-docs-cn" target="_blank" rel="noopener" title="github.com" class="md-footer-social__link">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 496 512"><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"/></svg>
      </a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    <div class="md-dialog" data-md-component="dialog">
      <div class="md-dialog__inner md-typeset"></div>
    </div>
    <script id="__config" type="application/json">{"base": "../../..", "features": ["navigation.top"], "translations": {"clipboard.copy": "\u590d\u5236", "clipboard.copied": "\u5df2\u590d\u5236", "search.config.lang": "ja", "search.config.pipeline": "trimmer, stemmer", "search.config.separator": "[\\uff0c\\u3002]+", "search.placeholder": "\u641c\u7d22", "search.result.placeholder": "\u952e\u5165\u4ee5\u5f00\u59cb\u641c\u7d22", "search.result.none": "\u6ca1\u6709\u627e\u5230\u7b26\u5408\u6761\u4ef6\u7684\u7ed3\u679c", "search.result.one": "\u627e\u5230 1 \u4e2a\u7b26\u5408\u6761\u4ef6\u7684\u7ed3\u679c", "search.result.other": "# \u4e2a\u7b26\u5408\u6761\u4ef6\u7684\u7ed3\u679c", "search.result.more.one": "1 more on this page", "search.result.more.other": "# more on this page", "search.result.term.missing": "Missing"}, "search": "../../../assets/javascripts/workers/search.d351de03.min.js", "version": {"method": "mike"}}</script>
    
    
      <script src="../../../assets/javascripts/bundle.34eae1b6.min.js"></script>
      
        <script src="../../../js/version-select.js"></script>
      
    
  </body>
</html>