# 引用属性

您可以在`WHERE`和`YIELD`子句中引用点或边的属性。

>**说明**：本功能仅适用于nGQL扩展。

## 引用点的属性

### 起始点

```ngql
$^.<tag_name>.<prop_name>
```

|参数|说明|
|:----------|:-----------------|
|`$^`       |表示起始点。        |
|`tag_name` |点的标签名称。   |
|`prop_name`|标签内的属性名称。|

### 目的点

```ngql
$$.tag_name.prop_name
```

|参数|说明|
|:----------|:-----------------|
|`$$`       |表示目的点。        |
|`tag_name` |点的标签名称。   |
|`prop_name`|标签内的属性名称。|

## 引用边的属性

### 引用自定义的边属性

```ngql
<edge_type>.<prop_name>
```

|参数|说明|
|:----------|:------------------|
|`edge_type`|边类型。            |
|`prop_name` |边类型的属性名称。|

### 引用内置的边属性

除了自定义的边属性，每条边还有如下三种内置属性：

|参数|说明|
|:----------|:------------------|
|`_src`|边的起始点。           |
|`_dst`|边的目的点。|
|`_type`|边的类型内部编码，正负号表示方向。|
|`_rank`|边的rank值。|

## 示例

```ngql
# 返回起始点的标签player的name属性值和目的点的标签player的age属性值。
nebula> GO FROM "player100" OVER follow YIELD $^.player.name AS startName, $$.player.age AS endAge;
+--------------+--------+
| startName    | endAge |
+--------------+--------+
| "Tim Duncan" | 36     |
+--------------+--------+
| "Tim Duncan" | 33     |
+--------------+--------+

# 返回边类型follow的degree属性值。
nebula> GO FROM "player100" OVER follow YIELD follow.degree;
+---------------+
| follow.degree |
+---------------+
| 95            |
+---------------+
| 90            |
+---------------+

# 返回边类型follow的起始点、目的点、边类型编码和边rank值。
```ngql
nebula> GO FROM "player100" OVER follow YIELD follow._src, follow._dst, follow._type, follow._rank;
+-------------+-------------+--------------+--------------+
| follow._src | follow._dst | follow._type | follow._rank |
+-------------+-------------+--------------+--------------+
| "player100" | "player101" | 136          | 0            |
+-------------+-------------+--------------+--------------+
| "player100" | "player102" | 136          | 0            |
+-------------+-------------+--------------+--------------+
```