# 引用属性

用户可以在`WHERE`和`YIELD`子句中引用点或边的属性。

!!! Note

    本功能仅适用于原生nGQL。

## 引用点的属性

### 起始点

```ngql
$^.<tag_name>.<prop_name>
```

|参数|说明|
|:----------|:-----------------|
|`$^`       |起始点       |
|`tag_name` |点的Tag名称   |
|`prop_name`|Tag内的属性名称|

### 目的点

```ngql
$$.<tag_name>.<prop_name>
```

|参数|说明|
|:----------|:-----------------|
|`$$`       |目的点        |
|`tag_name` |点的Tag名称   |
|`prop_name`|Tag内的属性名称|

## 引用边的属性

### 引用自定义的边属性

```ngql
<edge_type>.<prop_name>
```

|参数|说明|
|:----------|:------------------|
|`edge_type`|Edge type            |
|`prop_name` |Edge type的属性名称|

### 引用内置的边属性

除了自定义的边属性，每条边还有如下四种内置属性：

|参数|说明|
|:----------|:------------------|
|`_src`|边的起始点           |
|`_dst`|边的目的点|
|`_type`|边的类型内部编码，正负号表示方向|
|`_rank`|边的rank值|

## 示例

```ngql
# 返回起始点的Tag player的name属性值和目的点的Tag player的age属性值。
nebula> GO FROM "player100" OVER follow YIELD $^.player.name AS startName, $$.player.age AS endAge;
+--------------+--------+
| startName    | endAge |
+--------------+--------+
| "Tim Duncan" | 36     |
+--------------+--------+
| "Tim Duncan" | 33     |
+--------------+--------+

# 返回Edge type follow的degree属性值。
nebula> GO FROM "player100" OVER follow YIELD follow.degree;
+---------------+
| follow.degree |
+---------------+
| 95            |
+---------------+
| 90            |
+---------------+

# 返回Edge type follow的起始点、目的点、Edge type编码和边rank值。
nebula> GO FROM "player100" OVER follow YIELD follow._src, follow._dst, follow._type, follow._rank;
+-------------+-------------+--------------+--------------+
| follow._src | follow._dst | follow._type | follow._rank |
+-------------+-------------+--------------+--------------+
| "player100" | "player101" | 136          | 0            |
+-------------+-------------+--------------+--------------+
| "player100" | "player102" | 136          | 0            |
+-------------+-------------+--------------+--------------+
```
