# Schema函数

Nebula Graph支持以下Schema函数。

|函数| 说明 |
|:----  |  :----|
| id(vertex) | 返回点ID。数据类型和点ID的类型保持一致。|
|list tags(vertex) | 返回点的标签。|
|list labels(vertex) | 返回点的标签。|
|map properties(vertex_or_edge) | 接收点或边并返回其属性。|
|string type(edge) | 返回边的边类型。|
|vertex startNode(path) | 获取一条边或一条路径并返回它的起始点ID。|
|string endNode(path) | 获取一条边或一条路径并返回它的目的点ID。|
|int rank(edge) | 返回边的rank。|

## 示例

```ngql
nebula> MATCH (a:player) WHERE id(a) == "player100" \
        RETURN tags(a), labels(a), properties(a);
+------------+------------+-------------------------------+
| tags(a)    | labels(a)  | properties(a)                 |
+------------+------------+-------------------------------+
| ["player"] | ["player"] | {age: 42, name: "Tim Duncan"} |
+------------+------------+-------------------------------+

nebula> MATCH p = (a :player {name : "Tim Duncan"})-[r:serve]-(t) \
        RETURN type(r), rank(r);
+---------+---------+
| type(r) | rank(r) |
+---------+---------+
| "serve" | 0       |
+---------+---------+

nebula> MATCH p = (a :player {name : "Tim Duncan"})-[r:serve]-(t) \
        RETURN startNode(p), endNode(p);
+----------------------------------------------------+----------------------------------+
| startNode(p)                                       | endNode(p)                       |
+----------------------------------------------------+----------------------------------+
| ("player100" :player{age: 42, name: "Tim Duncan"}) | ("team204" :team{name: "Spurs"}) |
+----------------------------------------------------+----------------------------------+
```