# 常见问题FAQ

## 关于openCypher兼容性

### nGQL兼容openCypher 9吗？

nGQL部分兼容openCypher 9。

在[Nebula Graph Issues](https://github.com/vesoft-inc/nebula-graph/issues)中已经列出已知的不兼容项。如果您发现这种类型的新问题，请提交问题并附带`incompatible`标签。您可以通过关键字`compatibility`搜索兼容性问题。

下面是nGQL和openCypher 9的主要差异（由于设计原因而不兼容）。

|类别| openCypher 9 | nGQL |
| :--- | :--- |:--- |
|Schema| 弱Schema | 强Schema |
|相等运算符| `=` |  `==` |
|数学求幂| `^` | 使用`pow(x, y)`替代`^` |  
|边rank| 无此概念 | 用`@rank`设置 |
|语句|-|不支持openCypher 9的所有DML语句（`CREATE`、`MERGE`等）和部分`MATCH`语句。 |

>**说明**：请注意[openCypher 9](http://www.opencypher.org/)和[Cypher](https://neo4j.com/developer/cypher/)在语法和许可上有一些不同。例如Cypher要求事物中的所有Cypher语句必须显式执行，而openCypher没有这样的要求。另外，nGQL暂不支持事务。

### 哪里可以找到更多nGQL的示例？

您可以在Nebula Graph GitHub的[features](https://github.com/vesoft-inc/nebula-graph/tree/master/tests/tck/features)目录内查看超过2500条nGQL示例。

features目录内包含很多.features格式的文件，每个文件都记录了使用nGQL的场景和示例。例如：

```text
Feature: Match seek by tag

  Background: Prepare space
    Given a graph with space named "nba"

  Scenario: seek by empty tag index
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid
      """
    Then the result should be, in any order:
      | vid          |
      | 'Tim Duncan' |
    And no side effects
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid, v.age AS age
      """
    Then the result should be, in any order:
      | vid          | age |
      | 'Tim Duncan' | 42  |
    And no side effects
```

示例中的关键字说明如下。

|关键字|说明|
|:---|:---|
|`Feature`|描述当前文档的主题。|
|`Background`|描述当前文档的背景信息。|
|`Given`|描述执行示例语句的前提条件。|
|`Scenario`|描述具体场景。如果场景之前有`@skip`标识，表示这个场景下示例语句可能无法正常工作，请不要在生产环境中使用该示例语句。|
|`When`|描述要执行的nGQL示例语句。|
|`Then`|描述执行`When`内语句的预期返回结果。如果您的返回结果和文档不同，请提交[issue](https://github.com/vesoft-inc/nebula-graph/issues)通知Nebula Graph团队。|
|`And`|描述执行`When`内语句的副作用。|
| `@skip` | 跳过这个示例。通常表示测试代码还没有准备好。 |

欢迎您[增加更多实用场景示例](https://docs.nebula-graph.io/1.1/manual-EN/4.contributions/how-to-contribute/)，成为Nebula Graph贡献者。

## 关于程序执行

### 返回消息中`time spent`的含义是什么？

将命令`SHOW SPACES`返回的消息作为示例：

```nGQL
nebula> SHOW SPACES;
+------+
| Name |
+------+
| nba  |
+------+
Got 1 rows (time spent 1235/1934 us)
```

- 第一个数字`1235`表示数据库本身执行该命令花费的时间，即查询引擎从客户端接收到一个查询，然后从存储服务器获取数据并执行一系列计算所花费的时间。

- 第二个数字`1934`表示从客户端角度看所花费的时间，即从客户端发送请求、接收结果，然后在屏幕上显示结果所花费的时间。

### 可以在`CREATE SPACE`时设置`replica_factor`为偶数（例如设置为2）吗？

不可以。

Storage服务使用Raft协议（多数派选举）选举一个leader。如果`replica_factor=2`，2个副本都参加投票，多数派是2，而不是1。当其中一个副本故障时，另一个副本无法开始选举，导致系统无法工作。

建议您在生产环境中设置`replica_factor=3`，测试环境中设置`replica_factor=1`，不要使用偶数。

### 如何处理报错`[ERROR (-7)]: SyntaxError: syntax error near`？

大部分情况下，查询语句需要有`YIELD`或`RETURN`，请检查您的查询语句是否包含。
