# 管道符

nGQL支持使用管道符（|）将多个查询组合起来。
## openCypher兼容性

管道符仅适用于nGQL扩展。

## 语法

nGQL和SQL之间的一个主要区别是子查询的组成方式。

- 在SQL中，子查询是嵌套在查询语句中的。

- 在nGQL中，子查询是通过类似shell中的管道符（`|`）实现子查询。

## 示例

```ngql
nebula> GO FROM "player100" OVER follow \
YIELD follow._dst AS dstid, $$.player.name AS Name | \
GO FROM $-.dstid OVER follow;

+-------------+
| follow._dst |
+-------------+
| "player101" |
+-------------+
```

您可以使用`YIELD`显式声明需要返回的结果，如果不使用`YIELD`，默认返回目标点ID。

使用管道符时，请在`YIELD`子句中为引用符`$-.`设置别名。例如示例中的`dstid`。