
<!DOCTYPE html>

<html class="no-js" lang="zh">
<head>
<meta charset="utf-8"/>
<meta content="width=device-width,initial-scale=1" name="viewport"/>
<meta content="Nebula Graph Database" name="description"/>
<meta content="吴敏,周瑶,梁振亚" name="author"/>
<link href="../../../assets/images/favicon.ico" rel="icon"/>
<meta content="mkdocs-1.1.2, mkdocs-material-7.1.4" name="generator"/>
<title>GO - 开源分布式图数据库 Nebula Graph</title>
<link href="../../../assets/stylesheets/main.bde7dde4.min.css" rel="stylesheet"/>
<link href="../../../assets/stylesheets/palette.ef6f36e2.min.css" rel="stylesheet"/>
<meta content="#009485" name="theme-color"/>
<link crossorigin="" href="https://fonts.gstatic.com" rel="preconnect"/>
<link href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&amp;display=fallback" rel="stylesheet"/>
<style>:root{--md-text-font-family:"Roboto";--md-code-font-family:"Roboto Mono"}</style>
<link href="../../../stylesheets/logo.css" rel="stylesheet"/>
<link href="../../../css/version-select.css" rel="stylesheet"/>
</head>
<body data-md-color-accent="light-green" data-md-color-primary="teal" data-md-color-scheme="" dir="ltr">
<script>function __prefix(e){return new URL("../../..",location).pathname+"."+e}function __get(e,t=localStorage){return JSON.parse(t.getItem(__prefix(e)))}</script>
<input autocomplete="off" class="md-toggle" data-md-toggle="drawer" id="__drawer" type="checkbox"/>
<input autocomplete="off" class="md-toggle" data-md-toggle="search" id="__search" type="checkbox"/>
<label class="md-overlay" for="__drawer"></label>
<div data-md-component="skip">
<a class="md-skip" href="#go">
          跳转至
        </a>
</div>
<div data-md-component="announce">
</div>
<header class="md-header" data-md-component="header">
<nav aria-label="Header" class="md-header__inner md-grid">
<a aria-label="开源分布式图数据库 Nebula Graph" class="md-header__button md-logo" data-md-component="logo" href="../../.." title="开源分布式图数据库 Nebula Graph">
<img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png"/>
</a>
<label class="md-header__button md-icon" for="__drawer">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M3 6h18v2H3V6m0 5h18v2H3v-2m0 5h18v2H3v-2z"></path></svg>
</label>
<div class="md-header__title" data-md-component="header-title">
<div class="md-header__ellipsis">
<div class="md-header__topic">
<span class="md-ellipsis">
            开源分布式图数据库 Nebula Graph
          </span>
</div>
<div class="md-header__topic" data-md-component="header-topic">
<span class="md-ellipsis">
            
              GO
            
          </span>
</div>
</div>
</div>
</nav>
</header>
<div class="md-container" data-md-component="container">
<main class="md-main" data-md-component="main">
<div class="md-main__inner md-grid">
<div class="md-sidebar md-sidebar--primary" data-md-component="sidebar" data-md-type="navigation">
<div class="md-sidebar__scrollwrap">
<div class="md-sidebar__inner">
<nav aria-label="Navigation" class="md-nav md-nav--primary" data-md-level="0">
<label class="md-nav__title" for="__drawer">
<a aria-label="开源分布式图数据库 Nebula Graph" class="md-nav__button md-logo" data-md-component="logo" href="../../.." title="开源分布式图数据库 Nebula Graph">
<img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png"/>
</a>
    开源分布式图数据库 Nebula Graph
  </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../git-version/">
        本书更新版本
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_2" id="__nav_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_2">
        前言
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="前言" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_2">
<span class="md-nav__icon md-icon"></span>
          前言
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../0.foreground/0-graph/">
        图
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../0.foreground/1-graph-database/">
        图数据库
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_3" id="__nav_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_3">
        简介
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="简介" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_3">
<span class="md-nav__icon md-icon"></span>
          简介
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/1.what-is-nebula-graph/">
        什么是Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/2.data-model/">
        数据结构
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_3_3" id="__nav_3_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_3_3">
        Nebula Graph架构
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Graph架构" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_3_3">
<span class="md-nav__icon md-icon"></span>
          Nebula Graph架构
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/">
        架构总览
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/">
        Meta服务
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/">
        Graph服务
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/">
        Storage服务
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_4" id="__nav_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_4">
        快速入门
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="快速入门" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_4">
<span class="md-nav__icon md-icon"></span>
          快速入门
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/1.quick-start-workflow/">
        快速入门流程
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/2.deploy-nebula-graph-with-docker-compose/">
        Docker Compose部署Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/5.start-stop-service/">
        管理Nebula Graph服务
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/3.connect-to-nebula-graph/">
        连接Nebula Graph
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../2.quick-start/4.nebula-graph-crud/">
        Nebula Graph常用语法（CRUD）
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--active md-nav__item--nested">
<input checked="" class="md-nav__toggle md-toggle" data-md-toggle="__nav_5" id="__nav_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_5">
        nGQL指南
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="nGQL指南" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_5">
<span class="md-nav__icon md-icon"></span>
          nGQL指南
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_1" id="__nav_5_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_1">
        nGQL概述
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="nGQL概述" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_1">
<span class="md-nav__icon md-icon"></span>
          nGQL概述
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/1.overview/">
        Nebula Graph查询语言（nGQL）
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../1.nGQL-overview/3.graph-patterns/">
        模式
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_2" id="__nav_5_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_2">
        数据类型
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="数据类型" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_2">
<span class="md-nav__icon md-icon"></span>
          数据类型
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/1.numeric/">
        数值
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/2.boolean/">
        布尔
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/3.string/">
        字符串
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/4.date-and-time/">
        日期时间
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/5.null/">
        NULL
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/6.list/">
        列表
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/7.set/">
        集合
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/8.map/">
        映射
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../3.data-types/9.type-conversion/">
        类型转换
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_3" id="__nav_5_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_3">
        变量和复合查询
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="变量和复合查询" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_3">
<span class="md-nav__icon md-icon"></span>
          变量和复合查询
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/1.composite-queries/">
        复合查询
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/2.user-defined-variables/">
        自定义变量
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../4.variable-and-composite-queries/3.property-reference/">
        引用属性
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_4" id="__nav_5_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_4">
        运算符
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="运算符" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_4">
<span class="md-nav__icon md-icon"></span>
          运算符
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/1.comparison/">
        比较符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/2.boolean/">
        布尔符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/4.pipe/">
        管道符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/5.property-reference/">
        属性引用符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/6.set/">
        集合运算符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/7.string/">
        字符串运算符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/8.list/">
        列表运算符
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../5.operators/9.precedence/">
        运算符优先级
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_5" id="__nav_5_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_5">
        函数和表达式
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="函数和表达式" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_5">
<span class="md-nav__icon md-icon"></span>
          函数和表达式
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/1.math/">
        数学函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/2.string/">
        字符串函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/3.date-and-time/">
        日期时间函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/4.schema/">
        Schema函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/5.case-expressions/">
        CASE表达式
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/6.list/">
        列表函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/7.count/">
        count函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/10.collect/">
        collect函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/11.reduce/">
        reduce函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/12.hash/">
        hash函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/8.predicate/">
        谓词函数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../6.functions-and-expressions/9.user-defined-functions/">
        自定义函数
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--active md-nav__item--nested">
<input checked="" class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_6" id="__nav_5_6" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_6">
        通用查询语句
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="通用查询语句" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_6">
<span class="md-nav__icon md-icon"></span>
          通用查询语句
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../2.match/">
        Match
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../5.lookup/">
        LOOKUP
      </a>
</li>
<li class="md-nav__item md-nav__item--active">
<input class="md-nav__toggle md-toggle" data-md-toggle="toc" id="__toc" type="checkbox"/>
<label class="md-nav__link md-nav__link--active" for="__toc">
          GO
          <span class="md-nav__icon md-icon"></span>
</label>
<a class="md-nav__link md-nav__link--active" href="./">
        GO
      </a>
<nav aria-label="目录" class="md-nav md-nav--secondary">
<label class="md-nav__title" for="__toc">
<span class="md-nav__icon md-icon"></span>
      目录
    </label>
<ul class="md-nav__list" data-md-component="toc" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="#opencypher">
    openCypher兼容性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_1">
    语法
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_2">
    示例
  </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../4.fetch/">
        FETCH
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../7.unwind/">
        UNWIND
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_6_6" id="__nav_5_6_6" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_6_6">
        SHOW
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="SHOW" class="md-nav" data-md-level="3">
<label class="md-nav__title" for="__nav_5_6_6">
<span class="md-nav__icon md-icon"></span>
          SHOW
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/1.show-charset/">
        SHOW CHARSET
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/2.show-collation/">
        SHOW COLLATION
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/4.show-create-space/">
        SHOW CREATE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/5.show-create-tags-edges/">
        SHOW CREATE TAGS/EDGES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/6.show-hosts/">
        SHOW HOSTS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/7.show-index-status/">
        SHOW INDEX STATUS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/8.show-indexes/">
        SHOW INDEXES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/9.show-parts/">
        SHOW PARTS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/10.show-roles/">
        SHOW ROLES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/11.show-snapshots/">
        SHOW SNAPSHOTS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/12.show-spaces/">
        SHOW SPACES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/14.show-stats/">
        SHOW STATS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/15.show-tags-edges/">
        SHOW TAGS/EDGES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../6.show/16.show-users/">
        SHOW USERS
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_7" id="__nav_5_7" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_7">
        子句和选项
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="子句和选项" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_7">
<span class="md-nav__icon md-icon"></span>
          子句和选项
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/group-by/">
        GROUP BY
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/limit/">
        LIMIT and SKIP
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/order-by/">
        ORDER BY
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/return/">
        RETURN
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/ttl-options/">
        TTL
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/where/">
        WHERE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/yield/">
        YIELD
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../8.clauses-and-options/with/">
        WITH
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_8" id="__nav_5_8" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_8">
        图空间语句
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="图空间语句" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_8">
<span class="md-nav__icon md-icon"></span>
          图空间语句
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/1.create-space/">
        CREATE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/2.use-space/">
        USE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/3.show-spaces/">
        SHOW SPACES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/4.describe-space/">
        DESCRIBE SPACE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../9.space-statements/5.drop-space/">
        DROP SPACE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_9" id="__nav_5_9" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_9">
        标签语句
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="标签语句" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_9">
<span class="md-nav__icon md-icon"></span>
          标签语句
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/1.create-tag/">
        CREATE TAG
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/2.drop-tag/">
        DROP TAGS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/3.alter-tag/">
        ALTER TAG
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/4.show-tags/">
        SHOW TAGS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../10.tag-statements/5.describe-tag/">
        DESCRIBE TAG
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_10" id="__nav_5_10" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_10">
        边类型语句
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="边类型语句" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_10">
<span class="md-nav__icon md-icon"></span>
          边类型语句
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/1.create-edge/">
        CREATE EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/2.drop-edge/">
        DROP EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/3.alter-edge/">
        ALTER EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/4.show-edges/">
        SHOW EDGES
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../11.edge-type-statements/5.describe-edge/">
        DESCRIBE EDGE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_11" id="__nav_5_11" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_11">
        点语句
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="点语句" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_11">
<span class="md-nav__icon md-icon"></span>
          点语句
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/1.insert-vertex/">
        INSERT VERTEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/4.delete-vertex/">
        DELETE VERTEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/2.update-vertex/">
        UPDATE VERTEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../12.vertex-statements/3.upsert-vertex/">
        UPSERT VERTEX
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_12" id="__nav_5_12" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_12">
        边语句
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="边语句" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_12">
<span class="md-nav__icon md-icon"></span>
          边语句
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/1.insert-edge/">
        INSERT EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/4.delete-edge/">
        DELETE EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/2.update-edge/">
        UPDATE EDGE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../13.edge-statements/3.upsert-edge/">
        UPSERT EDGE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_13" id="__nav_5_13" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_13">
        原生索引
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="原生索引" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_13">
<span class="md-nav__icon md-icon"></span>
          原生索引
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/">
        索引介绍
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/1.create-native-index/">
        CREATE INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/2.show-native-indexes/">
        SHOW INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/2.1.show-create-index/">
        SHOW CREATE INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/3.describe-native-index/">
        DESCRIBE INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/4.rebuild-native-index/">
        REBUILD INDEX
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/5.show-native-index-status/">
        SHOW INDEX STATUS
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/6.drop-native-index/">
        DROP INDEX
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_14" id="__nav_5_14" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_14">
        全文索引
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="全文索引" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_14">
<span class="md-nav__icon md-icon"></span>
          全文索引
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../14.native-index-statements/">
        索引介绍
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/1.text-based-index-restrictions/">
        全文索引限制
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy-es/">
        部署全文索引
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/6.deploy-text-based-index/3.deploy-listener/">
        部署Raft listener
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../15.full-text-index-statements/1.search-with-text-based-index/">
        全文搜索
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_15" id="__nav_5_15" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_15">
        子图和路径
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="子图和路径" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_15">
<span class="md-nav__icon md-icon"></span>
          子图和路径
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../16.subgraph-and-path/1.get-subgraph/">
        GET SUBGRAPH
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../16.subgraph-and-path/2.find-path/">
        FIND PATH
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_16" id="__nav_5_16" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_16">
        查询调优
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="查询调优" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_16">
<span class="md-nav__icon md-icon"></span>
          查询调优
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../17.query-tuning-statements/1.explain-and-profile/">
        EXPLAIN和PROFILE
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_5_17" id="__nav_5_17" type="checkbox"/>
<label class="md-nav__link" for="__nav_5_17">
        运维
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="运维" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_5_17">
<span class="md-nav__icon md-icon"></span>
          运维
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../18.operation-and-maintenance-statements/2.balance-syntax/">
        BALANCE
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../18.operation-and-maintenance-statements/4.job-statements/">
        作业管理
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6" id="__nav_6" type="checkbox"/>
<label class="md-nav__link" for="__nav_6">
        安装部署
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="安装部署" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_6">
<span class="md-nav__icon md-icon"></span>
          安装部署
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/1.resource-preparations/">
        准备资源
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_6_2" id="__nav_6_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_6_2">
        编译安装Nebula Graph
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="编译安装Nebula Graph" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_6_2">
<span class="md-nav__icon md-icon"></span>
          编译安装Nebula Graph
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/1.install-nebula-graph-by-compiling-the-source-code/">
        源码编译安装
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/2.install-nebula-graph-by-rpm-or-deb/">
        RPM/DEB包安装
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/deploy-nebula-graph-cluster/">
        部署Nebula Graph集群
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../4.deployment-and-installation/4.uninstall-nebula-graph/">
        卸载Nebula Graph
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_7" id="__nav_7" type="checkbox"/>
<label class="md-nav__link" for="__nav_7">
        配置和日志
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="配置和日志" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_7">
<span class="md-nav__icon md-icon"></span>
          配置和日志
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_7_1" id="__nav_7_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_7_1">
        配置
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="配置" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_7_1">
<span class="md-nav__icon md-icon"></span>
          配置
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/1.configurations/">
        配置简介
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/2.meta-config/">
        Meta服务配置
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/3.graph-config/">
        Graph服务配置
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/4.storage-config/">
        Storage服务配置
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/1.configurations/6.kernel-config/">
        内核配置
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_7_2" id="__nav_7_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_7_2">
        日志
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="日志" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_7_2">
<span class="md-nav__icon md-icon"></span>
          日志
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../5.configurations-and-logs/2.log-management/logs/">
        日志配置
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_8" id="__nav_8" type="checkbox"/>
<label class="md-nav__link" for="__nav_8">
        监控
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="监控" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_8">
<span class="md-nav__icon md-icon"></span>
          监控
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../6.monitor-and-metrics/1.query-performance-metrics/">
        查询Nebula Graph监控指标
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_9" id="__nav_9" type="checkbox"/>
<label class="md-nav__link" for="__nav_9">
        数据安全
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="数据安全" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_9">
<span class="md-nav__icon md-icon"></span>
          数据安全
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_9_1" id="__nav_9_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_9_1">
        验证和授权
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="验证和授权" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_9_1">
<span class="md-nav__icon md-icon"></span>
          验证和授权
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/1.authentication/">
        身份验证
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/2.management-user/">
        用户管理
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/1.authentication/3.role-list/">
        内置角色权限
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../7.data-security/3.manage-snapshot/">
        管理快照
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_10" id="__nav_10" type="checkbox"/>
<label class="md-nav__link" for="__nav_10">
        调整服务
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="调整服务" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_10">
<span class="md-nav__icon md-icon"></span>
          调整服务
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/compaction/">
        Compaction
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../8.service-tuning/load-balance/">
        Storage负载均衡
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11" id="__nav_11" type="checkbox"/>
<label class="md-nav__link" for="__nav_11">
        Nebula Graph Studio
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Graph Studio" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_11">
<span class="md-nav__icon md-icon"></span>
          Nebula Graph Studio
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_1" id="__nav_11_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_1">
        认识 Nebula Graph Studio
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="认识 Nebula Graph Studio" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_11_1">
<span class="md-nav__icon md-icon"></span>
          认识 Nebula Graph Studio
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-what-is-graph-studio/">
        什么是 Nebula Graph Studio
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-terms/">
        名词解释
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-limitations/">
        使用限制
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-check-updates/">
        版本更新
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/about-studio/st-ug-shortcuts/">
        快捷键
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_2" id="__nav_11_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_2">
        安装与登录
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="安装与登录" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_11_2">
<span class="md-nav__icon md-icon"></span>
          安装与登录
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/deploy-connect/st-ug-deploy/">
        部署 Studio
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/deploy-connect/st-ug-connect/">
        连接数据库
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/deploy-connect/st-ug-reset-connection/">
        清除连接
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_3" id="__nav_11_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_3">
        快速开始
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="快速开始" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_11_3">
<span class="md-nav__icon md-icon"></span>
          快速开始
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-plan-schema/">
        规划 Schema
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-create-schema/">
        创建 Schema
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-import-data/">
        导入数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/quick-start/st-ug-explore/">
        查询图数据
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_4" id="__nav_11_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_4">
        操作指南
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="操作指南" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_11_4">
<span class="md-nav__icon md-icon"></span>
          操作指南
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_4_1" id="__nav_11_4_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_4_1">
        管理 Schema
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="管理 Schema" class="md-nav" data-md-level="3">
<label class="md-nav__title" for="__nav_11_4_1">
<span class="md-nav__icon md-icon"></span>
          管理 Schema
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-space/">
        操作图空间
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-tag/">
        操作标签
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-edge-type/">
        操作边类型
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/manage-schema/st-ug-crud-index/">
        操作索引
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_4_2" id="__nav_11_4_2" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_4_2">
        使用控制台
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="使用控制台" class="md-nav" data-md-level="3">
<label class="md-nav__title" for="__nav_11_4_2">
<span class="md-nav__icon md-icon"></span>
          使用控制台
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/use-console/st-ug-console/">
        控制台界面
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/use-console/st-ug-open-in-explorer/">
        导入图探索
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/use-console/st-ug-visualize-findpath/">
        查看子图
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_11_5" id="__nav_11_5" type="checkbox"/>
<label class="md-nav__link" for="__nav_11_5">
        故障排查
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="故障排查" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_11_5">
<span class="md-nav__icon md-icon"></span>
          故障排查
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/troubleshooting/st-ug-config-server-errors/">
        连接数据库错误
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/troubleshooting/st-ug-connection-errors/">
        无法访问 Studio
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-studio/troubleshooting/st-ug-faq/">
        常见问题
      </a>
</li>
</ul>
</nav>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_12" id="__nav_12" type="checkbox"/>
<label class="md-nav__link" for="__nav_12">
        Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Exchange" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_12">
<span class="md-nav__icon md-icon"></span>
          Nebula Exchange
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_12_1" id="__nav_12_1" type="checkbox"/>
<label class="md-nav__link" for="__nav_12_1">
        认识Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="认识Nebula Exchange" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_12_1">
<span class="md-nav__icon md-icon"></span>
          认识Nebula Exchange
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/about-exchange/ex-ug-what-is-exchange/">
        什么是Nebula Exchange
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/about-exchange/ex-ug-limitations/">
        使用限制
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/ex-ug-compile/">
        编译Exchange
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_12_3" id="__nav_12_3" type="checkbox"/>
<label class="md-nav__link" for="__nav_12_3">
        参数说明
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="参数说明" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_12_3">
<span class="md-nav__icon md-icon"></span>
          参数说明
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/parameter-reference/ex-ug-para-import-command/">
        导入命令参数
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/parameter-reference/ex-ug-parameter/">
        配置参数
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_12_4" id="__nav_12_4" type="checkbox"/>
<label class="md-nav__link" for="__nav_12_4">
        使用Nebula Exchange
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="使用Nebula Exchange" class="md-nav" data-md-level="2">
<label class="md-nav__title" for="__nav_12_4">
<span class="md-nav__icon md-icon"></span>
          使用Nebula Exchange
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-csv/">
        导入CSV文件数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-json/">
        导入JSON文件数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-orc/">
        导入ORC文件数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-parquet/">
        导入Parquet文件数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-hbase/">
        导入HBase数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-mysql/">
        导入MySQL数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-neo4j/">
        导入Neo4j数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-hive/">
        导入Hive数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-pulsar/">
        导入Pulsar数据
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/use-exchange/ex-ug-import-from-kafka/">
        导入Kafka数据
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-exchange/ex-ug-FAQ/">
        常见问题FAQ
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_13" id="__nav_13" type="checkbox"/>
<label class="md-nav__link" for="__nav_13">
        Nebula Importer
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="Nebula Importer" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_13">
<span class="md-nav__icon md-icon"></span>
          Nebula Importer
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-importer/use-importer/">
        使用Nebula Importer
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-importer/config-with-header/">
        有表头配置说明
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-importer/config-without-header/">
        无表头配置说明
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-spark-connector/">
        Nebula Spark Connector
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-flink-connector/">
        Nebula Flink Connector
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../nebula-algorithm/">
        Nebula Algorithm
      </a>
</li>
<li class="md-nav__item md-nav__item--nested">
<input class="md-nav__toggle md-toggle" data-md-toggle="__nav_17" id="__nav_17" type="checkbox"/>
<label class="md-nav__link" for="__nav_17">
        附录
        <span class="md-nav__icon md-icon"></span>
</label>
<nav aria-label="附录" class="md-nav" data-md-level="1">
<label class="md-nav__title" for="__nav_17">
<span class="md-nav__icon md-icon"></span>
          附录
        </label>
<ul class="md-nav__list" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/0.FAQ/">
        常见问题
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/0.relates.md">
        相关技术
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/6.eco-tool-version/">
        生态工具概览
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/2.graph-modeling/">
        图建模
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/3.system-design/">
        系统建模
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/4.raft/">
        关于Raft的简单介绍
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/7.vid/">
        VID
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/5.partition/">
        分片ID
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/comments/">
        注释
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/identifier-case-sensitivity/">
        区分大小写
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/keywords-and-reserved-words/">
        关键字
      </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../20.appendix/9.history.md">
        年表
      </a>
</li>
</ul>
</nav>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="../../../pdf/NebulaGraph-CN.pdf">
        PDF
      </a>
</li>
</ul>
</nav>
</div>
</div>
</div>
<div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc">
<div class="md-sidebar__scrollwrap">
<div class="md-sidebar__inner">
<nav aria-label="目录" class="md-nav md-nav--secondary">
<label class="md-nav__title" for="__toc">
<span class="md-nav__icon md-icon"></span>
      目录
    </label>
<ul class="md-nav__list" data-md-component="toc" data-md-scrollfix="">
<li class="md-nav__item">
<a class="md-nav__link" href="#opencypher">
    openCypher兼容性
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_1">
    语法
  </a>
</li>
<li class="md-nav__item">
<a class="md-nav__link" href="#_2">
    示例
  </a>
</li>
</ul>
</nav>
</div>
</div>
</div>
<div class="md-content" data-md-component="content">
<article class="md-content__inner md-typeset">
<h1 id="go">GO<a class="headerlink" href="#go" title="Permanent link">¶</a></h1>
<p><code>GO</code>用指定的过滤条件遍历图，并返回结果。</p>
<h2 id="opencypher">openCypher兼容性<a class="headerlink" href="#opencypher" title="Permanent link">¶</a></h2>
<p>本文操作仅适用于原生nGQL。</p>
<h2 id="_1">语法<a class="headerlink" href="#_1" title="Permanent link">¶</a></h2>
<div class="highlight"><pre><span></span><code>GO [[&lt;M&gt; TO] &lt;N&gt; STEPS ] FROM &lt;vertex_list&gt;
OVER &lt;edge_type_list&gt; [{REVERSELY | BIDIRECT}]
[ WHERE &lt;conditions&gt; ]
[YIELD [DISTINCT] &lt;return_list&gt;]
[| ORDER BY &lt;expression&gt; [{ASC | DESC}]]
[| LIMIT [&lt;offset_value&gt;,] &lt;number_rows&gt;]

GO [[&lt;M&gt; TO] &lt;N&gt; STEPS ] FROM &lt;vertex_list&gt;
OVER &lt;edge_type_list&gt; [{REVERSELY | BIDIRECT}]
[ WHERE &lt;conditions&gt; ]
[| GROUP BY {col_name | expr | position} YIELD &lt;col_name&gt;]

&lt;vertex_list&gt; ::=
    &lt;vid&gt; [, &lt;vid&gt; ...]

&lt;edge_type_list&gt; ::=
   edge_type [, edge_type ...]
   | *

&lt;return_list&gt; ::=
    &lt;col_name&gt; [AS &lt;col_alias&gt;] [, &lt;col_name&gt; [AS &lt;col_alias&gt;] ...]
</code></pre></div>
<ul>
<li><code>&lt;N&gt; STEPS</code>：指定跳数。如果没有指定跳数，默认值<code>N</code>为<code>1</code>。如果<code>N</code>为<code>0</code>，Nebula Graph不会检索任何边。</li>
</ul>
<ul>
<li><code>M TO N STEPS</code>：遍历<code>M~N</code>跳的边。如果<code>M</code>为<code>0</code>，输出结果和<code>M</code>为<code>1</code>相同，即<code>GO 0 TO 2</code>和<code>GO 1 TO 2</code>是相同的。</li>
</ul>
<ul>
<li><code>&lt;vertex_list&gt;</code>：用逗号分隔的点ID列表，或特殊的引用符<code>$-.id</code>。详情请参见<a href="../../5.operators/4.pipe/">管道符</a>。</li>
</ul>
<ul>
<li><code>&lt;edge_type_list&gt;</code>：遍历的边类型列表。</li>
</ul>
<ul>
<li><code>REVERSELY | BIDIRECT</code>：默认情况下检索的是<code>&lt;vertex_list&gt;</code>的出边，<code>REVERSELY</code>表示反向，即检索入边，<code>BIDIRECT</code>表示双向，即检索出边和入边。</li>
</ul>
<ul>
<li>
<p><code>WHERE &lt;conditions&gt;</code>：指定遍历的过滤条件。用户可以在起始点、目的点和边使用<code>WHERE</code>子句，还可以结合<code>AND</code>、<code>OR</code>、<code>NOT</code>、<code>XOR</code>一起使用。详情请参见<a href="../../8.clauses-and-options/where/">WHERE</a>。</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>遍历多个边类型时，<code>WHERE</code>子句有一些限制。例如不支持<code>WHERE edge1.prop1 &gt; edge2.prop2</code>。</p>
</div>
</li>
</ul>
<ul>
<li><code>YIELD [DISTINCT] &lt;return_list&gt;</code>：指定输出结果。详情请参见<a href="../../8.clauses-and-options/yield/">YIELD</a>。如果没有指定，默认返回目的点ID。</li>
</ul>
<ul>
<li>
<p><code>ORDER BY</code>：指定输出结果的排序规则。详情请参见<a href="../../8.clauses-and-options/order-by/">ORDER BY</a>。</p>
<div class="admonition note">
<p class="admonition-title">Note</p>
<p>没有指定排序规则时，输出结果的顺序不是固定的。</p>
</div>
</li>
</ul>
<ul>
<li><code>LIMIT</code>：限制输出结果的行数。详情请参见<a href="../../8.clauses-and-options/limit/">LIMIT</a>。</li>
</ul>
<ul>
<li><code>GROUP BY</code>：根据指定属性的值将输出分组。详情请参见<a href="../../8.clauses-and-options/group-by/">GROUP BY</a>。</li>
</ul>
<h2 id="_2">示例<a class="headerlink" href="#_2" title="Permanent link">¶</a></h2>
<div class="highlight"><pre><span></span><code># 返回player102所属队伍。
nebula&gt; GO FROM "player102" OVER serve;
+------------+
| serve._dst |
+------------+
| "team203"  |
+------------+
| "team204"  |
+------------+
</code></pre></div>
<div class="highlight"><pre><span></span><code># 返回距离player102两跳的朋友。
nebula&gt; GO 2 STEPS FROM "player102" OVER follow;
+-------------+
| follow._dst |
+-------------+
| "player101" |
+-------------+
| "player125" |
+-------------+
...
</code></pre></div>
<div class="highlight"><pre><span></span><code># 添加过滤条件。
nebula&gt; GO FROM "player100", "player102" OVER serve \
        WHERE serve.start_year &gt; 1995 \
        YIELD DISTINCT $$.team.name AS team_name, serve.start_year AS start_year, $^.player.name AS player_name;
+-----------------+------------+---------------------+
| team_name       | start_year | player_name         |
+-----------------+------------+---------------------+
| "Spurs"         | 1997       | "Tim Duncan"        |
+-----------------+------------+---------------------+
| "Trail Blazers" | 2006       | "LaMarcus Aldridge" |
+-----------------+------------+---------------------+
| "Spurs"         | 2015       | "LaMarcus Aldridge" |
+-----------------+------------+---------------------+
</code></pre></div>
<div class="highlight"><pre><span></span><code># 遍历多个边类型。属性没有值时，会显示__EMPTY__。
nebula&gt; GO FROM "player100" OVER follow, serve \
        YIELD follow.degree, serve.start_year;
+---------------+------------------+
| follow.degree | serve.start_year |
+---------------+------------------+
| 95            | __EMPTY__        |
+---------------+------------------+
| 95            | __EMPTY__        |
+---------------+------------------+
| __EMPTY__     | 1997             |
+---------------+------------------+
</code></pre></div>
<div class="highlight"><pre><span></span><code># 返回player100的入边。
nebula&gt; GO FROM "player100" OVER follow REVERSELY \
        YIELD follow._dst AS destination;
+-------------+
| destination |
+-------------+
| "player101" |
+-------------+
| "player102" |
+-------------+
...

# 该MATCH查询与上一个GO查询具有相同的语义。
nebula&gt; MATCH (v)&lt;-[e:follow]- (v2) WHERE id(v) == 'player100' \
        RETURN id(v2) AS destination;
+-------------+
| destination |
+-------------+
| "player101" |
+-------------+
| "player102" |
+-------------+
...
</code></pre></div>
<div class="highlight"><pre><span></span><code># 查询player100的朋友和朋友所属队伍。
nebula&gt; GO FROM "player100" OVER follow REVERSELY \
        YIELD follow._dst AS id | \
        GO FROM $-.id OVER serve \
        WHERE $^.player.age &gt; 20 \
        YIELD $^.player.name AS FriendOf, $$.team.name AS Team;
+---------------------+-----------------+
| FriendOf            | Team            |
+---------------------+-----------------+
| "Tony Parker"       | "Spurs"         |
+---------------------+-----------------+
| "Tony Parker"       | "Hornets"       |
+---------------------+-----------------+
...

# 该MATCH查询与上一个GO查询具有相同的语义。
nebula&gt; MATCH (v)&lt;-[e:follow]- (v2)-[e2:serve]-&gt;(v3)  \
        WHERE id(v) == 'player100' \
        RETURN v2.name AS FriendOf, v3.name AS Team;
+---------------------+-----------------+
| FriendOf            | Team            |
+---------------------+-----------------+
| "Tony Parker"       | "Spurs"         |
+---------------------+-----------------+
| "Tony Parker"       | "Hornets"       |
+---------------------+-----------------+
...
</code></pre></div>
<div class="highlight"><pre><span></span><code># 返回player102的出边和入边。
nebula&gt; GO FROM "player102" OVER follow BIDIRECT \
        YIELD follow._dst AS both;
+-------------+
| both        |
+-------------+
| "player100" |
+-------------+
| "player101" |
+-------------+
...

# 该MATCH查询与上一个GO查询具有相同的语义。
nebula&gt; MATCH (v) -[e:follow]-(v2) \
        WHERE id(v)== "player102" \
        RETURN id(v2) AS both;
+-------------+
| both        |
+-------------+
| "player101" |
+-------------+
| "player103" |
+-------------+
...
</code></pre></div>
<div class="highlight"><pre><span></span><code># 查询player100 1~2跳内的朋友。
nebula&gt; GO 1 TO 2 STEPS FROM "player100" OVER follow \
        YIELD follow._dst AS destination;
+-------------+
| destination |
+-------------+
| "player101" |
+-------------+
| "player125" |
+-------------+
...

# 该MATCH查询与上一个GO查询具有相同的语义。
nebula&gt; MATCH (v) -[e:follow*1..2]-&gt;(v2) \
        WHERE id(v) == "player100" \
        RETURN id(v2) AS destination;
+-------------+
| destination |
+-------------+
| "player100" |
+-------------+
| "player102" |
+-------------+
</code></pre></div>
<div class="highlight"><pre><span></span><code># 根据年龄分组。
nebula&gt; GO 2 STEPS FROM "player100" OVER follow \
        YIELD follow._src AS src, follow._dst AS dst, $$.player.age AS age \
        | GROUP BY $-.dst \
        YIELD $-.dst AS dst, collect_set($-.src) AS src, collect($-.age) AS age
+-------------+----------------------------+----------+
| dst         | src                        | age      |
+-------------+----------------------------+----------+
| "player125" | ["player101"]              | [41]     |
+-------------+----------------------------+----------+
| "player100" | ["player125", "player101"] | [42, 42] |
+-------------+----------------------------+----------+
| "player102" | ["player101"]              | [33]     |
+-------------+----------------------------+----------+
</code></pre></div>
<div class="highlight"><pre><span></span><code># 分组并限制输出结果的行数。
nebula&gt; $a = GO FROM "player100" OVER follow YIELD follow._src AS src, follow._dst AS dst; \
        GO 2 STEPS FROM $a.dst OVER follow \
        YIELD $a.src AS src, $a.dst, follow._src, follow._dst \
        | ORDER BY $-.src | OFFSET 1 LIMIT 2;
+-------------+-------------+-------------+-------------+
| src         | $a.dst      | follow._src | follow._dst |
+-------------+-------------+-------------+-------------+
| "player100" | "player125" | "player100" | "player101" |
+-------------+-------------+-------------+-------------+
| "player100" | "player101" | "player100" | "player125" |
+-------------+-------------+-------------+-------------+
</code></pre></div>
<hr/>
<div class="md-source-date">
<small>
    
      最后更新: <span class="git-revision-date-localized-plugin git-revision-date-localized-plugin-date">2021年5月18日</span>
</small>
</div>
</article>
</div>
</div>
<a class="md-top md-icon" data-md-component="top" data-md-state="hidden" href="#" title="Back to top">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M13 20h-2V8l-5.5 5.5-1.42-1.42L12 4.16l7.92 7.92-1.42 1.42L13 8v12z"></path></svg>
</a>
</main>
<footer class="md-footer">
<nav aria-label="Footer" class="md-footer__inner md-grid">
<a class="md-footer__link md-footer__link--prev" href="../5.lookup/" rel="prev">
<div class="md-footer__button md-icon">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M20 11v2H8l5.5 5.5-1.42 1.42L4.16 12l7.92-7.92L13.5 5.5 8 11h12z"></path></svg>
</div>
<div class="md-footer__title">
<div class="md-ellipsis">
<span class="md-footer__direction">
                上一页
              </span>
              LOOKUP
            </div>
</div>
</a>
<a class="md-footer__link md-footer__link--next" href="../4.fetch/" rel="next">
<div class="md-footer__title">
<div class="md-ellipsis">
<span class="md-footer__direction">
                下一页
              </span>
              FETCH
            </div>
</div>
<div class="md-footer__button md-icon">
<svg viewbox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M4 11v2h12l-5.5 5.5 1.42 1.42L19.84 12l-7.92-7.92L10.5 5.5 16 11H4z"></path></svg>
</div>
</a>
</nav>
<div class="md-footer-meta md-typeset">
<div class="md-footer-meta__inner md-grid">
<div class="md-footer-copyright">
<div class="md-footer-copyright__highlight">
            Copyright © 2021 Nebula Graph - 浙ICP备20010487号
          </div>
        
        Made with
        <a href="https://squidfunk.github.io/mkdocs-material/" rel="noopener" target="_blank">
          Material for MkDocs
        </a>
 ... <a class="link--pdf-download" download href="../../../pdf/NebulaGraph-CN.pdf" title="PDF">download PDF</a></div>
<div class="md-footer-social">
<a class="md-footer-social__link" href="https://github.com/vesoft-inc/nebula-docs-cn" rel="noopener" target="_blank" title="github.com">
<svg viewbox="0 0 496 512" xmlns="http://www.w3.org/2000/svg"><path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"></path></svg>
</a>
</div>
</div>
</div>
</footer>
</div>
<div class="md-dialog" data-md-component="dialog">
<div class="md-dialog__inner md-typeset"></div>
</div>
<script id="__config" type="application/json">{"base": "../../..", "features": ["navigation.top"], "translations": {"clipboard.copy": "\u590d\u5236", "clipboard.copied": "\u5df2\u590d\u5236", "search.config.lang": "ja", "search.config.pipeline": "trimmer, stemmer", "search.config.separator": "[\\uff0c\\u3002]+", "search.placeholder": "\u641c\u7d22", "search.result.placeholder": "\u952e\u5165\u4ee5\u5f00\u59cb\u641c\u7d22", "search.result.none": "\u6ca1\u6709\u627e\u5230\u7b26\u5408\u6761\u4ef6\u7684\u7ed3\u679c", "search.result.one": "\u627e\u5230 1 \u4e2a\u7b26\u5408\u6761\u4ef6\u7684\u7ed3\u679c", "search.result.other": "# \u4e2a\u7b26\u5408\u6761\u4ef6\u7684\u7ed3\u679c", "search.result.more.one": "1 more on this page", "search.result.more.other": "# more on this page", "search.result.term.missing": "Missing"}, "search": "../../../assets/javascripts/workers/search.4fa0e4ee.min.js", "version": {"method": "mike"}}</script>
<script src="../../../assets/javascripts/bundle.1d3bfcf1.min.js"></script>
<script src="../../../js/version-select.js"></script>
<script src="../../../js/config.js"></script>
<script src="https://polyfill.io/v3/polyfill.min.js?features=es6"></script>
<script src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script>
</body>
</html>