# Nebula Graph查询语言（nGQL）

本文介绍Nebula Graph使用的查询语言nGQL（Nebula Graph Query Language）。

## 什么是nGQL

nGQL是Nebula Graph使用的的声明式图查询语言，支持灵活高效的[图模式](3.graph-patterns.md)，而且nGQL是为开发和运维人员设计的类SQL查询语言，易于学习。

## nGQL可以做什么

- 支持图遍历

- 支持模式匹配

- 支持聚合

- 支持修改图

- 支持访问控制

- 支持聚合查询

- 支持索引

- 支持大部分openCypher 9图查询语法（不支持修改和控制语法）

## 示例数据 Basketballplayer

用户可以下载Nebula Graph示例数据[basketballplayer文件](https://docs.nebula-graph.io/2.0/basketballplayer-2.X.ngql)，然后使用[Nebula Graph Console](../../2.quick-start/3.connect-to-nebula-graph.md)，使用选项`-f`执行脚本。

## 占位标识符和占位符值

Nebula Graph查询语言nGQL参照以下标准设计：

- ISO/IEC 10646

- ISO/IEC 39075

- ISO/IEC NP 39075 (Draft)

- OpenCypher 9

在模板代码中，任何非关键字、字面值或标点符号的标记都是占位符标识符或占位符值。

本文中 nGQL 语法符号的说明如下。

|  符号 | 含义  |
|  ----  | ----  |
| < >    | 语法元素的名称。 |
| ::=    | 定义元素的公式。 |
| [ ]    | 可选元素。 |
| { }    | 显示指定元素。 |
|  \|    | 所有可选的元素。 |
| ...    | 可以重复多次。 |

例如创建点或边的nGQL语法：

```ngql
CREATE {TAG | EDGE} {<tag_name> | <edge_type>}(<property_name> <data_type>
[, <property_name> <data_type> ...]);
```

示例语句：

```ngql
nebula> CREATE TAG player(name string, age int);
```

## 原生 nGQL 和 openCypher 的关系

`原生 nGQL` 是由 Nebula Graph 自行创造和实现的图查询语言。OpenCypher 是由 `openCypher Implementers Group` 组织所开源和维护的图查询语言，最新版本为 openCypher 9。由于 nGQL 语言部分兼容了 openCypher，这个部分在本文中称为 `OpenCypher 兼容语句`。

`nGQL 语言` = `原生 nGQL 语句` + `openCypher 兼容语句`

### nGQL 对于 openCypher 9 的兼容性

下面是 nGQL 和 openCypher 9的主要差异（由于设计原因而不兼容）。

|类别   | openCypher 9 | nGQL |
| :--- | :--- |:--- |
|Schema| 弱Schema | 强Schema |
|相等运算符| `=` |  `==` |
|数学求幂| `^` | 使用`pow(x, y)`替代`^` |  
|边rank| 无此概念 | 用`@rank`设置 |
|语句|-|不支持openCypher 9的所有DML语句（`CREATE`、`MERGE`等）和部分`MATCH`语句（不支持`OPTIONAL MATCH`也不支持多`MATCH`）。 |
|label与tag是不同的概念| label用于寻找点(点的索引) | tag用于定义点的一种类型及相应的属性，无索引功能 |

!!! Note

    请注意[openCypher 9](http://www.opencypher.org/)和[Cypher](https://neo4j.com/developer/cypher/)在语法和许可上有一些不同。例如Cypher要求所有Cypher语句必须显式地在一个事务中执行，而openCypher没有这样的要求。nGQL 不支持事务。

### 是否支持TinkerPop Gremlin？

不支持。

### 是否支持 W3C 的RDF（SPARQL） 或 GraphQL ？

不支持。

Nebula Graph的数据模型是属性图，是一个强Schema系统，不支持 RDF 标准。

nGQL 不支持 SPARQL 和 GraphQL。

### 找到更多nGQL的示例

用户可以在Nebula Graph GitHub的[features](https://github.com/vesoft-inc/nebula-graph/tree/master/tests/tck/features)目录内查看超过2500条nGQL示例。

features目录内包含很多.features格式的文件，每个文件都记录了使用nGQL的场景和示例。例如：

```text
Feature: Match seek by tag

  Background: Prepare space
    Given a graph with space named "basketballplayer"

  Scenario: seek by empty tag index
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid
      """
    Then the result should be, in any order:
      | vid          |
      | 'Tim Duncan' |
    And no side effects
    When executing query:
      """
      MATCH (v:bachelor)
      RETURN id(v) AS vid, v.age AS age
      """
    Then the result should be, in any order:
      | vid          | age |
      | 'Tim Duncan' | 42  |
    And no side effects
```

示例中的关键字说明如下。

|关键字|说明|
|:---|:---|
|`Feature`|描述当前文档的主题。|
|`Background`|描述当前文档的背景信息。|
|`Given`|描述执行示例语句的前提条件。|
|`Scenario`|描述具体场景。如果场景之前有`@skip`标识，表示这个场景下示例语句可能无法正常工作，请不要在生产环境中使用该示例语句。|
|`When`|描述要执行的nGQL示例语句。|
|`Then`|描述执行`When`内语句的预期返回结果。如果返回结果和文档不同，请提交[issue](https://github.com/vesoft-inc/nebula-graph/issues)通知Nebula Graph团队。|
|`And`|描述执行`When`内语句的副作用。|
| `@skip` | 跳过这个示例。通常表示测试代码还没有准备好。 |


