



<!doctype html>
<html lang="zh" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      <meta http-equiv="x-ua-compatible" content="ie=edge">
      
        <meta name="description" content="Documentation for Nebula Graph Database">
      
      
        <link rel="canonical" href="https://docs.nebula-graph.com.cn/3.ngql-guide/7.general-query-statements/2.match/">
      
      
        <meta name="author" content="Nebula Graph">
      
      
        <meta name="lang:clipboard.copy" content="复制">
      
        <meta name="lang:clipboard.copied" content="已复制">
      
        <meta name="lang:search.language" content="ja">
      
        <meta name="lang:search.pipeline.stopwords" content="True">
      
        <meta name="lang:search.pipeline.trimmer" content="True">
      
        <meta name="lang:search.result.none" content="没有找到符合条件的结果">
      
        <meta name="lang:search.result.one" content="找到 1 个符合条件的结果">
      
        <meta name="lang:search.result.other" content="# 个符合条件的结果">
      
        <meta name="lang:search.tokenizer" content="[\uff0c\u3002]+">
      
      <link rel="shortcut icon" href="../../../assets/images/favicon.ico">
      <meta name="generator" content="mkdocs-1.1.2, mkdocs-material-4.6.3">
    
    
      
        <title>Match - Nebula Graph Database 手册</title>
      
    
    
      <link rel="stylesheet" href="../../../assets/stylesheets/application.adb8469c.css">
      
        <link rel="stylesheet" href="../../../assets/stylesheets/application-palette.a8b3c06d.css">
      
      
        
        
        <meta name="theme-color" content="#3f51b5">
      
    
    
      <script src="../../../assets/javascripts/modernizr.86422ebf.js"></script>
    
    
      
        <link href="https://fonts.gstatic.com" rel="preconnect" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,400,400i,700%7CRoboto+Mono&display=fallback">
        <style>body,input{font-family:"Roboto","Helvetica Neue",Helvetica,Arial,sans-serif}code,kbd,pre{font-family:"Roboto Mono","Courier New",Courier,monospace}</style>
      
    
    <link rel="stylesheet" href="../../../assets/fonts/material-icons.css">
    
    
      <link rel="stylesheet" href="../../../stylesheets/logo.css">
    
      <link rel="stylesheet" href="../../../css/version-select.css">
    
    
      
    
    
  </head>
  
    
    
    <body dir="ltr" data-md-color-primary="indigo" data-md-color-accent="indigo">
  
    <svg class="md-svg">
      <defs>
        
        
          <svg xmlns="http://www.w3.org/2000/svg" width="416" height="448" viewBox="0 0 416 448" id="__github"><path fill="currentColor" d="M160 304q0 10-3.125 20.5t-10.75 19T128 352t-18.125-8.5-10.75-19T96 304t3.125-20.5 10.75-19T128 256t18.125 8.5 10.75 19T160 304zm160 0q0 10-3.125 20.5t-10.75 19T288 352t-18.125-8.5-10.75-19T256 304t3.125-20.5 10.75-19T288 256t18.125 8.5 10.75 19T320 304zm40 0q0-30-17.25-51T296 232q-10.25 0-48.75 5.25Q229.5 240 208 240t-39.25-2.75Q130.75 232 120 232q-29.5 0-46.75 21T56 304q0 22 8 38.375t20.25 25.75 30.5 15 35 7.375 37.25 1.75h42q20.5 0 37.25-1.75t35-7.375 30.5-15 20.25-25.75T360 304zm56-44q0 51.75-15.25 82.75-9.5 19.25-26.375 33.25t-35.25 21.5-42.5 11.875-42.875 5.5T212 416q-19.5 0-35.5-.75t-36.875-3.125-38.125-7.5-34.25-12.875T37 371.5t-21.5-28.75Q0 312 0 260q0-59.25 34-99-6.75-20.5-6.75-42.5 0-29 12.75-54.5 27 0 47.5 9.875t47.25 30.875Q171.5 96 212 96q37 0 70 8 26.25-20.5 46.75-30.25T376 64q12.75 25.5 12.75 54.5 0 21.75-6.75 42 34 40 34 99.5z"/></svg>
        
      </defs>
    </svg>
    <input class="md-toggle" data-md-toggle="drawer" type="checkbox" id="__drawer" autocomplete="off">
    <input class="md-toggle" data-md-toggle="search" type="checkbox" id="__search" autocomplete="off">
    <label class="md-overlay" data-md-component="overlay" for="__drawer"></label>
    
      <a href="#match" tabindex="0" class="md-skip">
        跳转至
      </a>
    
    
      <header class="md-header" data-md-component="header">
  <nav class="md-header-nav md-grid">
    <div class="md-flex">
      <div class="md-flex__cell md-flex__cell--shrink">
        <a href="https://docs.nebula-graph.com.cn/" title="Nebula Graph Database 手册" aria-label="Nebula Graph Database 手册" class="md-header-nav__button md-logo">
          
            <img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" width="24" height="24">
          
        </a>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        <label class="md-icon md-icon--menu md-header-nav__button" for="__drawer"></label>
      </div>
      <div class="md-flex__cell md-flex__cell--stretch">
        <div class="md-flex__ellipsis md-header-nav__title" data-md-component="title">
          
            <span class="md-header-nav__topic">
              Nebula Graph Database 手册
            </span>
            <span class="md-header-nav__topic">
              
                Match
              
            </span>
          
        </div>
      </div>
      <div class="md-flex__cell md-flex__cell--shrink">
        
          <label class="md-icon md-icon--search md-header-nav__button" for="__search"></label>
          
<div class="md-search" data-md-component="search" role="dialog">
  <label class="md-search__overlay" for="__search"></label>
  <div class="md-search__inner" role="search">
    <form class="md-search__form" name="search">
      <input type="text" class="md-search__input" aria-label="search" name="query" placeholder="搜索" autocapitalize="off" autocorrect="off" autocomplete="off" spellcheck="false" data-md-component="query" data-md-state="active">
      <label class="md-icon md-search__icon" for="__search"></label>
      <button type="reset" class="md-icon md-search__icon" data-md-component="reset" tabindex="-1">
        &#xE5CD;
      </button>
    </form>
    <div class="md-search__output">
      <div class="md-search__scrollwrap" data-md-scrollfix>
        <div class="md-search-result" data-md-component="result">
          <div class="md-search-result__meta">
            键入以开始搜索
          </div>
          <ol class="md-search-result__list"></ol>
        </div>
      </div>
    </div>
  </div>
</div>
        
      </div>
      
        <div class="md-flex__cell md-flex__cell--shrink">
          <div class="md-header-nav__source">
            


  

<a href="https://github.com/vesoft-inc/nebula" title="前往 Github 仓库" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
          </div>
        </div>
      
    </div>
  </nav>
</header>
    
    <div class="md-container">
      
        
      
      
      <main class="md-main" role="main">
        <div class="md-main__inner md-grid" data-md-component="container">
          
            
              <div class="md-sidebar md-sidebar--primary" data-md-component="navigation">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    <nav class="md-nav md-nav--primary" data-md-level="0">
  <label class="md-nav__title md-nav__title--site" for="__drawer">
    <a href="https://docs.nebula-graph.com.cn/" title="Nebula Graph Database 手册" class="md-nav__button md-logo">
      
        <img alt="logo" src="https://cloud-cdn.nebula-graph.com.cn/vesoft-nebula-logo-white.png" width="48" height="48">
      
    </a>
    Nebula Graph Database 手册
  </label>
  
    <div class="md-nav__source">
      


  

<a href="https://github.com/vesoft-inc/nebula" title="前往 Github 仓库" class="md-source" data-md-source="github">
  
    <div class="md-source__icon">
      <svg viewBox="0 0 24 24" width="24" height="24">
        <use xlink:href="#__github" width="24" height="24"></use>
      </svg>
    </div>
  
  <div class="md-source__repository">
    vesoft-inc/nebula
  </div>
</a>
    </div>
  
  <ul class="md-nav__list" data-md-scrollfix>
    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-1" type="checkbox" id="nav-1">
    
    <label class="md-nav__link" for="nav-1">
      Introduction
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-1">
        Introduction
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/1.what-is-nebula-graph/" title="What is Nebula Graph" class="md-nav__link">
      What is Nebula Graph
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/2.data-model/" title="Date model" class="md-nav__link">
      Date model
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-1-3" type="checkbox" id="nav-1-3">
    
    <label class="md-nav__link" for="nav-1-3">
      Nebula Graph architecture
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-1-3">
        Nebula Graph architecture
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/3.nebula-graph-architecture/1.architecture-overview/" title="Architecture overview" class="md-nav__link">
      Architecture overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/3.nebula-graph-architecture/2.meta-service/" title="Meta Service" class="md-nav__link">
      Meta Service
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/3.nebula-graph-architecture/3.graph-service/" title="Graph Service" class="md-nav__link">
      Graph Service
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../1.introduction/3.nebula-graph-architecture/4.storage-service/" title="Storage Service" class="md-nav__link">
      Storage Service
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-2" type="checkbox" id="nav-2">
    
    <label class="md-nav__link" for="nav-2">
      Quick start
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-2">
        Quick start
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/0.FAQ/" title="FAQ" class="md-nav__link">
      FAQ
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/1.quick-start-workflow/" title="Quick start workflow" class="md-nav__link">
      Quick start workflow
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/2.deploy-nebula-graph-with-docker-compose/" title="Deploy Nebula Graph with Docker Compose" class="md-nav__link">
      Deploy Nebula Graph with Docker Compose
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/5.start-stop-service/" title="Manage Nebula Graph services" class="md-nav__link">
      Manage Nebula Graph services
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/3.connect-to-nebula-graph/" title="Connect to Nebula Graph" class="md-nav__link">
      Connect to Nebula Graph
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/4.nebula-graph-crud/" title="Nebula Graph CRUD" class="md-nav__link">
      Nebula Graph CRUD
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../2.quick-start/6.useful-links/" title="Useful Links" class="md-nav__link">
      Useful Links
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3" type="checkbox" id="nav-3" checked>
    
    <label class="md-nav__link" for="nav-3">
      nGQL guide
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-3">
        nGQL guide
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-1" type="checkbox" id="nav-3-1">
    
    <label class="md-nav__link" for="nav-3-1">
      nGQL overview
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-1">
        nGQL overview
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.nGQL-overview/1.overview/" title="Overview" class="md-nav__link">
      Overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../1.nGQL-overview/3.graph-patterns/" title="Graph patterns" class="md-nav__link">
      Graph patterns
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-2" type="checkbox" id="nav-3-2">
    
    <label class="md-nav__link" for="nav-3-2">
      Data types
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-2">
        Data types
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/1.numeric/" title="Numeric" class="md-nav__link">
      Numeric
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/2.boolean/" title="Boolean" class="md-nav__link">
      Boolean
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/3.string/" title="String" class="md-nav__link">
      String
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/4.date-and-time/" title="Date and time" class="md-nav__link">
      Date and time
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/5.null/" title="NULL" class="md-nav__link">
      NULL
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/6.list/" title="List" class="md-nav__link">
      List
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/7.set/" title="Set" class="md-nav__link">
      Set
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/8.map/" title="Map" class="md-nav__link">
      Map
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../3.data-types/9.type-conversion/" title="Type conversion" class="md-nav__link">
      Type conversion
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-3" type="checkbox" id="nav-3-3">
    
    <label class="md-nav__link" for="nav-3-3">
      Variables and composite queries
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-3">
        Variables and composite queries
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.variable-and-composite-queries/1.composite-queries/" title="Composite queries" class="md-nav__link">
      Composite queries
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.variable-and-composite-queries/2.user-defined-variables/" title="User-defined variables" class="md-nav__link">
      User-defined variables
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../4.variable-and-composite-queries/3.property-reference/" title="Property reference" class="md-nav__link">
      Property reference
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-4" type="checkbox" id="nav-3-4">
    
    <label class="md-nav__link" for="nav-3-4">
      Operators
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-4">
        Operators
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/1.comparison/" title="Comparison" class="md-nav__link">
      Comparison
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/2.boolean/" title="Boolean" class="md-nav__link">
      Boolean
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/4.pipe/" title="Pipe" class="md-nav__link">
      Pipe
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/5.property-reference/" title="Property reference" class="md-nav__link">
      Property reference
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/6.set/" title="Set" class="md-nav__link">
      Set
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/7.string/" title="String" class="md-nav__link">
      String
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/8.list/" title="List" class="md-nav__link">
      List
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../5.operators/9.precedence/" title="Precedence" class="md-nav__link">
      Precedence
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-5" type="checkbox" id="nav-3-5">
    
    <label class="md-nav__link" for="nav-3-5">
      Functions and expressions
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-5">
        Functions and expressions
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/1.math/" title="Math functions" class="md-nav__link">
      Math functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/2.string/" title="String functions" class="md-nav__link">
      String functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/3.date-and-time/" title="Date and time functions" class="md-nav__link">
      Date and time functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/4.schema/" title="Schema functions" class="md-nav__link">
      Schema functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/5.case-expressions/" title="Case expressions" class="md-nav__link">
      Case expressions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/6.list/" title="List functions" class="md-nav__link">
      List functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/7.count/" title="count()" class="md-nav__link">
      count()
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/10.collect/" title="collect()" class="md-nav__link">
      collect()
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/11.reduce/" title="reduce()" class="md-nav__link">
      reduce()
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/12.hash/" title="hash()" class="md-nav__link">
      hash()
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/8.predicate/" title="Predicate functions" class="md-nav__link">
      Predicate functions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../6.functions-and-expressions/9.user-defined-functions/" title="User-defined functions" class="md-nav__link">
      User-defined functions
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          

  


  <li class="md-nav__item md-nav__item--active md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-6" type="checkbox" id="nav-3-6" checked>
    
    <label class="md-nav__link" for="nav-3-6">
      General queries statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-6">
        General queries statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          

  


  <li class="md-nav__item md-nav__item--active">
    
    <input class="md-toggle md-nav__toggle" data-md-toggle="toc" type="checkbox" id="__toc">
    
      
    
    
      <label class="md-nav__link md-nav__link--active" for="__toc">
        Match
      </label>
    
    <a href="./" title="Match" class="md-nav__link md-nav__link--active">
      Match
    </a>
    
      
<nav class="md-nav md-nav--secondary">
  
  
    
  
  
    <label class="md-nav__title" for="__toc">目录</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#_1" class="md-nav__link">
    语法
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#match_1" class="md-nav__link">
    MATCH工作流程
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#opencypher" class="md-nav__link">
    openCypher兼容性
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#pattern" class="md-nav__link">
    使用模式（pattern）
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" class="md-nav__link">
    前提条件
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_3" class="md-nav__link">
    匹配点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_4" class="md-nav__link">
    匹配标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_5" class="md-nav__link">
    匹配点的属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id" class="md-nav__link">
    匹配点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_6" class="md-nav__link">
    匹配连接的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_7" class="md-nav__link">
    匹配路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_8" class="md-nav__link">
    匹配边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_9" class="md-nav__link">
    匹配边类型和属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_10" class="md-nav__link">
    匹配多个边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_11" class="md-nav__link">
    匹配多条边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_12" class="md-nav__link">
    匹配定长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_13" class="md-nav__link">
    匹配变长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_14" class="md-nav__link">
    匹配多个边类型的变长路径
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_15" class="md-nav__link">
    常用检索操作
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_16" class="md-nav__link">
    检索点或边的信息
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id_1" class="md-nav__link">
    检索点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_17" class="md-nav__link">
    检索标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_18" class="md-nav__link">
    检索点或边的单个属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_19" class="md-nav__link">
    检索点或边的所有属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_20" class="md-nav__link">
    检索边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_21" class="md-nav__link">
    检索路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_22" class="md-nav__link">
    检索路径中的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_23" class="md-nav__link">
    检索路径中的边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_24" class="md-nav__link">
    检索路径长度
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
    
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../5.lookup/" title="LOOKUP" class="md-nav__link">
      LOOKUP
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../3.go/" title="GO" class="md-nav__link">
      GO
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../4.fetch/" title="FETCH" class="md-nav__link">
      FETCH
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-6-5" type="checkbox" id="nav-3-6-5">
    
    <label class="md-nav__link" for="nav-3-6-5">
      SHOW
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-3-6-5">
        SHOW
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/1.show-charset/" title="SHOW CHARSET" class="md-nav__link">
      SHOW CHARSET
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/2.show-collation/" title="SHOW COLLATION" class="md-nav__link">
      SHOW COLLATION
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/4.show-create-space/" title="SHOW CREATE SPACE" class="md-nav__link">
      SHOW CREATE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/5.show-create-tags-edges/" title="SHOW CREATE TAGS/EDGES" class="md-nav__link">
      SHOW CREATE TAGS/EDGES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/6.show-hosts/" title="SHOW HOSTS" class="md-nav__link">
      SHOW HOSTS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/7.show-index-status/" title="SHOW INDEX STATUS" class="md-nav__link">
      SHOW INDEX STATUS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/8.show-indexes/" title="SHOW INDEXES" class="md-nav__link">
      SHOW INDEXES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/9.show-parts/" title="SHOW PARTS" class="md-nav__link">
      SHOW PARTS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/10.show-roles/" title="SHOW ROLES" class="md-nav__link">
      SHOW ROLES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/11.show-snapshots/" title="SHOW SNAPSHOTS" class="md-nav__link">
      SHOW SNAPSHOTS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/12.show-spaces/" title="SHOW SPACES" class="md-nav__link">
      SHOW SPACES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/14.show-stats/" title="SHOW STATS" class="md-nav__link">
      SHOW STATS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/15.show-tags-edges/" title="SHOW TAGS/EDGES" class="md-nav__link">
      SHOW TAGS/EDGES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../6.show/16.show-users/" title="SHOW USERS" class="md-nav__link">
      SHOW USERS
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-7" type="checkbox" id="nav-3-7">
    
    <label class="md-nav__link" for="nav-3-7">
      Clauses and options
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-7">
        Clauses and options
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/group-by/" title="GROUP BY" class="md-nav__link">
      GROUP BY
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/limit/" title="LIMIT and SKIP" class="md-nav__link">
      LIMIT and SKIP
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/order-by/" title="ORDER BY" class="md-nav__link">
      ORDER BY
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/return/" title="RETURN" class="md-nav__link">
      RETURN
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/ttl-options/" title="TTL" class="md-nav__link">
      TTL
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/where/" title="WHERE" class="md-nav__link">
      WHERE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../8.clauses-and-options/yield/" title="YIELD" class="md-nav__link">
      YIELD
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-8" type="checkbox" id="nav-3-8">
    
    <label class="md-nav__link" for="nav-3-8">
      Space statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-8">
        Space statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements/1.create-space/" title="CREATE SPACE" class="md-nav__link">
      CREATE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements/2.use-space/" title="USE SPACE" class="md-nav__link">
      USE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements/3.show-spaces/" title="SHOW SPACES" class="md-nav__link">
      SHOW SPACES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements/4.describe-space/" title="DESCRIBE SPACE" class="md-nav__link">
      DESCRIBE SPACE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../9.space-statements/5.drop-space/" title="DROP SPACE" class="md-nav__link">
      DROP SPACE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-9" type="checkbox" id="nav-3-9">
    
    <label class="md-nav__link" for="nav-3-9">
      Tag statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-9">
        Tag statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../10.tag-statements/1.create-tag/" title="CREATE TAG" class="md-nav__link">
      CREATE TAG
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../10.tag-statements/2.drop-tag/" title="DROP TAGS" class="md-nav__link">
      DROP TAGS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../10.tag-statements/3.alter-tag/" title="ALTER TAG" class="md-nav__link">
      ALTER TAG
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../10.tag-statements/4.show-tags/" title="SHOW TAGS" class="md-nav__link">
      SHOW TAGS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../10.tag-statements/5.describe-tag/" title="DESCRIBE TAG" class="md-nav__link">
      DESCRIBE TAG
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-10" type="checkbox" id="nav-3-10">
    
    <label class="md-nav__link" for="nav-3-10">
      Edge type statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-10">
        Edge type statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../11.edge-type-statements/1.create-edge/" title="CREATE EDGE" class="md-nav__link">
      CREATE EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../11.edge-type-statements/2.drop-edge/" title="DROP EDGE" class="md-nav__link">
      DROP EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../11.edge-type-statements/3.alter-edge/" title="ALTER EDGE" class="md-nav__link">
      ALTER EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../11.edge-type-statements/4.show-edges/" title="SHOW EDGES" class="md-nav__link">
      SHOW EDGES
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../11.edge-type-statements/5.describe-edge/" title="DESCRIBE EDGE" class="md-nav__link">
      DESCRIBE EDGE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-11" type="checkbox" id="nav-3-11">
    
    <label class="md-nav__link" for="nav-3-11">
      Vertex statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-11">
        Vertex statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/1.insert-vertex/" title="INSERT VERTEX" class="md-nav__link">
      INSERT VERTEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/4.delete-vertex/" title="DELETE VERTEX" class="md-nav__link">
      DELETE VERTEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/2.update-vertex/" title="UPDATE VERTEX" class="md-nav__link">
      UPDATE VERTEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../12.vertex-statements/3.upsert-vertex/" title="UPSERT VERTEX" class="md-nav__link">
      UPSERT VERTEX
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-12" type="checkbox" id="nav-3-12">
    
    <label class="md-nav__link" for="nav-3-12">
      Edge statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-12">
        Edge statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/1.insert-edge/" title="INSERT EDGE" class="md-nav__link">
      INSERT EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/4.delete-edge/" title="DELETE EDGE" class="md-nav__link">
      DELETE EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/2.update-edge/" title="UPDATE EDGE" class="md-nav__link">
      UPDATE EDGE
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../13.edge-statements/3.upsert-edge/" title="UPSERT EDGE" class="md-nav__link">
      UPSERT EDGE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-13" type="checkbox" id="nav-3-13">
    
    <label class="md-nav__link" for="nav-3-13">
      Native index statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-13">
        Native index statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/" title="Index overview" class="md-nav__link">
      Index overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/1.create-native-index/" title="CREATE INDEX" class="md-nav__link">
      CREATE INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/2.show-native-indexes/" title="SHOW INDEX" class="md-nav__link">
      SHOW INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/2.1.show-create-index/" title="SHOW CREATE INDEX" class="md-nav__link">
      SHOW CREATE INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/3.describe-native-index/" title="DESCRIBE INDEX" class="md-nav__link">
      DESCRIBE INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/4.rebuild-native-index/" title="REBUILD INDEX" class="md-nav__link">
      REBUILD INDEX
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/5.show-native-index-status/" title="SHOW INDEX STATUS" class="md-nav__link">
      SHOW INDEX STATUS
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/6.drop-native-index/" title="DROP INDEX" class="md-nav__link">
      DROP INDEX
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-14" type="checkbox" id="nav-3-14">
    
    <label class="md-nav__link" for="nav-3-14">
      Full-text index statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-14">
        Full-text index statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../14.native-index-statements/" title="Index overview" class="md-nav__link">
      Index overview
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/1.text-based-index-restrictions/" title="Full-text restrictions" class="md-nav__link">
      Full-text restrictions
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/2.deploy-es/" title="Deploy Elasticsearch cluster" class="md-nav__link">
      Deploy Elasticsearch cluster
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/6.deploy-text-based-index/3.deploy-listener/" title="Deploy Raft Listener cluster" class="md-nav__link">
      Deploy Raft Listener cluster
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../15.full-text-index-statements/1.search-with-text-based-index/" title="Search with full-text index" class="md-nav__link">
      Search with full-text index
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-15" type="checkbox" id="nav-3-15">
    
    <label class="md-nav__link" for="nav-3-15">
      Subgraph and path
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-15">
        Subgraph and path
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../16.subgraph-and-path/1.get-subgraph/" title="GET SUBGRAPH" class="md-nav__link">
      GET SUBGRAPH
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../16.subgraph-and-path/2.find-path/" title="FIND PATH" class="md-nav__link">
      FIND PATH
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-16" type="checkbox" id="nav-3-16">
    
    <label class="md-nav__link" for="nav-3-16">
      Query tuning statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-16">
        Query tuning statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../17.query-tuning-statements/1.explain-and-profile/" title="EXPLAIN and PROFILE" class="md-nav__link">
      EXPLAIN and PROFILE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-17" type="checkbox" id="nav-3-17">
    
    <label class="md-nav__link" for="nav-3-17">
      Operation and maintenance statements
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-17">
        Operation and maintenance statements
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../18.operation-and-maintenance-statements/4.job-statements/" title="Job statements" class="md-nav__link">
      Job statements
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-3-18" type="checkbox" id="nav-3-18">
    
    <label class="md-nav__link" for="nav-3-18">
      Appendix
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-3-18">
        Appendix
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../20.appendix/comments/" title="Comments" class="md-nav__link">
      Comments
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../20.appendix/identifier-case-sensitivity/" title="Identifier Case Sensitivity" class="md-nav__link">
      Identifier Case Sensitivity
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../20.appendix/keywords-and-reserved-words/" title="Keywords and reserved words" class="md-nav__link">
      Keywords and reserved words
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../20.appendix/vid-partition/" title="VID and Partition" class="md-nav__link">
      VID and Partition
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4" type="checkbox" id="nav-4">
    
    <label class="md-nav__link" for="nav-4">
      Deployment and installation
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-4">
        Deployment and installation
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/1.resource-preparations/" title="Resource preparations" class="md-nav__link">
      Resource preparations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-4-2" type="checkbox" id="nav-4-2">
    
    <label class="md-nav__link" for="nav-4-2">
      Compile and install Nebula Graph
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-4-2">
        Compile and install Nebula Graph
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/1.install-nebula-graph-by-compiling-the-source-code/" title="Install Nebula Graph by compiling the source code" class="md-nav__link">
      Install Nebula Graph by compiling the source code
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/2.compile-and-install-nebula-graph/2.install-nebula-graph-by-rpm-or-deb/" title="Install Nebula Graph with RPM or DEB package" class="md-nav__link">
      Install Nebula Graph with RPM or DEB package
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/deploy-nebula-graph-cluster/" title="Deploy Nebula Graph cluster" class="md-nav__link">
      Deploy Nebula Graph cluster
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../4.deployment-and-installation/3.upgrade-nebula-graph/" title="Upgrade Nebula Graph" class="md-nav__link">
      Upgrade Nebula Graph
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5" type="checkbox" id="nav-5">
    
    <label class="md-nav__link" for="nav-5">
      Configurations and logs
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-5">
        Configurations and logs
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-1" type="checkbox" id="nav-5-1">
    
    <label class="md-nav__link" for="nav-5-1">
      Configurations
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-5-1">
        Configurations
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../5.configurations-and-logs/1.configurations/1.configurations/" title="Configurations" class="md-nav__link">
      Configurations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../5.configurations-and-logs/1.configurations/2.meta-config/" title="Meta Service configurations" class="md-nav__link">
      Meta Service configurations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../5.configurations-and-logs/1.configurations/3.graph-config/" title="Graph Service configurations" class="md-nav__link">
      Graph Service configurations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../5.configurations-and-logs/1.configurations/4.storage-config/" title="Storage Service configurations" class="md-nav__link">
      Storage Service configurations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../5.configurations-and-logs/1.configurations/6.kernel-config/" title="Kernel configurations" class="md-nav__link">
      Kernel configurations
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-5-2" type="checkbox" id="nav-5-2">
    
    <label class="md-nav__link" for="nav-5-2">
      Log management
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-5-2">
        Log management
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../5.configurations-and-logs/2.log-management/logs/" title="Logs" class="md-nav__link">
      Logs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-6" type="checkbox" id="nav-6">
    
    <label class="md-nav__link" for="nav-6">
      Monitor and metrics
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-6">
        Monitor and metrics
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../6.monitor-and-metrics/1.query-performance-metrics/" title="Query Nebula Graph metrics" class="md-nav__link">
      Query Nebula Graph metrics
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-7" type="checkbox" id="nav-7">
    
    <label class="md-nav__link" for="nav-7">
      Data security
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-7">
        Data security
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-7-1" type="checkbox" id="nav-7-1">
    
    <label class="md-nav__link" for="nav-7-1">
      Authentication and authorization
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-7-1">
        Authentication and authorization
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/1.authentication/1.authentication/" title="Authentication" class="md-nav__link">
      Authentication
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/1.authentication/2.management-user/" title="User management" class="md-nav__link">
      User management
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/1.authentication/3.role-list/" title="Roles and privileges" class="md-nav__link">
      Roles and privileges
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-7-2" type="checkbox" id="nav-7-2">
    
    <label class="md-nav__link" for="nav-7-2">
      Backup & Restore
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-7-2">
        Backup & Restore
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/2.backup-restore/1.what-is-br/" title="What is Backup & Restore" class="md-nav__link">
      What is Backup & Restore
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/2.backup-restore/2.compile-br.md" title="Compile BR" class="md-nav__link">
      Compile BR
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/2.backup-restore/3.br-backup-data/" title="Use BR to back up data" class="md-nav__link">
      Use BR to back up data
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/2.backup-restore/4.br-restore-data/" title="Use BR to restore data" class="md-nav__link">
      Use BR to restore data
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../7.data-security/3.manage-snapshot/" title="Manage snapshots" class="md-nav__link">
      Manage snapshots
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-8" type="checkbox" id="nav-8">
    
    <label class="md-nav__link" for="nav-8">
      Service Tuning
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-8">
        Service Tuning
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../8.service-tuning/compaction/" title="Compaction" class="md-nav__link">
      Compaction
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../8.service-tuning/load-balance/" title="Storage load balance" class="md-nav__link">
      Storage load balance
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-9" type="checkbox" id="nav-9">
    
    <label class="md-nav__link" for="nav-9">
      Data migration
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-9">
        Data migration
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-9-1" type="checkbox" id="nav-9-1">
    
    <label class="md-nav__link" for="nav-9-1">
      Nebula Exchange
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-9-1">
        Nebula Exchange
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-9-1-1" type="checkbox" id="nav-9-1-1">
    
    <label class="md-nav__link" for="nav-9-1-1">
      About Nebula Exchange
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-9-1-1">
        About Nebula Exchange
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/about-exchange/ex-ug-what-is-exchange.md" title="What is Nebula Exchange" class="md-nav__link">
      What is Nebula Exchange
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/about-exchange/ex-ug-limitations.md" title="Limitations" class="md-nav__link">
      Limitations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/about-exchange/ex-ug-terms.md" title="Glossary" class="md-nav__link">
      Glossary
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/about-exchange/ex-ug-faq.md" title="FAQ" class="md-nav__link">
      FAQ
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/ex-ug-compile.md" title="Compile Exchange" class="md-nav__link">
      Compile Exchange
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-9-1-3" type="checkbox" id="nav-9-1-3">
    
    <label class="md-nav__link" for="nav-9-1-3">
      Examples
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-9-1-3">
        Examples
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/use-exchange/ex-ug-import-steps.md" title="Use Exchange" class="md-nav__link">
      Use Exchange
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/use-exchange/ex-ug-import-from-csv.md" title="Import data from CSV files" class="md-nav__link">
      Import data from CSV files
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/use-exchange/ex-ug-import-json.md" title="Import data from JSON files" class="md-nav__link">
      Import data from JSON files
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/use-exchange/ex-ug-import-hive.md" title="Import data from HIVE" class="md-nav__link">
      Import data from HIVE
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-9-1-4" type="checkbox" id="nav-9-1-4">
    
    <label class="md-nav__link" for="nav-9-1-4">
      Parameter reference
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-9-1-4">
        Parameter reference
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/parameter-reference/ex-ug-paras-spark.md" title="Spark related parameters" class="md-nav__link">
      Spark related parameters
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/parameter-reference/ex-ug-paras-nebulagraph.md" title="Nebula Graph related parameters" class="md-nav__link">
      Nebula Graph related parameters
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-exchange/parameter-reference/ex-ug-para-import-command.md" title="Import command parameters" class="md-nav__link">
      Import command parameters
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-10" type="checkbox" id="nav-10">
    
    <label class="md-nav__link" for="nav-10">
      Nebula Graph Studio
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-10">
        Nebula Graph Studio
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-10-1" type="checkbox" id="nav-10-1">
    
    <label class="md-nav__link" for="nav-10-1">
      About Nebula Graph Studio
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-10-1">
        About Nebula Graph Studio
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/about-studio/st-ug-what-is-graph-studio.md" title="What is Studio" class="md-nav__link">
      What is Studio
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/about-studio/st-ug-limitations.md" title="Limitations" class="md-nav__link">
      Limitations
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/about-studio/st-ug-check-updates.md" title="Check updates" class="md-nav__link">
      Check updates
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-10-2" type="checkbox" id="nav-10-2">
    
    <label class="md-nav__link" for="nav-10-2">
      Deploy and connect
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-10-2">
        Deploy and connect
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/install-configure/st-ug-deploy.md" title="Deploy Studio" class="md-nav__link">
      Deploy Studio
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/install-configure/st-ug-connect.md" title="Connect to Nebula Graph" class="md-nav__link">
      Connect to Nebula Graph
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-10-3" type="checkbox" id="nav-10-3">
    
    <label class="md-nav__link" for="nav-10-3">
      Quick start
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-10-3">
        Quick start
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/quick-start/st-ug-plan-schema.md" title="Design a schema" class="md-nav__link">
      Design a schema
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/quick-start/st-ug-prepare-csv.md" title="Prepare CSV files" class="md-nav__link">
      Prepare CSV files
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/quick-start/st-ug-create-schema.md" title="Create a schema" class="md-nav__link">
      Create a schema
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/quick-start/st-ug-import-data.md" title="Import data" class="md-nav__link">
      Import data
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/quick-start/st-ug-explore.md" title="Query graph data" class="md-nav__link">
      Query graph data
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-10-4" type="checkbox" id="nav-10-4">
    
    <label class="md-nav__link" for="nav-10-4">
      Operation guide
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="2">
      <label class="md-nav__title" for="nav-10-4">
        Operation guide
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-10-4-1" type="checkbox" id="nav-10-4-1">
    
    <label class="md-nav__link" for="nav-10-4-1">
      Use Console
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="3">
      <label class="md-nav__title" for="nav-10-4-1">
        Use Console
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/use-console/st-ug-open-in-explore.md" title="Open in Explore" class="md-nav__link">
      Open in Explore
    </a>
  </li>

        
          
          
          


  <li class="md-nav__item">
    <a href="../../../nebula-studio/use-console/st-ug-visualize-subgraph.md" title="View subgraphs" class="md-nav__link">
      View subgraphs
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

        
      </ul>
    </nav>
  </li>

    
      
      
      


  <li class="md-nav__item md-nav__item--nested">
    
      <input class="md-toggle md-nav__toggle" data-md-toggle="nav-11" type="checkbox" id="nav-11">
    
    <label class="md-nav__link" for="nav-11">
      English
    </label>
    <nav class="md-nav" data-md-component="collapsible" data-md-level="1">
      <label class="md-nav__title" for="nav-11">
        English
      </label>
      <ul class="md-nav__list" data-md-scrollfix>
        
        
          
          
          


  <li class="md-nav__item">
    <a href="https://docs.nebula-graph.io/" title="None" class="md-nav__link">
      None
    </a>
  </li>

        
      </ul>
    </nav>
  </li>

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              <div class="md-sidebar md-sidebar--secondary" data-md-component="toc">
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    
<nav class="md-nav md-nav--secondary">
  
  
    
  
  
    <label class="md-nav__title" for="__toc">目录</label>
    <ul class="md-nav__list" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#_1" class="md-nav__link">
    语法
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#match_1" class="md-nav__link">
    MATCH工作流程
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#opencypher" class="md-nav__link">
    openCypher兼容性
  </a>
  
</li>
      
        <li class="md-nav__item">
  <a href="#pattern" class="md-nav__link">
    使用模式（pattern）
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" class="md-nav__link">
    前提条件
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_3" class="md-nav__link">
    匹配点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_4" class="md-nav__link">
    匹配标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_5" class="md-nav__link">
    匹配点的属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id" class="md-nav__link">
    匹配点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_6" class="md-nav__link">
    匹配连接的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_7" class="md-nav__link">
    匹配路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_8" class="md-nav__link">
    匹配边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_9" class="md-nav__link">
    匹配边类型和属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_10" class="md-nav__link">
    匹配多个边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_11" class="md-nav__link">
    匹配多条边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_12" class="md-nav__link">
    匹配定长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_13" class="md-nav__link">
    匹配变长路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_14" class="md-nav__link">
    匹配多个边类型的变长路径
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#_15" class="md-nav__link">
    常用检索操作
  </a>
  
    <nav class="md-nav">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_16" class="md-nav__link">
    检索点或边的信息
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#id_1" class="md-nav__link">
    检索点ID
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_17" class="md-nav__link">
    检索标签
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_18" class="md-nav__link">
    检索点或边的单个属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_19" class="md-nav__link">
    检索点或边的所有属性
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_20" class="md-nav__link">
    检索边类型
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_21" class="md-nav__link">
    检索路径
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_22" class="md-nav__link">
    检索路径中的点
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_23" class="md-nav__link">
    检索路径中的边
  </a>
  
</li>
        
          <li class="md-nav__item">
  <a href="#_24" class="md-nav__link">
    检索路径长度
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
      
      
      
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          <div class="md-content">
            <article class="md-content__inner md-typeset">
              
                
                
                <h1 id="match">MATCH<a class="headerlink" href="#match" title="Permanent link">&para;</a></h1>
<p><code>MATCH</code>语句提供基于模式（pattern）匹配的搜索功能。</p>
<p>一个<code>MATCH</code>语句定义了一个<a href="../../1.nGQL-overview/3.graph-patterns/">搜索模式</a>，用该模式匹配存储在Nebula Graph中的数据，然后用<code>RETURN</code>子句检索数据。</p>
<p>本文示例使用测试数据库<code>nba</code>进行演示。</p>
<h2 id="_1">语法<a class="headerlink" href="#_1" title="Permanent link">&para;</a></h2>
<p>与<code>GO</code>或<code>LOOKUP</code>等其他查询语句相比，<code>MATCH</code>的语法更灵活。<code>MATCH</code>语法可以概括如下：</p>
<div class="highlight"><pre><span></span><code>MATCH &lt;pattern&gt; [&lt;WHERE clause&gt;] RETURN &lt;output&gt;
</code></pre></div>
<h2 id="match_1">MATCH工作流程<a class="headerlink" href="#match_1" title="Permanent link">&para;</a></h2>
<ol>
<li>
<p><code>MATCH</code>语句使用原生索引查找起始点，起始点可以在模式的任何位置。即一个有效的<code>MATCH</code>语句，<strong>必须有一个属性、标签或者点已经创建索引</strong>。如何创建索引，请参见<a href="../../14.native-index-statements/1.create-native-index/">创建原生索引</a>。</p>
</li>
<li>
<p><code>MATCH</code>语句在模式中搜索，寻找匹配的边或点。</p>
</li>
<li>
<p><code>MATCH</code>语句根据<code>RETURN</code>子句检索数据。</p>
</li>
</ol>
<h2 id="opencypher">openCypher兼容性<a class="headerlink" href="#opencypher" title="Permanent link">&para;</a></h2>
<p>nGQL暂不支持遍历所有点和边，例如<code>MATCH (v) RETURN v</code>。</p>
<h2 id="pattern">使用模式（pattern）<a class="headerlink" href="#pattern" title="Permanent link">&para;</a></h2>
<h3 id="_2">前提条件<a class="headerlink" href="#_2" title="Permanent link">&para;</a></h3>
<p>请确保<code>MATCH</code>语句有至少一个索引可用。如果您需要创建索引，但是已经有相关的点、边或属性，您必须在创建索引后重建索引，索引才能生效。</p>
<blockquote>
<p><strong>警告</strong>：正确使用索引可以加快查询速度，但是索引会导致写性能大幅降低（降低90%甚至更多）。请<strong>不要随意</strong>在生产环境中使用索引，除非您很清楚使用索引对业务的影响。</p>
</blockquote>
<div class="highlight"><pre><span></span><code># 在属性name上创建索引。
nebula&gt; CREATE TAG INDEX name ON player(name(20)); 

# 重建索引使其生效。
nebula&gt; REBUILD TAG INDEX name; 
+------------+
| New Job Id |
+------------+
| 121        |
+------------+

# 确认重建索引成功。
nebula&gt; SHOW JOB 121; 
+----------------+---------------------+------------+------------+------------+
| Job Id(TaskId) | Command(Dest)       | Status     | Start Time | Stop Time  |
+----------------+---------------------+------------+------------+------------+
| 121            | &quot;REBUILD_TAG_INDEX&quot; | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 0              | &quot;storaged2&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 1              | &quot;storaged0&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
| 2              | &quot;storaged1&quot;         | &quot;FINISHED&quot; | 1607073046 | 1607073046 |
+----------------+---------------------+------------+------------+------------+
</code></pre></div>
<h3 id="_3">匹配点<a class="headerlink" href="#_3" title="Permanent link">&para;</a></h3>
<p>您可以在一对括号中使用自定义变量来表示模式中的点。例如<code>(v)</code>。</p>
<h3 id="_4">匹配标签<a class="headerlink" href="#_4" title="Permanent link">&para;</a></h3>
<blockquote>
<p><strong>说明</strong>：标签的索引和属性的索引不同。如果标签的某个属性有索引，但是标签本身没有索引，您无法基于该标签执行<code>MATCH</code>语句。</p>
</blockquote>
<p>您可以在点的右侧用<code>:&lt;tag_name&gt;</code>表示模式中的标签。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) RETURN v;
+---------------------------------------------------------------+
| v                                                             |
+---------------------------------------------------------------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})     |
+---------------------------------------------------------------+
| (&quot;player106&quot; :player{age: 25, name: &quot;Kyle Anderson&quot;})         |
+---------------------------------------------------------------+
| (&quot;player115&quot; :player{age: 40, name: &quot;Kobe Bryant&quot;})           |
+---------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_5">匹配点的属性<a class="headerlink" href="#_5" title="Permanent link">&para;</a></h3>
<p>您可以在标签的右侧用<code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code>表示模式中点的属性。</p>
<div class="highlight"><pre><span></span><code># 使用属性name搜索匹配的点。
nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<p>使用<code>WHERE</code>子句也可以实现相同的操作：</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player) WHERE v.name == &quot;Tim Duncan&quot; RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>openCypher兼容性</strong>：在openCypher 9中，<code>=</code>是相等运算符，在nGQL中，<code>==</code>是相等运算符，<code>=</code>是赋值运算符。</p>
</blockquote>
<h3 id="id">匹配点ID<a class="headerlink" href="#id" title="Permanent link">&para;</a></h3>
<p>您可以使用点ID去匹配点。<code>id()</code>函数可以检索点的ID。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v) WHERE id(v) == &#39;player101&#39; RETURN v;
+---------------------------------------------------+
| v                                                 |
+---------------------------------------------------+
| (player101) player.name:Tony Parker,player.age:36 |
+---------------------------------------------------+
</code></pre></div>
<p>要匹配多个点的ID，可以用<code>WHERE id(v) IN [vid_list]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player { name: &#39;Tim Duncan&#39; })--(v2) \
        WHERE id(v2) IN [&quot;player101&quot;, &quot;player102&quot;] RETURN v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+-----------------------------------------------------------+
</code></pre></div>
<h3 id="_6">匹配连接的点<a class="headerlink" href="#_6" title="Permanent link">&para;</a></h3>
<p>您可以使用<code>--</code>符号表示两个方向的边，并匹配这些边连接的点。</p>
<blockquote>
<p><strong>说明</strong>：在nGQL 1.x中，<code>--</code>符号用于行内注释，在nGQL 2.x中，<code>--</code>符号表示出边或入边。</p>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--(v2) \
        RETURN v2.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
| &quot;Marco Belinelli&quot;   |
+---------------------+
| &quot;Danny Green&quot;       |
+---------------------+
| &quot;Aron Baynes&quot;       |
+---------------------+
...
</code></pre></div>
<p>您可以在<code>--</code>符号上增加<code>&lt;</code>或<code>&gt;</code>符号指定边的方向。</p>
<div class="highlight"><pre><span></span><code># --&gt;表示边从v开始，指向v2。对于点v来说是出边，对于点v2来说是入边。
nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2) \
        RETURN v2.name AS Name;
+-----------------+
| Name            |
+-----------------+
| &quot;Spurs&quot;         |
+-----------------+
| &quot;Tony Parker&quot;   |
+-----------------+
| &quot;Manu Ginobili&quot; |
+-----------------+
</code></pre></div>
<p>如果需要扩展模式，可以增加更多点和边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2)&lt;--(v3) \
        RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;Tiago Splitter&quot;    |
+---------------------+
| &quot;Dejounte Murray&quot;   |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
...
</code></pre></div>
<p>如果您不需要引用点，可以省略括号中表示点的变量。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})--&gt;()&lt;--(v3) \
        RETURN v3.name AS Name;
+---------------------+
| Name                |
+---------------------+
| &quot;Tony Parker&quot;       |
+---------------------+
| &quot;LaMarcus Aldridge&quot; |
+---------------------+
| &quot;Rudy Gay&quot;          |
+---------------------+
| &quot;Danny Green&quot;       |
+---------------------+
| &quot;Kyle Anderson&quot;     |
+---------------------+
...
</code></pre></div>
<h3 id="_7">匹配路径<a class="headerlink" href="#_7" title="Permanent link">&para;</a></h3>
<p>连接起来的点和边构成了路径。您可以使用自定义变量命名路径。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})--&gt;(v2) \
        RETURN p;
+-------------------------------------------+
| p                                         |
+-------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt;   |
+-------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt; |
+-------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt; |
+-------------------------------------------+
</code></pre></div>
<blockquote>
<p><strong>openCypher兼容性</strong>：在nGQL中，<code>@</code>符号表示边的rank，在openCypher中，没有rank概念。</p>
</blockquote>
<h3 id="_8">匹配边<a class="headerlink" href="#_8" title="Permanent link">&para;</a></h3>
<p>除了用<code>--</code>、<code>--&gt;</code>、<code>&lt;--</code>表示未命名的边之外，您还可以在方括号中使用自定义变量命名边。例如<code>-[e]-</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player101&quot;-&gt;&quot;player100&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow &quot;player102&quot;-&gt;&quot;player100&quot; @0 {degree: 75}]                        |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_9">匹配边类型和属性<a class="headerlink" href="#_9" title="Permanent link">&para;</a></h3>
<p>和点一样，您可以用<code>:&lt;edge_type&gt;</code>表示模式中的边类型。例如<code>-[e:serve]-</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:serve]-(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<p>您可以用<code>{&lt;prop_name&gt;: &lt;prop_value&gt;}</code>表示模式中边类型的属性。例如<code>[e:follow{likeness:95}]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:follow{degree:95}]-&gt;(v2) \
        RETURN e;
+--------------------------------------------------------+
| e                                                      |
+--------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]     |
+--------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]     |
+--------------------------------------------------------+
</code></pre></div>
<h3 id="_10">匹配多个边类型<a class="headerlink" href="#_10" title="Permanent link">&para;</a></h3>
<p>使用<code>|</code>可以匹配多个边类型。例如<code>[e:follow|:serve]</code>。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e:follow|:serve]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_11">匹配多条边<a class="headerlink" href="#_11" title="Permanent link">&para;</a></h3>
<p>您可以扩展模式，匹配路径中的多条边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2)&lt;-[e:serve]-(v3) \
        RETURN v2, v3;
+------------------------------------+-----------------------------------------------------------+
| v2                                 | v3                                                        |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})       |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+------------------------------------+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;}) | (&quot;player103&quot; :player{age: 32, name: &quot;Rudy Gay&quot;})          |
+------------------------------------+-----------------------------------------------------------+
...
</code></pre></div>
<h3 id="_12">匹配定长路径<a class="headerlink" href="#_12" title="Permanent link">&para;</a></h3>
<p>您可以在模式中使用<code>:&lt;edge_type&gt;*&lt;hop&gt;</code>匹配定长路径。<code>hop</code>必须是一个非负整数。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*2]-&gt;(v2) \
        RETURN DISTINCT v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
</code></pre></div>
<p>如果<code>hop</code>为0，模式会匹配路径上的起始点。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) -[*0]-&gt; (v2) \
        RETURN v2;
+----------------------------------------------------+
| v2                                                 |
+----------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;}) |
+----------------------------------------------------+
</code></pre></div>
<h3 id="_13">匹配变长路径<a class="headerlink" href="#_13" title="Permanent link">&para;</a></h3>
<p>您可以在模式中使用<code>:&lt;edge_type&gt;*[minHop]..&lt;maxHop&gt;</code>匹配变长路径。</p>
<table>
<thead>
<tr>
<th align="left">参数</th>
<th align="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td align="left"><code>minHop</code></td>
<td align="left">可选项。表示路径的最小长度。<code>minHop</code>必须是一个非负整数，默认值为1。</td>
</tr>
<tr>
<td align="left"><code>maxHop</code></td>
<td align="left">必选项。表示路径的最大长度。<code>maxHop</code>必须是一个非负整数，没有默认值。</td>
</tr>
</tbody>
</table>
<blockquote>
<p><strong>openCypher兼容性</strong>：在openCypher中，<code>maxHop</code>是可选项，默认为无穷大。当没有设置时，<code>..</code>可以省略。在nGQL中，<code>maxHop</code>是必选项，而且<code>..</code>不可以省略。</p>
</blockquote>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*1..3]-&gt;(v2) \
        RETURN v2 AS Friends;
+-----------------------------------------------------------+
| Friends                                                   |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        |
+-----------------------------------------------------------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) |
+-----------------------------------------------------------+
</code></pre></div>
<p>您可以使用<code>DISTINCT</code>关键字聚合重复结果。</p>
<p>```ngql
nebula&gt; MATCH p=(v:player{name:"Tim Duncan"})-[e:follow*1..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | COUNT(v2) |
+-----------------------------------------------------------+-----------+
| ("player125" :player{age: 41, name: "Manu Ginobili"})     | 3         |
+-----------------------------------------------------------+-----------+
| ("player102" :player{age: 33, name: "LaMarcus Aldridge"}) | 1         |
+-----------------------------------------------------------+-----------+
| ("player100" :player{age: 42, name: "Tim Duncan"})        | 4         |
+-----------------------------------------------------------+-----------+
| ("player101" :player{age: 36, name: "Tony Parker"})       | 3         |
+-----------------------------------------------------------+-----------+
<div class="highlight"><pre><span></span><code>如果`minHop`为`0`，模式会匹配路径上的起始点。与上个示例相比，下面的示例设置`minHop`为`0`，因为它是起始点，所以结果集中`&quot;Tim Duncan&quot;`比上个示例多计算一次。

```ngql
nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow*0..3]-&gt;(v2:player) \
        RETURN DISTINCT v2 AS Friends, count(v2);
+-----------------------------------------------------------+-----------+
| Friends                                                   | COUNT(v2) |
+-----------------------------------------------------------+-----------+
| (&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})     | 3         |
+-----------------------------------------------------------+-----------+
| (&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})       | 3         |
+-----------------------------------------------------------+-----------+
| (&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;}) | 1         |
+-----------------------------------------------------------+-----------+
| (&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})        | 5         |
+-----------------------------------------------------------+-----------+
</code></pre></div></p>
<h3 id="_14">匹配多个边类型的变长路径<a class="headerlink" href="#_14" title="Permanent link">&para;</a></h3>
<p>您可以在变长或定长模式中指定多个边类型。<code>hop</code>、<code>minHop</code>和<code>maxHop</code>对所有边类型都生效。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e:follow|serve*2]-&gt;(v2) \
        RETURN DISTINCT v2;
+-----------------------------------------------------------+
| v2                                                        |
+-----------------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42})        |
+-----------------------------------------------------------+
| (&quot;player102&quot; :player{name: &quot;LaMarcus Aldridge&quot;, age: 33}) |
+-----------------------------------------------------------+
| (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})     |
+-----------------------------------------------------------+
| (&quot;player204&quot; :team{name: &quot;Spurs&quot;})                        |
+-----------------------------------------------------------+
| (&quot;player215&quot; :team{name: &quot;Hornets&quot;})                      |
+-----------------------------------------------------------+
</code></pre></div>
<h2 id="_15">常用检索操作<a class="headerlink" href="#_15" title="Permanent link">&para;</a></h2>
<h3 id="_16">检索点或边的信息<a class="headerlink" href="#_16" title="Permanent link">&para;</a></h3>
<p>使用<code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}</code>检索点或边的所有信息。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v;
+----------------------------------------------------+
| v                                                  |
+----------------------------------------------------+
| (&quot;player100&quot; :player{name: &quot;Tim Duncan&quot;, age: 42}) |
+----------------------------------------------------+

nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;(v2) \
        RETURN e;
+---------------------------------------------------------------------------+
| e                                                                         |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]                        |
+---------------------------------------------------------------------------+
| [:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]     |
+---------------------------------------------------------------------------+
</code></pre></div>
<h3 id="id_1">检索点ID<a class="headerlink" href="#id_1" title="Permanent link">&para;</a></h3>
<p>使用<code>id()</code>函数检索点ID。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN id(v);
+-------------+
| id(v)       |
+-------------+
| &quot;player100&quot; |
+-------------+
</code></pre></div>
<h3 id="_17">检索标签<a class="headerlink" href="#_17" title="Permanent link">&para;</a></h3>
<p>使用<code>labels()</code>函数检索点上的标签列表。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN labels(v);
+------------+
| labels(v)  |
+------------+
| [&quot;player&quot;] |
+------------+
</code></pre></div>
<p>检索列表<code>labels(v)</code>中的第N个元素，可以使用<code>labels(v)[n-1]</code>。例如下面示例使用<code>labels(v)[0]</code>检索第一个元素。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN labels(v)[0];
+--------------+
| labels(v)[0] |
+--------------+
| &quot;player&quot;     |
+--------------+
</code></pre></div>
<h3 id="_18">检索点或边的单个属性<a class="headerlink" href="#_18" title="Permanent link">&para;</a></h3>
<p>使用<code>RETURN {&lt;vertex_name&gt; | &lt;edge_name&gt;}.&lt;property&gt;</code>检索单个属性。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v.age;
+-------+
| v.age |
+-------+
| 42    |
+-------+
</code></pre></div>
<p>使用<code>AS</code>设置属性的别名。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH (v:player{name:&quot;Tim Duncan&quot;}) \
        RETURN v.age AS Age;
+-----+
| Age |
+-----+
| 42  |
+-----+
</code></pre></div>
<h3 id="_19">检索点或边的所有属性<a class="headerlink" href="#_19" title="Permanent link">&para;</a></h3>
<p>使用<code>properties()</code>函数检索点或边的所有属性。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) \
        RETURN properties(v2);
+------------------------------------+
| properties(v2)                     |
+------------------------------------+
| {&quot;name&quot;:&quot;Spurs&quot;}                   |
+------------------------------------+
| {&quot;name&quot;:&quot;Tony Parker&quot;, &quot;age&quot;:36}   |
+------------------------------------+
| {&quot;age&quot;:41, &quot;name&quot;:&quot;Manu Ginobili&quot;} |
+------------------------------------+
</code></pre></div>
<h3 id="_20">检索边类型<a class="headerlink" href="#_20" title="Permanent link">&para;</a></h3>
<p>使用<code>type()</code>函数检索匹配的边类型。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[e]-&gt;() \
        RETURN DISTINCT type(e);
+----------+
| type(e)  |
+----------+
| &quot;follow&quot; |
+----------+
| &quot;serve&quot;  |
+----------+
</code></pre></div>
<h3 id="_21">检索路径<a class="headerlink" href="#_21" title="Permanent link">&para;</a></h3>
<p>使用<code>RETURN &lt;path_name&gt;</code>检索匹配路径的所有信息。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[*3]-&gt;() \
        RETURN p;
+-------------------------------------------------------------------------------------------------+
| p                                                                                               |
+-------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})-[:serve@0 {end_year: 2019, start_year: 2015}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;           |
+-------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})-[:serve@0 {end_year: 2015, start_year: 2006}]-&gt;(&quot;team203&quot; :team{name: &quot;Trail Blazers&quot;})&gt;   |
+-------------------------------------------------------------------------------------------------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})-[:follow@0 {degree: 75}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})&gt;             |
+-------------------------------------------------------------------------------------------------+
...
</code></pre></div>
<h3 id="_22">检索路径中的点<a class="headerlink" href="#_22" title="Permanent link">&para;</a></h3>
<p>使用<code>nodes()</code>函数检索路径中的所有点。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) \
        RETURN nodes(p);
+---------------------------------------------------------------------------------------------------------------------+
| nodes(p)                                                                                                            |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player204&quot; :team{name: &quot;Spurs&quot;})]                    |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player101&quot; :player{name: &quot;Tony Parker&quot;, age: 36})]   |
+---------------------------------------------------------------------------------------------------------------------+
| [(&quot;player100&quot; :star{} :player{age: 42, name: &quot;Tim Duncan&quot;}), (&quot;player125&quot; :player{name: &quot;Manu Ginobili&quot;, age: 41})] |
+---------------------------------------------------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_23">检索路径中的边<a class="headerlink" href="#_23" title="Permanent link">&para;</a></h3>
<p>使用<code>relationships()</code>函数检索路径中的所有边。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[]-&gt;(v2) \
        RETURN relationships(p);
+-----------------------------------------------------------------------------+
| relationships(p)                                                            |
+-----------------------------------------------------------------------------+
| [[:follow &quot;player100&quot;-&gt;&quot;player101&quot; @0 {degree: 95}]]                        |
+-----------------------------------------------------------------------------+
| [[:follow &quot;player100&quot;-&gt;&quot;player125&quot; @0 {degree: 95}]]                        |
+-----------------------------------------------------------------------------+
| [[:serve &quot;player100&quot;-&gt;&quot;team204&quot; @0 {end_year: 2016, start_year: 1997}]]     |
+-----------------------------------------------------------------------------+
</code></pre></div>
<h3 id="_24">检索路径长度<a class="headerlink" href="#_24" title="Permanent link">&para;</a></h3>
<p>使用<code>length()</code>函数检索路径的长度。</p>
<div class="highlight"><pre><span></span><code>nebula&gt; MATCH p=(v:player{name:&quot;Tim Duncan&quot;})-[*..2]-&gt;(v2) \
        RETURN p AS Paths, length(p) AS Length;
+----------------------------------------------------------------------+--------+
| Paths                                                                | Length |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})-[:serve@0 {end_year: 2018, start_year: 2002}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;   | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})&gt;      | 2      |
+----------------------------------------------------------------------+--------+
|  &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:serve@0 {end_year: 2019, start_year: 2018}]-&gt;(&quot;team215&quot; :team{name: &quot;Hornets&quot;})&gt;  | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:serve@0 {end_year: 2018, start_year: 1999}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;     | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt;     | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 90}]-&gt;(&quot;player102&quot; :player{age: 33, name: &quot;LaMarcus Aldridge&quot;})&gt; | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player101&quot; :player{age: 36, name: &quot;Tony Parker&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})&gt;        | 2      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:serve@0 {end_year: 2016, start_year: 1997}]-&gt;(&quot;team204&quot; :team{name: &quot;Spurs&quot;})&gt;                                                                                   | 1      |
+----------------------------------------------------------------------+--------+
| &lt;(&quot;player100&quot; :player{age: 42, name: &quot;Tim Duncan&quot;})-[:follow@0 {degree: 95}]-&gt;(&quot;player125&quot; :player{age: 41, name: &quot;Manu Ginobili&quot;})&gt;                                                                                   | 1      |
+----------------------------------------------------------------------+--------+
</code></pre></div>
                
                  
                
                
              
              
                


              
            </article>
          </div>
        </div>
      </main>
      
        
<footer class="md-footer">
  
    <div class="md-footer-nav">
      <nav class="md-footer-nav__inner md-grid">
        
          <a href="../../6.functions-and-expressions/9.user-defined-functions/" title="User-defined functions" class="md-flex md-footer-nav__link md-footer-nav__link--prev" rel="prev">
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-back md-footer-nav__button"></i>
            </div>
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  上一页
                </span>
                User-defined functions
              </span>
            </div>
          </a>
        
        
          <a href="../5.lookup/" title="LOOKUP" class="md-flex md-footer-nav__link md-footer-nav__link--next" rel="next">
            <div class="md-flex__cell md-flex__cell--stretch md-footer-nav__title">
              <span class="md-flex__ellipsis">
                <span class="md-footer-nav__direction">
                  下一页
                </span>
                LOOKUP
              </span>
            </div>
            <div class="md-flex__cell md-flex__cell--shrink">
              <i class="md-icon md-icon--arrow-forward md-footer-nav__button"></i>
            </div>
          </a>
        
      </nav>
    </div>
  
  <div class="md-footer-meta md-typeset">
    <div class="md-footer-meta__inner md-grid">
      <div class="md-footer-copyright">
        
          <div class="md-footer-copyright__highlight">
            Copyright &copy; 2020 Nebula Graph - 浙ICP备20010487号
          </div>
        
        powered by
        <a href="https://www.mkdocs.org" target="_blank" rel="noopener">MkDocs</a>
        and
        <a href="https://squidfunk.github.io/mkdocs-material/" target="_blank" rel="noopener">
          Material for MkDocs</a>
      </div>
      
  <div class="md-footer-social">
    <link rel="stylesheet" href="../../../assets/fonts/font-awesome.css">
    
      <a href="https://github.com/vesoft-inc/nebula" target="_blank" rel="noopener" title="github" class="md-footer-social__link fa fa-github"></a>
    
      <a href="https://www.weibo.com/u/7122684542?is_hot=1" target="_blank" rel="noopener" title="weibo" class="md-footer-social__link fa fa-weibo"></a>
    
      <a href="https://twitter.com/NebulaGraph" target="_blank" rel="noopener" title="twitter" class="md-footer-social__link fa fa-twitter"></a>
    
      <a href="https://www.linkedin.com/company/vesoft-nebula-graph/" target="_blank" rel="noopener" title="linkedin" class="md-footer-social__link fa fa-linkedin"></a>
    
      <a href="https://www.facebook.com/NebulaGraph/" target="_blank" rel="noopener" title="facebook" class="md-footer-social__link fa fa-facebook"></a>
    
      <a href="https://app.slack.com/client/TJB3N2BPD/CJNFUM7AR" target="_blank" rel="noopener" title="slack" class="md-footer-social__link fa fa-slack"></a>
    
  </div>

    </div>
  </div>
</footer>
      
    </div>
    
      <script src="../../../assets/javascripts/application.c33a9706.js"></script>
      
        
        
          
          <script src="../../../assets/javascripts/lunr/lunr.stemmer.support.js"></script>
          
            
              
                <script src="../../../assets/javascripts/lunr/tinyseg.js"></script>
              
              
                <script src="../../../assets/javascripts/lunr/lunr.ja.js"></script>
              
            
          
          
        
      
      <script>app.initialize({version:"1.1.2",url:{base:"../../.."}})</script>
      
        <script src="../../../js/version-select.js"></script>
      
    
  </body>
</html>